a2
a2+
a2++
a2#
a3
a3+
a3++
a3#
a4
a4+
a4++
a4#
a5
a5+
a5++
a5#
a6
a6+
a6++
a6#
a7
a7+
a7++
a7#
b2
b2+
b2++
b2#
b3
b3+
b3++
b3#
b4
b4+
b4++
b4#
b5
b5+
b5++
b5#
b6
b6+
b6++
b6#
b7
b7+
b7++
b7#
c2
c2+
c2++
c2#
c3
c3+
c3++
c3#
c4
c4+
c4++
c4#
c5
c5+
c5++
c5#
c6
c6+
c6++
c6#
c7
c7+
c7++
c7#
d2
d2+
d2++
d2#
d3
d3+
d3++
d3#
d4
d4+
d4++
d4#
d5
d5+
d5++
d5#
d6
d6+
d6++
d6#
d7
d7+
d7++
d7#
e2
e2+
e2++
e2#
e3
e3+
e3++
e3#
e4
e4+
e4++
e4#
e5
e5+
e5++
e5#
e6
e6+
e6++
e6#
e7
e7+
e7++
e7#
f2
f2+
f2++
f2#
f3
f3+
f3++
f3#
f4
f4+
f4++
f4#
f5
f5+
f5++
f5#
f6
f6+
f6++
f6#
f7
f7+
f7++
f7#
g2
g2+
g2++
g2#
g3
g3+
g3++
g3#
g4
g4+
g4++
g4#
g5
g5+
g5++
g5#
g6
g6+
g6++
g6#
g7
g7+
g7++
g7#
h2
h2+
h2++
h2#
h3
h3+
h3++
h3#
h4
h4+
h4++
h4#
h5
h5+
h5++
h5#
h6
h6+
h6++
h6#
h7
h7+
h7++
h7#
hxa2
hxa2+
hxa2++
hxa2#
bxa2
bxa2+
bxa2++
bxa2#
hxa3
hxa3+
hxa3++
hxa3#
bxa3
bxa3+
bxa3++
bxa3#
hxa4
hxa4+
hxa4++
hxa4#
bxa4
bxa4+
bxa4++
bxa4#
hxa5
hxa5+
hxa5++
hxa5#
bxa5
bxa5+
bxa5++
bxa5#
hxa6
hxa6+
hxa6++
hxa6#
bxa6
bxa6+
bxa6++
bxa6#
hxa7
hxa7+
hxa7++
hxa7#
bxa7
bxa7+
bxa7++
bxa7#
axb2
axb2+
axb2++
axb2#
cxb2
cxb2+
cxb2++
cxb2#
axb3
axb3+
axb3++
axb3#
cxb3
cxb3+
cxb3++
cxb3#
axb4
axb4+
axb4++
axb4#
cxb4
cxb4+
cxb4++
cxb4#
axb5
axb5+
axb5++
axb5#
cxb5
cxb5+
cxb5++
cxb5#
axb6
axb6+
axb6++
axb6#
cxb6
cxb6+
cxb6++
cxb6#
axb7
axb7+
axb7++
axb7#
cxb7
cxb7+
cxb7++
cxb7#
bxc2
bxc2+
bxc2++
bxc2#
dxc2
dxc2+
dxc2++
dxc2#
bxc3
bxc3+
bxc3++
bxc3#
dxc3
dxc3+
dxc3++
dxc3#
bxc4
bxc4+
bxc4++
bxc4#
dxc4
dxc4+
dxc4++
dxc4#
bxc5
bxc5+
bxc5++
bxc5#
dxc5
dxc5+
dxc5++
dxc5#
bxc6
bxc6+
bxc6++
bxc6#
dxc6
dxc6+
dxc6++
dxc6#
bxc7
bxc7+
bxc7++
bxc7#
dxc7
dxc7+
dxc7++
dxc7#
cxd2
cxd2+
cxd2++
cxd2#
exd2
exd2+
exd2++
exd2#
cxd3
cxd3+
cxd3++
cxd3#
exd3
exd3+
exd3++
exd3#
cxd4
cxd4+
cxd4++
cxd4#
exd4
exd4+
exd4++
exd4#
cxd5
cxd5+
cxd5++
cxd5#
exd5
exd5+
exd5++
exd5#
cxd6
cxd6+
cxd6++
cxd6#
exd6
exd6+
exd6++
exd6#
cxd7
cxd7+
cxd7++
cxd7#
exd7
exd7+
exd7++
exd7#
dxe2
dxe2+
dxe2++
dxe2#
fxe2
fxe2+
fxe2++
fxe2#
dxe3
dxe3+
dxe3++
dxe3#
fxe3
fxe3+
fxe3++
fxe3#
dxe4
dxe4+
dxe4++
dxe4#
fxe4
fxe4+
fxe4++
fxe4#
dxe5
dxe5+
dxe5++
dxe5#
fxe5
fxe5+
fxe5++
fxe5#
dxe6
dxe6+
dxe6++
dxe6#
fxe6
fxe6+
fxe6++
fxe6#
dxe7
dxe7+
dxe7++
dxe7#
fxe7
fxe7+
fxe7++
fxe7#
exf2
exf2+
exf2++
exf2#
gxf2
gxf2+
gxf2++
gxf2#
exf3
exf3+
exf3++
exf3#
gxf3
gxf3+
gxf3++
gxf3#
exf4
exf4+
exf4++
exf4#
gxf4
gxf4+
gxf4++
gxf4#
exf5
exf5+
exf5++
exf5#
gxf5
gxf5+
gxf5++
gxf5#
exf6
exf6+
exf6++
exf6#
gxf6
gxf6+
gxf6++
gxf6#
exf7
exf7+
exf7++
exf7#
gxf7
gxf7+
gxf7++
gxf7#
fxg2
fxg2+
fxg2++
fxg2#
hxg2
hxg2+
hxg2++
hxg2#
fxg3
fxg3+
fxg3++
fxg3#
hxg3
hxg3+
hxg3++
hxg3#
fxg4
fxg4+
fxg4++
fxg4#
hxg4
hxg4+
hxg4++
hxg4#
fxg5
fxg5+
fxg5++
fxg5#
hxg5
hxg5+
hxg5++
hxg5#
fxg6
fxg6+
fxg6++
fxg6#
hxg6
hxg6+
hxg6++
hxg6#
fxg7
fxg7+
fxg7++
fxg7#
hxg7
hxg7+
hxg7++
hxg7#
gxh2
gxh2+
gxh2++
gxh2#
axh2
axh2+
axh2++
axh2#
gxh3
gxh3+
gxh3++
gxh3#
axh3
axh3+
axh3++
axh3#
gxh4
gxh4+
gxh4++
gxh4#
axh4
axh4+
axh4++
axh4#
gxh5
gxh5+
gxh5++
gxh5#
axh5
axh5+
axh5++
axh5#
gxh6
gxh6+
gxh6++
gxh6#
axh6
axh6+
axh6++
axh6#
gxh7
gxh7+
gxh7++
gxh7#
axh7
axh7+
axh7++
axh7#
a1=N
a1=N+
a1=N++
a1=N#
a1=B
a1=B+
a1=B++
a1=B#
a1=R
a1=R+
a1=R++
a1=R#
a1=Q
a1=Q+
a1=Q++
a1=Q#
a8=N
a8=N+
a8=N++
a8=N#
a8=B
a8=B+
a8=B++
a8=B#
a8=R
a8=R+
a8=R++
a8=R#
a8=Q
a8=Q+
a8=Q++
a8=Q#
b1=N
b1=N+
b1=N++
b1=N#
b1=B
b1=B+
b1=B++
b1=B#
b1=R
b1=R+
b1=R++
b1=R#
b1=Q
b1=Q+
b1=Q++
b1=Q#
b8=N
b8=N+
b8=N++
b8=N#
b8=B
b8=B+
b8=B++
b8=B#
b8=R
b8=R+
b8=R++
b8=R#
b8=Q
b8=Q+
b8=Q++
b8=Q#
c1=N
c1=N+
c1=N++
c1=N#
c1=B
c1=B+
c1=B++
c1=B#
c1=R
c1=R+
c1=R++
c1=R#
c1=Q
c1=Q+
c1=Q++
c1=Q#
c8=N
c8=N+
c8=N++
c8=N#
c8=B
c8=B+
c8=B++
c8=B#
c8=R
c8=R+
c8=R++
c8=R#
c8=Q
c8=Q+
c8=Q++
c8=Q#
d1=N
d1=N+
d1=N++
d1=N#
d1=B
d1=B+
d1=B++
d1=B#
d1=R
d1=R+
d1=R++
d1=R#
d1=Q
d1=Q+
d1=Q++
d1=Q#
d8=N
d8=N+
d8=N++
d8=N#
d8=B
d8=B+
d8=B++
d8=B#
d8=R
d8=R+
d8=R++
d8=R#
d8=Q
d8=Q+
d8=Q++
d8=Q#
e1=N
e1=N+
e1=N++
e1=N#
e1=B
e1=B+
e1=B++
e1=B#
e1=R
e1=R+
e1=R++
e1=R#
e1=Q
e1=Q+
e1=Q++
e1=Q#
e8=N
e8=N+
e8=N++
e8=N#
e8=B
e8=B+
e8=B++
e8=B#
e8=R
e8=R+
e8=R++
e8=R#
e8=Q
e8=Q+
e8=Q++
e8=Q#
f1=N
f1=N+
f1=N++
f1=N#
f1=B
f1=B+
f1=B++
f1=B#
f1=R
f1=R+
f1=R++
f1=R#
f1=Q
f1=Q+
f1=Q++
f1=Q#
f8=N
f8=N+
f8=N++
f8=N#
f8=B
f8=B+
f8=B++
f8=B#
f8=R
f8=R+
f8=R++
f8=R#
f8=Q
f8=Q+
f8=Q++
f8=Q#
g1=N
g1=N+
g1=N++
g1=N#
g1=B
g1=B+
g1=B++
g1=B#
g1=R
g1=R+
g1=R++
g1=R#
g1=Q
g1=Q+
g1=Q++
g1=Q#
g8=N
g8=N+
g8=N++
g8=N#
g8=B
g8=B+
g8=B++
g8=B#
g8=R
g8=R+
g8=R++
g8=R#
g8=Q
g8=Q+
g8=Q++
g8=Q#
h1=N
h1=N+
h1=N++
h1=N#
h1=B
h1=B+
h1=B++
h1=B#
h1=R
h1=R+
h1=R++
h1=R#
h1=Q
h1=Q+
h1=Q++
h1=Q#
h8=N
h8=N+
h8=N++
h8=N#
h8=B
h8=B+
h8=B++
h8=B#
h8=R
h8=R+
h8=R++
h8=R#
h8=Q
h8=Q+
h8=Q++
h8=Q#
hxa1=N
hxa1=N+
hxa1=N++
hxa1=N#
bxa1=N
bxa1=N+
bxa1=N++
bxa1=N#
hxa1=B
hxa1=B+
hxa1=B++
hxa1=B#
bxa1=B
bxa1=B+
bxa1=B++
bxa1=B#
hxa1=R
hxa1=R+
hxa1=R++
hxa1=R#
bxa1=R
bxa1=R+
bxa1=R++
bxa1=R#
hxa1=Q
hxa1=Q+
hxa1=Q++
hxa1=Q#
bxa1=Q
bxa1=Q+
bxa1=Q++
bxa1=Q#
hxa8=N
hxa8=N+
hxa8=N++
hxa8=N#
bxa8=N
bxa8=N+
bxa8=N++
bxa8=N#
hxa8=B
hxa8=B+
hxa8=B++
hxa8=B#
bxa8=B
bxa8=B+
bxa8=B++
bxa8=B#
hxa8=R
hxa8=R+
hxa8=R++
hxa8=R#
bxa8=R
bxa8=R+
bxa8=R++
bxa8=R#
hxa8=Q
hxa8=Q+
hxa8=Q++
hxa8=Q#
bxa8=Q
bxa8=Q+
bxa8=Q++
bxa8=Q#
axb1=N
axb1=N+
axb1=N++
axb1=N#
cxb1=N
cxb1=N+
cxb1=N++
cxb1=N#
axb1=B
axb1=B+
axb1=B++
axb1=B#
cxb1=B
cxb1=B+
cxb1=B++
cxb1=B#
axb1=R
axb1=R+
axb1=R++
axb1=R#
cxb1=R
cxb1=R+
cxb1=R++
cxb1=R#
axb1=Q
axb1=Q+
axb1=Q++
axb1=Q#
cxb1=Q
cxb1=Q+
cxb1=Q++
cxb1=Q#
axb8=N
axb8=N+
axb8=N++
axb8=N#
cxb8=N
cxb8=N+
cxb8=N++
cxb8=N#
axb8=B
axb8=B+
axb8=B++
axb8=B#
cxb8=B
cxb8=B+
cxb8=B++
cxb8=B#
axb8=R
axb8=R+
axb8=R++
axb8=R#
cxb8=R
cxb8=R+
cxb8=R++
cxb8=R#
axb8=Q
axb8=Q+
axb8=Q++
axb8=Q#
cxb8=Q
cxb8=Q+
cxb8=Q++
cxb8=Q#
bxc1=N
bxc1=N+
bxc1=N++
bxc1=N#
dxc1=N
dxc1=N+
dxc1=N++
dxc1=N#
bxc1=B
bxc1=B+
bxc1=B++
bxc1=B#
dxc1=B
dxc1=B+
dxc1=B++
dxc1=B#
bxc1=R
bxc1=R+
bxc1=R++
bxc1=R#
dxc1=R
dxc1=R+
dxc1=R++
dxc1=R#
bxc1=Q
bxc1=Q+
bxc1=Q++
bxc1=Q#
dxc1=Q
dxc1=Q+
dxc1=Q++
dxc1=Q#
bxc8=N
bxc8=N+
bxc8=N++
bxc8=N#
dxc8=N
dxc8=N+
dxc8=N++
dxc8=N#
bxc8=B
bxc8=B+
bxc8=B++
bxc8=B#
dxc8=B
dxc8=B+
dxc8=B++
dxc8=B#
bxc8=R
bxc8=R+
bxc8=R++
bxc8=R#
dxc8=R
dxc8=R+
dxc8=R++
dxc8=R#
bxc8=Q
bxc8=Q+
bxc8=Q++
bxc8=Q#
dxc8=Q
dxc8=Q+
dxc8=Q++
dxc8=Q#
cxd1=N
cxd1=N+
cxd1=N++
cxd1=N#
exd1=N
exd1=N+
exd1=N++
exd1=N#
cxd1=B
cxd1=B+
cxd1=B++
cxd1=B#
exd1=B
exd1=B+
exd1=B++
exd1=B#
cxd1=R
cxd1=R+
cxd1=R++
cxd1=R#
exd1=R
exd1=R+
exd1=R++
exd1=R#
cxd1=Q
cxd1=Q+
cxd1=Q++
cxd1=Q#
exd1=Q
exd1=Q+
exd1=Q++
exd1=Q#
cxd8=N
cxd8=N+
cxd8=N++
cxd8=N#
exd8=N
exd8=N+
exd8=N++
exd8=N#
cxd8=B
cxd8=B+
cxd8=B++
cxd8=B#
exd8=B
exd8=B+
exd8=B++
exd8=B#
cxd8=R
cxd8=R+
cxd8=R++
cxd8=R#
exd8=R
exd8=R+
exd8=R++
exd8=R#
cxd8=Q
cxd8=Q+
cxd8=Q++
cxd8=Q#
exd8=Q
exd8=Q+
exd8=Q++
exd8=Q#
dxe1=N
dxe1=N+
dxe1=N++
dxe1=N#
fxe1=N
fxe1=N+
fxe1=N++
fxe1=N#
dxe1=B
dxe1=B+
dxe1=B++
dxe1=B#
fxe1=B
fxe1=B+
fxe1=B++
fxe1=B#
dxe1=R
dxe1=R+
dxe1=R++
dxe1=R#
fxe1=R
fxe1=R+
fxe1=R++
fxe1=R#
dxe1=Q
dxe1=Q+
dxe1=Q++
dxe1=Q#
fxe1=Q
fxe1=Q+
fxe1=Q++
fxe1=Q#
dxe8=N
dxe8=N+
dxe8=N++
dxe8=N#
fxe8=N
fxe8=N+
fxe8=N++
fxe8=N#
dxe8=B
dxe8=B+
dxe8=B++
dxe8=B#
fxe8=B
fxe8=B+
fxe8=B++
fxe8=B#
dxe8=R
dxe8=R+
dxe8=R++
dxe8=R#
fxe8=R
fxe8=R+
fxe8=R++
fxe8=R#
dxe8=Q
dxe8=Q+
dxe8=Q++
dxe8=Q#
fxe8=Q
fxe8=Q+
fxe8=Q++
fxe8=Q#
exf1=N
exf1=N+
exf1=N++
exf1=N#
gxf1=N
gxf1=N+
gxf1=N++
gxf1=N#
exf1=B
exf1=B+
exf1=B++
exf1=B#
gxf1=B
gxf1=B+
gxf1=B++
gxf1=B#
exf1=R
exf1=R+
exf1=R++
exf1=R#
gxf1=R
gxf1=R+
gxf1=R++
gxf1=R#
exf1=Q
exf1=Q+
exf1=Q++
exf1=Q#
gxf1=Q
gxf1=Q+
gxf1=Q++
gxf1=Q#
exf8=N
exf8=N+
exf8=N++
exf8=N#
gxf8=N
gxf8=N+
gxf8=N++
gxf8=N#
exf8=B
exf8=B+
exf8=B++
exf8=B#
gxf8=B
gxf8=B+
gxf8=B++
gxf8=B#
exf8=R
exf8=R+
exf8=R++
exf8=R#
gxf8=R
gxf8=R+
gxf8=R++
gxf8=R#
exf8=Q
exf8=Q+
exf8=Q++
exf8=Q#
gxf8=Q
gxf8=Q+
gxf8=Q++
gxf8=Q#
fxg1=N
fxg1=N+
fxg1=N++
fxg1=N#
hxg1=N
hxg1=N+
hxg1=N++
hxg1=N#
fxg1=B
fxg1=B+
fxg1=B++
fxg1=B#
hxg1=B
hxg1=B+
hxg1=B++
hxg1=B#
fxg1=R
fxg1=R+
fxg1=R++
fxg1=R#
hxg1=R
hxg1=R+
hxg1=R++
hxg1=R#
fxg1=Q
fxg1=Q+
fxg1=Q++
fxg1=Q#
hxg1=Q
hxg1=Q+
hxg1=Q++
hxg1=Q#
fxg8=N
fxg8=N+
fxg8=N++
fxg8=N#
hxg8=N
hxg8=N+
hxg8=N++
hxg8=N#
fxg8=B
fxg8=B+
fxg8=B++
fxg8=B#
hxg8=B
hxg8=B+
hxg8=B++
hxg8=B#
fxg8=R
fxg8=R+
fxg8=R++
fxg8=R#
hxg8=R
hxg8=R+
hxg8=R++
hxg8=R#
fxg8=Q
fxg8=Q+
fxg8=Q++
fxg8=Q#
hxg8=Q
hxg8=Q+
hxg8=Q++
hxg8=Q#
gxh1=N
gxh1=N+
gxh1=N++
gxh1=N#
axh1=N
axh1=N+
axh1=N++
axh1=N#
gxh1=B
gxh1=B+
gxh1=B++
gxh1=B#
axh1=B
axh1=B+
axh1=B++
axh1=B#
gxh1=R
gxh1=R+
gxh1=R++
gxh1=R#
axh1=R
axh1=R+
axh1=R++
axh1=R#
gxh1=Q
gxh1=Q+
gxh1=Q++
gxh1=Q#
axh1=Q
axh1=Q+
axh1=Q++
axh1=Q#
gxh8=N
gxh8=N+
gxh8=N++
gxh8=N#
axh8=N
axh8=N+
axh8=N++
axh8=N#
gxh8=B
gxh8=B+
gxh8=B++
gxh8=B#
axh8=B
axh8=B+
axh8=B++
axh8=B#
gxh8=R
gxh8=R+
gxh8=R++
gxh8=R#
axh8=R
axh8=R+
axh8=R++
axh8=R#
gxh8=Q
gxh8=Q+
gxh8=Q++
gxh8=Q#
axh8=Q
axh8=Q+
axh8=Q++
axh8=Q#
Na4
N2xb4+
N6xg5++
Ndxc5+
Nb2xd3#
N5f6++
N1d2
N1f2+
Nfxe5+
Ngxe8#
N7d5
Nh7g5+
N1g2
Nfe7+
N7f1
Nd7xc5+
Ndc8+
Na4xb6
Nd5b4
Nf5e7+
Nh5+
N3xf1
N4c6#
Na7c8#
Ncb8++
N1xd7+
N4d3+
N1f3
Nc6d4#
Ncxe1++
Na4xc5
N2xb4#
Nbxc3#
N4c5
Ng8f6+
Nfg3
Nb5a7++
N4xc6+
Nc8xa1
Nh7xg1
Ngxh8++
Ne7c6++
Nf8xd1+
Naxh5++
Ndxb1#
Ne6d8#
Nfxg1+
Nah8+
N6b5++
N2xe1++
Nb1a3++
Ne8f2++
Ne5xg4#
Nxh7#
N3d1+
Ne1xd7#
Nf6d7
N6xg7+
N1xg3+
Na1c2
Ng4a3
Nb4c2
Nf2h3#
N8h2++
Nag4+
Nfh1+
Nfxd6++
Nf8
Nxb6++
Ndc7
N6e5+
Nhb2+
Naxb5+
Nah6#
Nfxd8++
Ndf3++
Nbd4
Nexg1#
Nbxh6
N6xg8#
Nd1e3#
Ng8xh2++
Nc1d3#
Nd4xf5#
Nb8c6
Ne2f8#
N6xh4++
N8c7
Na7b5++
Nd6xb5++
N4xg2
Ne5xc4+
Nb7xd6#
Nd2e4
Nf4xg2
Ng6e5+
Nh2#
N4xe6
Nxg3
Ng5xe6++
Nfe1
Ne2g1++
Nd4b3
Nab6++
Nd7c5#
Ng3xf1++
Nbxc3
Nd1xb2+
Nh2g4+
Na5xh7++
Nca7#
Na1h3++
Ngf3#
Nf5e7
Ng4h6#
Ne8d2
N1xa3++
Nc5xb3#
N3xe4+
N3xg4
Nxc7
Nexg7
Ngh1
Nc4xa3++
Na7xb1++
Nexg4++
Nd4e6++
N4c2+
N3xc4+
Nfh8++
Na1g8#
Nf2d1+
N5c7+
N6xe4+
Nh4g2#
N7xf8+
Ng5e6+
Nh1a3+
Nd7b8
Nh7xb8
Na2xh8+
Nb3a5+
Nxb8++
Nb4c6++
Nb1d2+
N8b6
N4xc3#
Nd2b3#
N8xg7++
Nh1xf8++
Nec4
Nab3#
Nb4c2++
Nb3xa5
Nab3+
Nd1xc3+
Nxe3#
Na5h3#
Nc8a7#
Na3h5#
Nexg6
N8f6
Naxh8++
Nexc6+
Nd2c4+
Nd8c6+
Nhxg7++
N5h6++
Nb5xd4+
Nf6h5#
Ne1f3+
Ne7+
Nxa5+
Ne4f2+
Na4xc3#
Nbd5++
N5e6+
Ne4c3#
Nb8d7++
Nb3xd4#
Ng1xf3++
Nd2xf1
Nd5f6+
Ncxe7++
Ngxe6#
Nga4+
Ng8xh6#
Ngh4+
Na1c2++
Nh6f7+
Ngxh5#
N4xe6#
N8xh7++
Nd2e8++
N1xh8++
Nf8xh1#
Ng5f7+
Nge3++
N8xa6
N3xh1++
Nxb7#
N3xe4
N6f7++
N7c8#
Ng1e2
N7xf1#
Nfh8#
Nd8f1++
N4d5
Nd7xb6++
Nfg6
N8a7#
Ne7c8#
N7xd6#
Nah2+
Na6c7++
Nb2xh1#
Nd2c8+
N3xb4+
Nh6xa4#
N3h4
Nd2b1#
N4d2+
Nh7xg1+
Nxa3+
Nhb1+
Nd1xf8++
N2xf4#
N7b1
Ndf7
Nbxd2
Nf6e4++
Nag8++
Nxb5++
N4c2#
Nxc2
Nexf3
Neg5#
N6e8+
Ndc3#
Nb8+
Ng2a1+
Nec5#
Nf1xh2++
Nf4xh3#
N2xh3+
N8d6
N2b3
Nfg5#
Naxg2+
Nb5xc3
Nh8xb7
Nf3xe1+
Nbxh7
Nexc3+
Nf4e2+
N4h6#
Nag2
Na1b7+
Ncb8
N7c8+
Ng3e4++
Nb5h4++
Nbxc4+
N2h3++
N5xg6
Ndxe1#
N5h3+
Nc1xe2
N3b4#
N6xb8++
Nc4d6
Nh8a2
Nb6a8+
N2xf3#
Nfd2
Nd5f6
Nc3b5
Ne6c5#
N6d4#
N1xh2++
N1e3++
Nb1h8#
Nab8
Nexg7+
Nd2xe4#
Ne7d1+
Nc3xb1+
Ne6c5++
Nah5+
Nfxe7#
Nb5xd6++
N5h7#
Ne7xd5
Ng2e3++
N6xf7++
Na7xc8#
Nah8#
Nxh4++
Nxh4+
Na8xb2#
N5b4#
Nd8c6#
Nh2xa4#
N4xh3#
Nexd3++
N7xd6
Ne5xf7++
Ng3xa4+
Nbxd4#
Nexg8
Nec3++
Ncb2#
Nd7e5++
Nhxa2+
Nb5c7
Ne3xd5
Ng3xa2
Nb5xc3++
Ng7h5+
Nc6xe5+
Ncb5++
N1c3#
N2xd4#
Nfxh4#
Nfd6#
Nd4xc6
Nc2a3+
Nhf4++
N8xd7#
Nxd5#
Ne7g6+
N4xg6
Nca5
Ncxd4++
Ne7f5++
Ng7f1
Nd3b4#
Nd2xb1#
N1xc3++
Ng5xf7+
Ng4xa5
Ne1xd7
Nf5h6
Nb2h1#
Nf2h3+
Ncxd2#
Nd7f6#
Nb5h6
Ne7g6++
Neg1++
N3f2
N3f5
N8g7#
Ne2xd4+
Na7++
Nce5
Nxe3+
N8xd2+
N4c3++
N5xg3
Ncxe4+
Nb1xa3++
N6xd7#
N8xb7#
Ng8e7
Nfxe7++
Nxc2++
Nf4d5++
Nc3b5+
Nd5b6+
N1c7+
Nh8xf7#
Nh6xg8++
Nb4xc2++
N5xd6
Nh5xg7+
Nfd7+
Nh1xf2#
Nce4+
N8xa2#
Na7g6#
Ngh7++
Ngh1++
Nbh6+
Nxd3#
N8xd7++
Nge6
N6d4
Nbxa3#
Nxg2
Nf3d2++
Ng6xh8++
Nha2++
Naxh2#
Nb8xa2++
Nd5e7+
Ne1xg2#
Ng6xh8
Ne6xc7++
N8xg1+
Nh2xf3++
Nbd5+
Ncxa3++
Na4g3++
Nf3d2#
Nd1e7+
Nbxh4
N3g2
Ne2g1#
Nac2++
Ne4xg3+
Naxc5#
Nde6+
N8a7++
Na4c3+
Ne4xd6+
Nfxh2+
Nxa7
Nf5xd6+
Nxf6+
Nbxh8#
Nd5f4++
Nc3xa2+
Nh5a3+
Na5xb3#
N6xg4+
Na7xb5#
Nf7d8++
Ng5xe4+
N6xd4+
N3e4#
Nca2+
Nxf5#
Nd5b6#
Nf1h2++
Ne2+
Nd5xf4#
Ng8xh6++
Na6h8+
N8xh6#
Nf3xd2+
Nc6#
Nd6f7#
N6xf7#
Ncxb2+
N2xd1++
Nf2xd3+
Nd7b6#
N3xc1++
N3xh5
Nfxe5
Nf8d7
Nge3
Nc4
Nf4d5
Nh4a2+
Ngxa8#
Nf4e6#
Naxc1+
N7a6+
Nh2a8
Nc7d1#
Na3c4++
Nh8b1#
Nd1xc7+
Ng7xf1+
Ne5xc4
N6xh7
Ne6xf8++
Ne3d1
Nc1a8
Nxg8
Nd6e4#
Ne5xd7++
Nbxa1+
Nc5e6+
N3g5++
Nfh6++
N2b1#
Ncd4+
N6xb5+
N4xb2#
Nb6#
Nc4a3++
N3a5#
Ng1a2#
Nha6#
N3c1
Ng6xe5++
Nfxe1++
Nc7e8
N3f4+
Ne7c8+
Nha7#
Nexf6
Na7h1#
Ng1xe2++
Nb3h4#
Ndxc7#
Nh6g8++
N4xg6#
Nxc6++
Nfe2+
N6g4#
Nb7c1+
Nde7
Nb2c4+
Ng7xf1
Nca3#
Nfxe2++
Ne7xg8
Nh7+
Nhxb8++
Nb3xh4#
Nf2xh1
Nf8h1++
Ncb6
N2f1++
Ncxa5+
Nh1g3#
N1xc8+
Nhxa7++
N4xd6++
Na8++
N7g6++
Ndb8++
Nh1xg3#
N3a1+
Nexc8+
N1h3+
Nb6xc4+
Ng7a8#
Nh1xa3#
Nd2f3
N2c1++
Nhxf8#
Nd3xf4+
N3h2#
Ngxa2
Nf3g1+
Nba5+
Nf2xe8+
Naxh4#
Nxf8
Ndxc2
Ne7xc8#
Nf1g3
N4xf3#
Nfe5#
Ng6xa7+
Nd2e4++
N2c8++
N4a5+
Nf8d1+
Ne1xf7
Naxh2
Neg7
Ng5xe4
N2xe3
Ncxe6#
N2xe8+
Nh6xf7#
N3h1#
N6xh7#
Nbd3+
Nf2g4++
Nexg8+
Ne7d5
Nb6++
Nd1
Nf2xe8#
Nh3a5++
Nf6xg4#
Nef3++
Nc7d1
Nf8e6#
Ndxe6
N7h8#
Nfxg7++
Nhxg7
Na3g4#
Ng2f8++
Na6xb4
Ne5xg4
N5f4++
Ncxd8+
N8xd6+
Nfh3
Ng2h4#
Nbh2+
Nf5xh4
Ng2e3+
Ng6xh8+
Nh8f7++
N1f8
Nbxd2++
Naxh2+
Na7xh5
Nd6b7
Na4++
N5b3++
Nd2
Nf2g4#
N7c8++
N5xc6#
Nb8++
Nb6c4#
Naxb7
Ne6d4
Nc5xb3++
Nd4b5#
Nca3++
N5xf6#
Nf8g2++
Na3xb5++
Ngxh7#
Nh3b4++
Nxg4#
Nb2c4#
Naxg7#
Nh2g8++
Nbc1
Na3#
N7xc6
Na5g6+
Nga8++
Nfxh4+
Nc3xd1#
Nc2xd8#
N6h4+
N2a1+
Nxc3+
Nbh4++
Nfe1+
Na3xh1
Ndf6#
N1b8
N2b3+
N1f8++
Nb5h6++
Nxa8+
Ng6xa7++
Nexg1+
Ndf3
Nga2++
Nfh4++
Na6xc7
Nf5d6++
Ne5xd3+
N2h1
Ne3xg4++
Na8xg7#
N1xh7++
Nb2xd1
Ne6f4+
Na1g2+
Nh5xa3++
N4b3++
Ngf4++
Na1xh7
N2f3++
N4xf2+
Nf6xd5
Ng5h3
N3xg5+
Nc2xa3++
Nc8xa1++
Nfd5+
Nf5xe7+
Nh1f8#
Nh2xb1#
N4c6
Ndxf6+
Nf1xg7
Ne1xd3
Nd3b2
N2b3++
N1xd8
Nc5e6++
Nc2e1#
N2d1++
N5e3+
Ndf2+
N6xa4+
Ng2xf4+
Ne8xf2
Nxh1
Ne4d6
Nf1
Nb2c4++
N4f3++
Nhxg1+
N2xg1
Nd2b3
N2f8#
Nf3xd4+
Ne1xg8#
Nf4+
Ncxd6
N5c3++
N1xh3#
Nh3b2#
Ng4f6+
Ng8++
Nb4c2+
Ne4xc5++
Nbc1#
N2xd3+
Ne3xc2#
Nc8d2
Ng1a2
Ng8f2
N3a1
Nde4++
N4f2#
Na3h5
Nxe1#
Ncxb5
Nh1xg7++
Nd8e6#
Nxe8
N8c6+
Na1h7#
Nc6e7#
N2b4+
Nba8++
Na5xg6++
Nb8h1#
Nb2d1
Nd3c5
Naxc8
Nb2xc4++
Ncd2++
Nd6xc8+
Nc2a1+
Ne3xf1
Ne5xg4+
Ng8xa7+
Ncd3++
Nb7h8++
N3xc1#
Nf8g6
Nf1xd8++
Na8c7+
Nc8e1+
Na8xh2#
Nh3f4
Nb4a6#
N1xb2++
Ne7g6
Nb1xc7++
N5xe7#
Ne3f5++
Ngxh8
N8f7#
Nxd8
N7e1#
Ng1xh3
N7xd1#
Nb3xc1+
Nf4xd3#
Nhxf5#
Nd2f3#
Ndxb2
Ng5xh7+
Nxf8+
Nbxd8
Ngxf4#
N8g6#
Nc7a8
N2d4++
Nc6b4++
Naxg3+
Naxc7
N4xf2#
Nbd7#
Ng3xa2++
Ne4c3+
Nc6d4
Ne1g2#
Na8xb2
Nca6+
N3c1#
N8e7
Nc1xd7
Nh6a4++
Ne4xc5
Ndf4+
N2d1#
Nfxg2+
Nga1++
Nbc2+
Nec2
Ng1f3++
Ncxb1#
Nhxa1#
Nxc5++
Ng8f6
N1b3#
Nhg1+
N5xa3#
Nd5c7
Nc7b1#
Nhf3
Ndxe3+
N1b8++
Naxg5++
Ne8xf2+
Nd6xf5#
Nf1xd2#
Ncb5#
Ndc5+
N2xe1
Nf7e5#
Nhf2++
N8d1++
Ng1f3
Ng7f5#
Nc5d3++
Nhxa6
Nbxa1#
Nfxd6
N4xc6++
Nef5++
Ng5xf7
Na2xh4#
Nb2a4
Ned4#
Nha5
Nb3d2#
Ncxa8+
Ned2#
Nxb1+
Nh4xf5#
Na8c1#
Nd8++
Ng6#
Nac3#
N2d8+
Nb4xa2+
N1e3
Neg5++
Nc3xb5#
Nga4#
N8d7
Nha1+
N5a4#
N4d5#
Nde8++
Nc2xb4++
Nh3xa5
N3h5+
Na5b7++
N4xe5
N5d7+
Nc8a7++
Nc5e6
Nhxa6+
Nag7
Nc7xd5#
Nhxg3#
Nexc4++
Nhxa5#
Nc6xd4
Ng2xa3
Nxg8+
Ng8e1#
Ng5xf7++
Nag3
Nf4e6++
N1xf8+
Nh1xg7+
Nd1e7#
Nge5+
Nh5g7+
Nb2xc4#
Ndc6+
Nf5g3
Nbc8#
Ne8xc1
Na2xb8+
Naxc2
N7a8++
N2g4
Na2+
Na6xc7+
Na8c1
Nb7xa1#
N1a8
Nb7a5#
Nfxd2+
Ne4++
Na2xg3#
Nbxa8#
Nxe7
Nge7+
Nce8#
Nxb5#
Ne7xf5++
N7xb1#
Ng1xh3++
N5xh4++
Nb7xa5++
Naxh1+
N6xh7++
Nf4h3
Nexd7#
N2f8
Nh4g6
Na5h7
Nd2e4+
Nexf3++
Nc5xa6++
N7xa6
Nd8xc2++
Nh5a3#
Nc3xe4++
Nc8a7
Ng5xh3#
N5xb6#
Na2xc3
N2e4#
Na7b5#
Nef6#
Nc4e5++
N2d3+
Nb6xc8++
Nh7xf6#
N2xe8++
Ng7xe6++
Nd4xb5
Nhf3+
Na7#
Nf5xd6++
N3xb5+
N2xd3++
N3xf1#
N2xd1
N6xa5+
Nbh3#
N1xb3#
Ne3xd5#
Nb6d5+
Nb3xh2+
N4xc5+
N2xg8+
Nb4d5++
Nh7f8+
N4h2
N7g6+
Nc3a4#
N5c4
Nc6a5
N6xd5#
Naxb2
Nb7a5
Nfxe6
N5g4
Ne4f6+
N6xf7
Ngh5
Nd5xf6++
Nh7xb6#
Nc4xb6#
Nc2
Ne5g6#
N4b3+
Naxg7+
Nfxe4++
Ng6xf4+
Nh7xf8++
Nge5++
N2f3#
Nef5
Nf1xg3++
Nd6xf5
Nf7+
Nxh3++
Ne2f8
Na3c4
N8a6+
Nc2xa1+
Na3b1+
Nf8d7#
Ne1xg8++
Ng5a6++
N8xb2+
N7xg5++
Nfh7
Nh2xa8++
Naxg4#
Ne3xg4+
N4b3
Ncd6#
Ng4xe3#
Ngxf2++
Nh3g1+
Ne3xc2+
Ng2a1++
Ndxc4#
N1d2#
Na7c8+
N1xe2+
N8b6+
N8xh6+
Nb5xa3#
N6xd4
N7g1++
Nb4h3#
Nh8g6
Nef3+
N7xe1++
N1xb2#
Nd6xc4
N4xe2
Nd6e8#
Ngxe4++
Na6xh8++
Nfd3#
Nha6
Nd1xb2
N8e2+
N2xg8++
N7e5
Nc3xb1++
Neg1
Na8xb6+
N1xg2#
Nf6d5#
Nc2xe3#
Ncxd1++
Ndxc8#
Nb3xh4+
Ng6xe5
Nbd3++
Nh6xf5
Nf7d8#
Nhxa2
Nh7a5#
N5d6++
Nb2d3++
Na1xb7++
Ng8xe7
Ne3g2+
Nxh3+
Ne4xd2
Nf5d4
Nb8xc2++
Nbxc1#
Nfxd4#
Nd3xf2++
Nd1f8#
Ng1xe8+
Nfxe6++
Nh7g5
N7xa8#
N8xb6++
Na8xc7#
Ng2a1
N1h8#
N2xh1
Nf2xh3
Ngf6
Nh4f5+
Nh8b7++
Nd7b8+
Ncxe5#
Nfxh1+
Nh4f5++
N7c1+
N4xh5#
Nh3b4#
Nbxh5
N2d4
Nhf1++
Ng8h6#
Ngxf7#
Na2b8+
Ndxb4++
Ne3f5
Ng4f6
Na2xb8++
Nfe7#
Na6g7
Na7g8+
N2g4#
Ngxf7++
Ngf1#
Ngxh7
Ndxf2#
N2xf1++
Na5xh7#
Nexg5#
N2xc4++
Nf8g2#
Na5xh3
Nd5xe3+
Nh2xf1#
Ne2xg1+
Ng2h8+
N4xd6#
Nb3
N1xc8++
Na7xb1
Nxb3
Nf6xh5
Nexf5
Nd7xe5
N8c1#
Nb3xc5#
Nef8+
Nfg5
Nc3e2
N3a5
Nd2b3+
Na2xc3#
Nh2xa4+
Ncxa8
Ne6xf4++
N6xh7+
N1xe7
Nhb4+
N1e7
Ndc7+
Ncd4#
Nbxa7+
N4d2#
Nh4xg6#
Ne4
Nb5xd6#
Ne5f7#
Nd4#
N5xf6++
N5c6++
Nb3++
Nba3+
Nhg7#
Ng4xf6+
Ndc6
Nb1d8
N3c5#
Nc3xb5
N5xf6
Nf6d7++
Na7h5+
Nf8xg2#
N6b8#
Ndxb1+
N5b7
N4g3#
Ndf5++
Nxd7#
N5xd7#
Ncxb5++
N1g8+
N8a2++
Ng8f6#
N6d8
N5a7++
N4xe6+
Ne3xd5+
Nhb8+
Nfxg4+
N2h3+
Nexc6#
Nfd7
Ne1c8++
Nab7
Nb7a5+
N4xf6#
Ndc1#
N5e3
N4e3+
Nf3e5#
Nd1xb2++
Nd6xe8+
Ngf8
Nfxg6#
Ndxc6+
Neg7#
Nde3#
N2xa1++
Ne3d5#
Nc8d2#
N1h2
Naxb5#
N2b4++
Nc7xb1
Ncxd1+
Ndb3#
Nce7#
Nh8f1++
Nb5xh6#
N1xe8++
Nexg3
Nfxh2++
Nfxg6++
Nb3xa5++
N8xb7
Ng5h7
N2d8#
Nh2xa8#
Nf2xe4+
Nc3a2+
Nf7d6+
Ng6xe7+
Ng2h8
Nag7+
N1xe3++
Naxb8++
N2xh8#
Na7b1++
Nde5
N4g5#
N3xd5+
Nc6b8++
Ne2xd8
Ne6#
Nd2e8#
Nba5++
Na1g8+
Nd8xb1#
Nh3a1++
N6xd5++
Nc3e2++
Nb3xc1#
Ne1xg2+
N4xf2
Ng7h1+
Nfd5++
Nxe2
Nde8#
Nbc3
N1h3#
Ngh3
Nc7xb1#
Ne4d2#
N1h3++
Nh7b6#
Na8xc1
N6d4+
Ndf2#
Ngxe5#
Nh4f5#
Nh5f4#
Nde1#
N4xd5+
Na1h3
Nfxh7+
N6c8++
N4c5++
Na5xb7+
Nab6
Nge2
Nxf5
Nh2+
Nh1f2
Ne6d8+
N1d7#
Ne4xf2+
Nf6xh7++
Nd7xf6#
N2xh1++
Nh8a6
Na7xc6++
Ng5xf3+
Nh7b6+
N3xf4++
Nf8xh1+
Nexg2+
Naxc2++
Nexd6
Neg6#
Nh4b5
N1a8#
Ne3xc2++
Nd6c8#
Nexf6#
N8g1+
Nxe5
Na2xh8++
Nh8xg2#
N6h4++
Nd5xe7++
Ncxe6
Nec8+
Nf6xd7#
Ne4xd2+
Ncxa7#
N8e2#
Nb6d5++
Ndf8++
Nh6f5#
Na6xg7#
Ngxa7
Nbxh7++
Nxa6
Nc3e2+
Nc8e1
Ne7xg8+
Nfd4
N1xe2#
Ng8a7+
Ne2xd8#
N7xf6
Naxb6++
Nexc4#
N5c4+
N4h5+
Ncxa4+
Nd2++
Nf3xh2+
N2xf1
Nc7e6#
Nxg3+
Nfxd5+
N1d3#
Nf4xd5++
Nce6#
Na7b5
Na6c7
Nb2xd1++
N4g2++
N2a1++
Nh3a1+
N4f5+
Nb3c5
Ncxe2++
Nga7+
Nh5xb4#
N5g6++
Nexc8++
Nxb7
Nbxh4+
Nd3+
N6xb7+
Nfxd3
Nc1xa2#
Nh5xf4++
Nhf4#
Ndb2++
N4xc5#
Naxg8
Ng3xe2++
Nc2e1
Ne1xd3+
N2h8
Nde8
Nhxf3++
Nhg2++
Ng6
N3d4
Nf4g6++
N1xg8#
Ne5xc6#
Na1xh3
Nh2f3#
Nf3g1#
Nxf6#
Nh7xa5
N4c6+
Nxd4#
Ne3xc4+
Ng3xa4#
Nh7g1++
N4b6
Nf3#
Ne7g8++
Na4h6#
Nb2xc8++
Nf4xh5#
Nce7+
Nh7xa5++
Nb1#
N6xe5+
N6xb4#
Nc5b7#
Nh1g7
Ned5++
Nd6f5++
Ndxe7++
Ngf5++
Nfd1
Nga2
Ne7xc6
Na5g6
Nbh1#
Nd1xe3
N7e1
N6c4++
N6xg8+
Ne4c3++
Ngf6#
Nfxe4
Nhxa3++
Nc5+
N6f7+
N3h5++
N6xc8
N1xe8#
Nde3+
Nd2xc4#
Nhxb2++
Ned8++
Nb1h8
Nd2xe4++
Ng6xa7#
Nd2xc8
N2c4++
Nd5#
Nxh5
Nbh1
N4h3+
N3a2#
Nb7++
Nb2a4+
Ne4xd6++
Ncd7+
Nd6xe4+
N2xb1
Nd4xb3++
Nf4xe6++
Nh6xb7#
Na5xc4++
Nfd8#
Nd1xc7#
Ne7xf1+
Nf2e8
Nab4#
Nfxg8+
Ng7xe6
Nf8xh7++
Ndxc6
Ng1
N7b8#
Nc4e3#
Nbxd8+
Nf1xg7#
Ndxf1++
Ndxc1
N5e7#
N2xb8#
Nd3f4
Nb4xh5#
Ndf8#
Ng5e6++
N2xa8#
Nxf8#
Neg2+
Nb7d8
Nef4#
Nb5xa7++
Na3xg4#
N6f4+
Nxg1#
Nf8xg6+
Nd6xb5+
Nd6xb5#
Nb3xh2
Nf4xh3
Nb5xc3+
N3xc4
Nfe8
Nxa4++
Nb5xd4++
N8f2
Nf1g7++
N7d1#
N6f8#
Nf3e1+
N8xa6#
N5xe3#
Nab8++
Nb7xd8
Nh4xg6++
N4xa3++
Nf3xe5
N6b8
Ne5g4#
Na2xb8
Ne7d1
Nf2g8
Ngxf1
Nd5f4#
Nb1++
Nah1++
Ng8#
Ne4f2
Nb8xc6
Ng4xe3++
Nf4xd3
Ng5xf3#
Nb4#
Nf6xg4
N4xg5
Na8h2#
Nb6a4
N5e7
Nb7xc5#
N1c3++
Ne4c3
N4c6++
Nc1e2
Ne1xf7+
Nf7h8++
N5xc3
N8d2
Nf5d4++
Ng4xf2
Nce4#
Ndc3
N5xb4
Nbxd6++
Nb5xh6+
Ndb6#
N5xf4+
N2c4
Ne2++
N7xe6
Nd4e2++
Ng6xf8+
N2c4#
Na6xh8+
Ng1h7++
Nh2xg4++
Nb2d1++
Nfxe7
N7xc5+
Ne3g4#
Nb1xd2#
Nhxb3#
Na2c1#
Na6h4
Ngxe4+
Ng3xe4++
Ngxf5++
Ne1xd7+
Nd7e5+
Nc5++
Ng6xe7#
Nc6xa5++
N6xh5++
Na6xc7++
Nh7a5+
Nc7d1++
Nxd3+
Nc5xd7+
Nh5xf6
Nb6xa8#
N6b5
Na7xc8++
N3xb4#
N4xa2+
Nd8xe2+
Nh5g3++
N5xh3
Nf6xe4+
Nc7xa8#
Nh4a6+
Ne2g1+
Nf5xh6#
Nh4xb5
Nd2e8+
Nf8d1++
Nb5d6+
N3xa5#
Nbxa4+
Nb1+
Nah4
N7a1++
N8xa2+
Nh5xg7++
Nf5xe3#
N4d6#
Nb1xh2+
Ngxf4
Nb4xd5++
N4h6+
N8a1
N6a7+
Nc7d5+
Nf6h7
Nb2xc4
Nba4+
Nga6
Ng1xe2+
Nd5xe3#
N7h5#
Nhf6++
N4xg2+
Ng7xh1++
Nb1c3+
N4xc6#
Nd5c7++
Ne6xg7++
N6d7#
Ng6f8++
Ne3xf1+
Na7xg6
N5xh4#
N2xc3+
N1xh2#
Nf4xd5
Naxb2+
Na3xg2++
Nb4h3+
N4xa2++
Nb6xc8#
Naxb3+
Nc1a8#
Nbc6
N1d8#
Ne6c7
Nhxf7
Nf7xg1+
Nxd6+
Nc6xe5
Na2#
Nb6xd5
Na3xh5#
Na8g7#
N6xa8#
Nfe5++
Nah2#
N8xd6
Nf6xg8+
Ne1d7#
Nde3++
Nh1b8#
Ne8g1++
Ne6c5
N1xb8++
N8g1++
Nf5h4#
Nb1xc3++
Nf8xd1#
Nc1a2
Nb4xa6
Ng3xe4#
Nd5f4
Ndxb3
N4b6++
Nb1a7+
Nbc6#
Nb6d7#
Nha3++
N3xf4
Nah4++
Ng4a3+
Nc8d2+
Ng7h5
N3xa4+
Nf1xd8#
Ncxe3
Nh5xg3+
Nc8xb2
N5c3#
N2g1
Nb3d2
Nf7g5++
Na7xh5+
Nd4e6+
N2xa1#
Nd4e6
Naxg7++
Nfxd2++
Nce5+
Nb3xd2#
Na3h1++
Nexc1++
N4xc5++
N6f7#
N5xe3+
N1xc2+
N5g7+
Nfd6++
Nd7f8#
Nxh4#
Na3xc4++
N1xh2
N4xa2#
N5d4++
Ne4g3++
Nca8+
Ned1+
Nf4#
N2g4++
N5b6
N1f3#
N2xe3+
Nf4xg6#
Nd8b1+
Nd1e7++
Nb2h1+
N8c6#
Ne5f3++
Ne8g1
N8f1#
Nh5b6+
Nb5xh4#
Ndc3++
Ncd6+
Na4xh2+
Nfxh4
Nc6e5++
N2xe8#
Ne5f7+
Naxc3
N1xf8++
N1xf2+
Ng1f3#
Na1c2+
Na2b4+
Nb8c6#
Nh8xf7++
N3d4++
Na5b3
Nh7a1#
Na7g6
Nb1c7+
N4e6++
Ng7xh1+
Ng2h8++
Nf1xh8#
Nd5xe7
N5a4++
Nd7xb6+
Naxb7++
Nh5++
N7xd8#
Nf8g2+
Nh6b5
Nf6xd7
N1a3+
Nfxd8
Ne6xd8#
Ng3xf1#
Nc8xe7++
Nh3xg5#
N3g2#
N1xa7
Ng4#
Nc2xa3#
N5b4
N3xg4++
Nc8
N7xb1++
Nd2xf1+
Nb7xh8++
Nhxg3+
Nxh8++
Ndxc8+
Ndf5+
Ne8xf6#
N5xg6++
Nexd3
Nb2xh3#
Nba4
Nf5
N6a8++
Nbxh8+
N6g5
Ncxa3#
Nha8++
Nf4g6+
N8xb7++
N6b8++
N4xb5
N8xc1+
Nfh6+
Ne6f8#
Nd2+
N1c3
Nhg6
N6a8+
Na5c4#
Na6b8++
N8d6++
Ndxb8++
Nhg3++
Nxf4+
Nag8+
Na2xh4
Nf4e6+
N8xb1+
Ne6xf4+
Nh8xb1#
Nf3e1
Nh3xb2+
Na4xc3++
N8xh1#
Nga8+
Nba2++
Nxa4#
N7f8+
Ncb2
Nh1xg3
Ned8#
Ne8f2
Ng2#
Nh7xa1+
Nb4h5
Ned1
Nh1++
N4h6
Nc6xa5
N6xe8++
Nh2xf3#
N8xe1
Nxc3++
Nd3xc5
Nb8c6+
N2e4++
Nxb4+
N7xg8+
Nc6a7
Nf5xe7++
Nb5xc7
Na1++
Nb4xd5
N2xf3
Nf2d3#
N5c6+
Nac8#
Ngxe1
N5xc3+
N2xb8
N5xa3++
Na7xb1#
Nb2h1++
Nh2xg4+
Nxf1++
Nf2xg8++
Nf4xh5+
N5xa7+
Nf1xg3+
Nhxg1
Nga7
Ne3xd1+
Ng4a5++
Nh1a7++
Nc3a2
Ne8xd2++
Nb3xa1#
Nh6xg8
Nbc7++
Ng6f4+
Ne4d2+
Nc2e1+
Ng3f5#
N6xb4+
Nb8h1+
N5xb3
Na1xc8#
Nh3f2#
N6xf5#
N4xc3++
Ne2xd4++
Nca6++
N8xd1++
Ng8f2#
Na1xb7+
Neg1#
Ned3+
Ne8c7#
Nxb1
Ndc2++
Na8c7#
Na7g8
N8b1#
Na4c5+
Nb8c6++
Ng5e4+
Ng1xe8++
N8xd7
Ng7xh5#
N3h1
N5xd4
Nf2xe8
N3c4#
N2d8
Ndb6
Nhxf2
N6xf4#
Ndxc4
N6xb7#
Ndxe5++
N5a6#
Nf4xg6
Nc8+
Ne4+
Ng1e2++
Nxf2++
Ned8+
Nd8f7++
Nd4xe2#
N5xe3
Nxh4
N1xa3+
Nbxc2
Nd3f2+
Ng3e2++
Nbxc7#
Naxb1
Ng7xf5+
Naxc6++
N4xd6
Nge7++
N5d4+
Na6b8#
N4xd5
N8xb1
Ng6+
Nc3xd1++
N1xh7
Nd7xf8+
Nexf2++
Nhf4
Nexg3+
Nec1
Ng1e8++
Nc8xd2
N2c8
Na1xc2#
Nhf3++
Ndf7#
N5xg6+
Nh2xg8++
Ne3c4++
N1b2
Ndxe4
Nh7xa1++
Ne3f1
Nba2+
Na1xh7+
Nhxg2++
N5a6++
Nh2xa4++
Nd6e8
Ng2h8#
Nf4xe6#
Nh6xg4
Na3c2#
Nxe8+
Nh3xf2+
Nh3f2++
Nxg5#
N4b2
Nh6xg8+
Nexf8+
Na7xb5++
Ng8
Nf3xg5#
Nfxe8#
Nag4++
Nb5c3++
Na8h6#
Nh4xa6#
Nd4b3+
Ng7xe8
Nfxh3+
Nc3d1
Nf1xh8+
N1xb2
Nb3xc1++
Nag1+
Na8h6+
N2xa1
Nb8xa6
Nga1
N8c2#
Nb8d1#
N7xg1#
Nf1xd8
Nf8g6+
N1xa8++
Nb1xa7+
Nf4g6
N3xe5++
N3xd4+
Ng4xh6
Nf4xh5
Nf8h1+
Nd4xc2++
Ne6d8
Nag1#
Nde3
Ne8xg7+
N6c8+
N7xe5
N2xc8
Na7g8++
Nh1
Ng6xa5++
Nh5b4
N5xb7
Ne3xf1#
Na4xb2++
Nhxg8
Nb7xc1++
N7xc5
Nb6d7
Nc7xe6#
Ne1xd7++
N8xa1
Nc1a8++
Nf1d8+
Ne5d7+
Ne2d4
Nf5h6++
Ng2a3#
Nc2xd4
N6xe4#
Nd3xf2+
Nc3d1++
N5e7+
Nc6d4+
Nf4xd5#
N1b7++
Ne6c7+
Na6b4++
N5h4#
Nd8xb1+
N2xh4+
N6xf8+
Nfh1
Ngxa2+
N6f4
N7xf6++
N2xd3
Nfxd3+
Nb5d4#
Ne7f1++
Nb6xa4+
Nxa6#
Na6h4+
Ng3xa2#
Nf7e1#
Nh5xf4
Ng7h1++
Nac7#
Na5xc4
Nd6xe4
Nc5xa6
Ne2d4#
Nca1++
Nd1xc3
Ng7+
Nb7#
N6xd8++
Na4c5#
Nfxg7+
Nf1+
Nhg4++
Nh8++
Ndb4
N4b5#
Nc2b8++
Nac5
N1xf3+
N2f8+
Ng2f8+
Na5b3+
Na1b7++
N7xe1#
Nxh1#
Nxe6+
Ncd5+
N2xa8+
Nb6xh5+
N5d3#
Nd7xf6
N4xc6
N7e5#
Nd1xe3#
Ng2xh4+
Nf4xe6+
Nf7xg1#
Nbh1++
Nf3+
Nc7xe8+
Nxb1++
Ng8xf6
Ne8xc7++
Nca2++
Nba7++
Ng8f2++
Nhg7+
Nd4b5+
Ng1xa8
N3h2+
Nf6xh7#
Nd1xf2+
Nhg6#
Ncxd6+
Nc6xb4#
N6xf7+
Nd8xf1++
Nexc3#
Ndb6++
Ne1c2
Nf2e4++
N6xa7
Nbxc3+
Nfh5+
Nd6xc8++
N6g7#
N5xh6+
N7e1++
Nh2a4#
Nde5+
Na7xg8++
Nf6xg4+
Nah5#
N2xe4#
Na4g5++
N1h8
Na5xg4#
Nc4a5
Nh4b3#
Nh6g8#
N1xf8
N4xe3
Nbh6#
N5b7++
Nd3c5+
Na1c8#
N6d5++
N4xf6+
N4xd2#
Ndb7
N3xa4
N2xg8
Nah4+
Nf8xd1++
N6xc4+
Nf1d2++
Nexc1#
N7xb5
N5xd4#
Ne7d5+
Nb1a3
Ng4++
Nb7a1
Nh2f3
N5h6#
Ncb3
N8xa6++
N1e8++
Nd2xe4
N6g8
Nxc8
N2f8++
N7xf5+
Nxg4
N5h6
Neg2++
N5d4
Nh3g1
Na1b3
Nbxa2++
Naxg5
Nd7c5++
Nf8e2#
Nd6xf7#
Nbd7
N1xh8
N4xd6+
Ng3f1+
N5b7+
N4xf5
Nxe2+
N6xg8++
Ne6g5+
N5xb7#
Nd7
Nc1xd3++
Nh7xg5#
Ne1c8
Nce2++
Ng6xe5#
Nhb4#
Nbxd1++
Nf3d4++
Nh3b4
Ng1xf3+
Ne6xf8
N7xh5#
Ngxa6+
Ng4h6++
Naxb6
Nxc7#
Nxh3
Nd4xc2+
Nha2
Nh7g5#
Neg7++
Nce1
Nf4e2
N7g5
N5c7
Na3xc2+
Nh1xg3+
N6xg8
Ng3xa2+
Ne7d5#
Nbxh7#
Nd5b4++
N3a4++
Ned5
Ne8f6
Ngxf6
Nf4e2#
Nh7xb8+
Ncb4++
Ne3c2++
Ng1xf7
Nfxg1++
Nb7xa5#
N3b5
N5xf6+
Nd7f8+
N6e7+
N1h2#
Nec3#
Ne7f5+
Nbxd5#
N3xa4#
Nbxa7#
Na5xc6++
Ng1h3
Nhf5+
N7xg1++
N7xf1++
N1xf7++
N1xf2++
Nh4b3+
Nfd5
N7a6
Na3xh5
Ng7xf1++
Nxc3
Nfxd2
Nc4xd6#
Na7xg6+
Nh6xb7+
N7xh6#
Nhg5#
Ncxa1++
Ng6e7#
Nf1h8#
Nh7xb6+
Ngh5#
Naxh5+
Nd6b5#
Ne5c4++
Na3xh1#
N2g8
Nxe3++
Ne5c6+
Nah3
Nxe4
N3xc2#
Ne8g7#
N6xc5+
N1b7
Na4h6++
N2a4#
Ng4f2#
Nhxf8+
Nh4g6#
Na2xh8
Ncxd2+
Ng1xe2
Nc3xa2++
Nb5xd4#
Nd8xe6+
Na1c8+
Ngxf1+
N4xg6++
Naxh1#
Nbxa8
Nb6xd7+
Nb5d4+
Nc2d8++
Nc6xd8++
N1b7+
Nh8f7+
Na2xc1
Nd3c5++
Nh8xa6#
Nfxd4++
Nd3xb2#
N5b6+
N5d6+
Ne6++
Nb1d8++
Nhxb3++
Ng2h4++
N4xd5#
N4xh6#
Ne6f8
Ndb8
N5e7++
Ne6xf4
N5xg4++
Nh1g3+
Ndb1
Ncd4
Ngxh3+
Ne3d5++
Nce8++
Ngf7#
Ne3xf1++
N8b1+
N6b4++
N5b6++
Nh5b6
N8xg6#
N1a7++
Nc6xa7++
Nc6xe7#
Ne1d3++
Nhxb4#
Ng4xe5
Nh1xa3
N7a1
Nb2++
N7xg8
Nag8#
Nh2a4+
Nha5++
Nf2xg4+
Nc1xe8#
Nhg8
Nf5xd6#
Nd7b6++
Nd3c1#
Nec4+
Na5b7
N3xf4+
Ngxf2
Na5xc6
Nf6g8#
N4g5+
Ngxf3#
Nexf4++
Ne2f8++
N2a4++
Ngxf3
N3xc1
Nc4b2++
Nh5
Nbc8++
Ne1xf7#
Nab3
Ncxa5++
Nf6xg8++
Nc6xb8++
N2xg3#
Ngxa6
Nb6c4++
N1d8+
N5a6
Ndxf7
Na1xg8
N5xb7+
N6xd8
Nd6xf5+
N5xa7
Nd2xf3++
Nh8xg6+
Nh3xb2#
N6c5#
Nd7xe1#
Ng2
Nc4xb2
Ncxd7+
Ne6g7#
Nb7xc1
N6d8++
Nc5xe6++
Na5xb3
Ncb7#
N3g4#
N5e4++
Nf5g3++
Nh6a4#
N3c5++
Na4g3#
N7xa5#
Nh4g2+
Ng5xa6#
Nfxd7++
Nb7d6#
Ne4xc5#
Nbd2++
Nbxc5++
Nd3e1+
Nb7c1++
N1xc3
Ne1f3#
Ng2f4++
N3e1+
Nf5g7#
Ne5xg6+
N5a3#
Nh8g2+
N8d1
N7d1
Nb4xh3#
Ndb5
Ngxh1+
Nb1d2
Nc4xa5#
Na1xh7++
N6g8++
N1c2++
Na8xg1#
Ngxh3++
Nxg6++
Nbh2#
N6xb8+
N8c6
Neg4
N3e2
Nb8#
N8xh2#
Ne4g3#
Ng4f6++
Nd1c3#
Nb8xa2+
Ndxc7++
N4e5#
Nd5e7#
N5xd3#
Ndxf3++
Nc1xa8++
Nb3a5#
N6xg5+
Nf8xh7#
Nga5#
Nd5e7++
Nxe8#
Nc4b2#
N3f4#
Nc4xa5+
Nbxh6+
Na1g2#
Nbxh2+
Ne1xd3#
Nf2e8++
Nc3xe2
Nd6f5
N5xf4#
N4xe2+
Nf4xe6
Ng8h2++
Nb6xc8+
N8xg2+
Nxc1#
N7c5+
Nf8+
Nbxa1
N1xh3++
Ndf7+
Nd6e4++
Nc5b3+
Nc2e3+
N5a3++
Nf7e1
Na1b3#
Nge5
N5g7++
Na3xc4
N1e7#
Ned3++
Na2xg1
Nd7xc1++
Nhb2++
N2a3#
Ngxa8++
N2xd8#
Nf5g7+
Na7b5+
N8h6++
Ne5g4
Nh3xf2#
N5xc7
Ng3a2
N1g3++
Nc4xe5+
Nc5xd7++
Nba1++
Ng5h3+
Nh3xb4+
Nf7g5#
Nbd8+
Nc7++
N3xf5#
N3g2+
N8xa1+
Na2xb4#
Nxd3
Nxh3#
Nhf2+
Nb6xa4++
N3b4++
N2d1
Nc8b6+
N6xh5+
N7xe1+
Na8xc7++
Nf8d1#
N6xb8
N6d5+
Nc4xe5++
Ng6e7+
Nah3+
Ng1e2#
Nh1xf2++
Ngh4#
Nb8xh1#
N8b6++
Nh4b3
Ndxf4++
Nh3xa1
Nb2xa4++
Ndxf3+
Nd4xc6++
Nd3f4++
Ne2xf4+
N4xe3++
Nd1+
Ndxc5#
Nh7a1+
Nd5xf4++
Nf6e8++
N7f1+
N5xa4#
Nbxc7+
N3xc5+
N6f4++
Nh8xb7+
N6xh5
Ngxe3++
Na3xc4#
N2xg4+
Nb6+
Na8xc7+
Nb1xd2
Nbh8#
Nhxa7
Nf2xh3+
Nb4h5#
Ng7#
N1xf3#
Nfxh5++
Ng8a1
Na2g3+
Naxh8+
N7xa6+
Nfxg7
Na3xh5++
Nfxe8+
Ndf4
N5xb3#
Nb3h2
Nb3xa1
N8xg1#
Nh5xg7
Nexc2++
Ne7xc6+
N4h3#
Nhxb3
Nc2b4++
Ndb7+
N1f2++
Nb5c7++
N8xg2#
N8xh2+
N8f2+
Ne5g6+
Ng6a5+
Ng8h6
N4d6
Naxh2++
N7f6+
Nbc4
N8b2#
N2xd8
Nhxg2+
Na3xg4++
Nc2a1#
Ndb3
Ndxe2#
Nbd1+
Nb8
Nf5g7++
Ng7
Ncxb8
Nb3c5++
Ng7xa8+
Nh6xb5++
N8f2++
Nf3xg1
Nxf2#
N1e2+
N3c2#
Nf1xd2+
Nb5c3
Nbxh8++
Na6xg5++
Nc3#
Nbxh1++
Nbd3
Ng5xe6
Nhxf2#
N2h4+
Nbxh3+
Nh6xg4++
Ng5#
N5xh3++
Nf1xd8+
Nf4h5
Nfxg6+
Naxc6#
Nxf5+
N3e1#
Nfe4++
Nf2xg4#
Nfd2#
N2f1+
N2h8+
Nd7f8
Nh7xf8#
Nxc4
N6xc7++
Nc4d2#
Ned1#
Nbd2+
Nd6f5+
Na7xc6+
N5xf7+
Nexf3+
N6e7#
N2xc4#
Ngh4
N7g8#
N7a5#
Nfxd3++
N5xc3#
Nfh4#
Ng5+
N2xa4++
Ndxe6++
Na1
Nf1xd2++
Nb5d6
N3g5#
N5g3+
Nfg8#
Nc6xa5+
Nh4b3++
N5d6
Na1xh3#
N6g7+
N2xd1+
Nc3a2#
Ngxf1++
Ndxc4+
Nh3g1++
Nhg5
Nc3b1
Nh4xb3#
N3g4
Nbh8+
Nba7
N4xb6
Nc7b5++
Nh8xg2
Nd8xe2++
Nxa8
Ng1++
Ne3g4
Nhxg4+
Nd4xb3+
Ncxb7
Nxe7+
Nhxg3++
Nexd2+
Ncxa7++
Ndb2#
Nd5b6++
Nac2
Nge8+
Ngh7
Ng3h5+
Nbd6
N2xg1#
N1f7
Naxh4++
Nd5xc3
Nhb6#
Nd7xb8++
Ng7e8++
Ne2xf4++
Nd7e1#
Ng8xh6+
N3xf5
N6xb5++
Ng6f4++
Nd8#
Nc7xd1++
N1xa2
Na8xc1#
Nha8#
Na4+
Ne3d1#
Ng1xe8#
Nc1xe2#
Nc2xb8
Nb1xc3+
N8d2++
Nd7b8++
N1d7++
Ndxf1
Ng4e3+
Nxf7#
Naxg3
N4xh2++
Nfg4#
Na7c6
Na7xg6#
Nb2xd3++
N6xd7
Nd1b2+
Nd2c8++
Ne5xf7#
Nd4e6#
N7xb8++
N3g5+
Ncb2++
N6a5#
Ne5xc6+
Nh2b1
Nh1xf8+
Nb4xh3++
Nf3xg1#
N8a7+
N1b3++
N4g6+
Nec7++
Nhxg6#
Ne3c4#
Nh1xa3++
Ncxb4+
N2xe4
Nbxc4
Nbh7+
Nf8e2
Nh4xf5++
Nf6e8#
N5xa6++
Nhf7++
Na2xg3+
Nd8b1#
Nb7xd6
Na2c3+
Nhxa4+
N5xe4+
N6xg7
Nfxg5#
N7xh1++
N7e6+
Nf7xh8
Nh6a8#
Ng6f8+
Nd5e3++
Na5g4++
N6xa5
Nc8b2#
N8a2+
Nb8xd7#
Nexf4+
N1b2++
Ncb6#
Ngxa7#
Nxf4++
Nh4++
Nd8xe6#
N4g2+
N7xd8++
Ngxh3
Nd2xf3
Ne5c4
Ng3a4
Ndc5#
Nf1xh8
Nf5xh4#
Nd4xf3+
Ng3#
Na5h7+
Nd6e8+
Nf8xh7
Nb4xd3+
Nexg2#
N3xe5#
N7g1#
Ne8xd6+
Nb1xa3+
N1xa7++
N2xh3#
Nh7g5++
Nge1++
Nb2d3
Ned7+
N8a1+
N2c3
Nh6g8+
N2a3
Nh4xg2++
Ndxf2+
N1f2
N1d7+
Nc3a2++
Nf5#
N4xh6
Ng1xf7+
Nc2xd4+
Naxb4
Nc1++
Ngf6+
Nxb8#
Ne1xf3++
N1xg2
Neg7+
Nha1++
Ned4+
Nxa2++
N7e5+
Ndxe7+
Nh1f8
Nbh2
N4xf2++
N7h5+
N5d6#
Nef8
N1xb3++
N4xd3
Ng3a4++
N7xc1+
Nd3e1
Nc1e8
Ng7e6++
N7xb6+
Nxd4+
Na4xg5+
Nf6h7#
Nb8xd1
Ng2e1++
N1d8++
Nd8e2#
Nbxd4
Nb2+
Nf5g3#
Ngxa4+
Nh1xb2#
N2xf8++
Nf3xh4++
Nd1f2++
Nh7xb8++
Nd5c7+
N8xa2
Nbxc5
Ne5d3
N1a3#
Ncd8#
Nh1b2+
Nb2xc8+
Nf2e8+
Nf2xh1+
Ng8a1#
N3a4+
N8xd2
Nxa1#
N7b5
Nb8h1++
Nha2+
Nb6xd7++
Nbh5+
Ng8xa1
Nce6
Ng4xa5+
Ne8
Ng7a6+
Nce2+
Ng2++
Nd3e5
N5e4#
Nfxg2
N8xc7#
Nb3c1#
Nd5xc7+
N3xd5
Nb3xd4
Nxg2#
N7f5#
Nhf8++
Nac5#
Nf8e6
Nba7+
Nf1xe3
Nf5d6#
Nf7xg1++
Nce7
N4g2
Na6xb8+
Nec7+
Nef1
Na7h1+
N3xb1
Nb6xd7#
Nab4++
Nb1a7
Nd7#
N7f1++
Ne3g4+
Nc4d2
Nag6+
Nfxd8#
Nd3b4++
N5xf7
N7xh6
Nd4++
Nab7#
Nd7e1
Nd1xb8#
Nec1++
N8e1+
N7xg6+
Ndf1++
Nxh8#
Nd3xc1
Ndc5
Nd8f1#
Nf8xg6#
Naxb1++
Nb6a8++
Nc6e5+
Nc3xb1
N6xh4#
N7xg5#
Nf8xe6#
Nf7d8+
Ngxh5+
Ne8f2#
Nh6f5+
Nf3h2#
Na8g1#
Na6xh4+
Nfg6+
Na6g5++
Naxg1#
N7g5#
Nh1f2#
Nf2xg8+
Nf3xe1++
Nf6g4#
Nc5b3#
Ng3xe2+
N8b2+
N1xg3
Nhxg7+
Ng4xa3+
Nb5c3#
N4xc2++
Ne8f6+
Nc8xb2+
Ncxd8
Nc3xe4
Nxc8#
Ne3xg2
Nb4a6++
N4xa6#
Nd4c2
Nbh6++
Nf7xh8#
Nd7xe1+
Nd1xe7#
Nxf6
Nd6c8++
Ng5xa4++
Ngf7++
Ng7h5++
Nc1d7
Na1g8
Nd1xc3#
Nh8f7#
Nxf8++
Nhb2
N8xg6
N1xa8
Nd3xf4#
Nh6xf7
Nexd3+
N8xh6
Nb7c5+
Na6xg7
Nc7xb1+
Nd1e3+
N8c7#
N5b7#
Nh5b4++
Nf7g5
Ndb2
Ne1xc2
N8b7++
Nb6xd7
Nc7xb5+
Ne2c3++
N2h3#
Nf3xe5+
Ndf5
N1h3
Ng2a1#
Nd7xb8+
Ndb4++
Ne3xc2
Nh7f8#
Nc4xe5
Nd5e3
Nhf1+
Nhxg8#
N6h5++
Na5c4
Nb2d3#
N3g5
Na6xh8#
Na2xc3++
Ndf1#
N4xf5++
Nbxc2++
Nd7f8++
Ng3h5
Ne3
Nd2f1
Na4xc5++
Nbc5+
Nd3xc1+
Nc6a7#
Nhb1++
Nc7xa8
Nbxd1+
Na1xb3#
Nh2xf3+
N8a6#
N1g7++
Nc8d6
Nd6f7+
Na1xh3+
Nbh4
Nb2c8#
N7b8+
Nec6+
N2e1
Na4xh6++
Nd1xf2
N2g3
Nexd2
Nfe6++
Nhf6#
Nb6xc4
N4g3++
Ned8
Nc2xe3+
N3g2++
Nh6xa8++
N7xa8+
Ne1xc2++
Nbh7
Nf2h3
Nbc7+
Nh5xf6+
Nf5xh4++
N8xh7+
Nf6xg8#
Ncxa2++
Nf7xe5
Nh8g6+
Nd8b7+
N6c4+
N4xe2#
Na2b8++
Nec3+
Ne1d7+
Nef3#
N6xa7+
Nah1
Na8
Nc8d6#
Nh1xa7+
Nd1xf2#
Nxb6+
N6xc8+
Nexd8
Nd8f1+
N5c4++
Ne7d5++
Ndc7++
Nfxd4
N4xa2
Na6xg5#
Nd1b2
Ncxd4+
Nh3xa5++
Nd1xf8+
N8b1++
N8xc7+
Na3h5+
Ng5xa4#
Na2b8#
Nf7xh6#
N5c4#
Nexg6#
Nf6xe4#
Nca8++
Nab1++
Nb6xa8
Nc3b5#
Nd4xf5++
Na4xg5++
Nc1e2++
Na6xh8
Nc4xe3
N6xf5+
N4xb5#
N1c3+
Nxb2++
Nc8e7#
Ncxb1
Nd4b5++
Ng7a6
Nge4+
Nh8xf1++
Ncb8#
Nfe2#
Nb8xa2#
Nh4xb3++
Neg3++
Ng1xh7+
Ned7#
N3xb5++
Nhxf4
N5xb4#
Ngxf5+
Nexc1
Ng1f7#
Nb1xd8+
Ncxd2
Ne2f4#
Ngxh1#
Nfh7#
Nd2c4
Naxg6#
Neg6++
N7b6
Nb5d6#
Nc8xa1#
Nc7xa8+
Nd8xc2
N5xe6++
Nb2a4#
N5d7
Nh1xa7
Nb7h8#
Nf1h8+
N4d6+
Nc6a5+
N7xg6++
Naxg6++
Ne1c2+
Nh7xf6
N3xa1
Nc5xd3+
N5b3
Nd8xf7
Na4c3#
N5xg3+
N3xd5++
Nca4
N6h8
Ne2xc3
Nd6xf7+
Ng2xa3+
Nh2xg8+
Nh1xb2
Nh8xa2+
Nexg6++
Ngh3+
Ncxb6#
Nab5
Ncxb3#
Ncxb2#
N2b8+
Na5c4+
Nc3b5++
Nb1a3#
Nh5xb6
Nc2xd4++
Nb6c8#
Nh4xf3#
N5xc7#
N4xc2+
Nf5xh6+
Nd4f5+
Nb5a3++
Nfxh1#
Na8g1++
Ne7d1#
N7d8+
Nd6e4+
Nh3xa5#
Nb2xa8++
N5f3
N1xc2#
Ne3xf5+
Nf7xg1
Ncxd1
Nh4xf5+
Nh1xa7#
Nxd2++
Ne5xd7+
Ng4xh2+
Naxc7+
Ncxe8
Nf6xe8+
Nfd8
Ne5xf3
Nb3a5++
N1xa3#
Nf5xd4#
Nf2h1+
Ne1f3
N3xh2#
N4xh3+
N8h7++
Nc1xa8+
Nc6xb4
N2a3+
Nc5d7++
Nc2xe1
Nd7xe5++
Nc3xb5++
Ng4xa3++
N8g7+
Nf7g1++
Nbxc6++
Ngxa3
Nh8
Ngh1+
N3c1+
Nd8c2+
Nb7h6++
N1d3++
Nf1e3#
Nbd8#
Nef2++
Nexf4#
N1e8#
Nc8xb2++
Ncxd6#
N7e8#
N1c8
N4h5
Nfxe2
Nb5xd6
Ne8f6#
Na3b1#
N8e2++
Nc3e4+
Nh4f3
Nf6e4
Nh6xf7+
Ng6h8#
N1xe2++
Ng1a2+
Nfxd4+
Ne7xd5+
Nxh8+
Ng1e8
N7f5+
Ndc1
Nc1xd3+
Nf3g5++
Nc5d3
Naxg3++
N8xh1
Ng8xf2++
Nhxf7++
N8c2
N2e3++
Nexf1+
Nh4xf3++
Nbxh5++
Ndxb6
Nd5xe7#
Nf2h1
Nfxd6#
N5xc3++
Ne6xc5++
N6xg5
Ne6d4#
Nc7xe6
Nh5xg7#
Ncxa7
Nc2b4+
Nb2xh1
Ncb2+
Nf7d6++
Nb7xh8
Ncb4#
Nh6
Ng4xh6#
Nb7xc1#
Nh1xf8
Nxe1
Ng2e1#
Ndxf8+
N5xb6+
Nd4xc2
Ne8c7
Nf7e1++
N5a6+
Ndxf5#
Ng4xa5++
Nb4a2++
Ngf4#
Nfd7#
Nbc5
N8b7
Nhf5++
Nb8xc2+
Nh2f1+
Nexf8++
Nf8d7+
Na2g1
N4e6
N6e8
Nf4xd3+
Nhb2#
Ned6#
Na3xh1+
N3xh1#
Ne3xg4#
N7e8+
N6xb4++
Nc3xa2
Nb1
Nxa3
Ng2a3++
N2a3++
Na2g1+
N6a7#
Nf7xd6+
Nc5xa4++
N1a2+
Ne2xg1++
Ng2xe3+
Nb3h2+
N8c2++
Nc6a7++
Nh4xa2++
N5h4++
Nh7xa5#
Nb4a6+
Ne2xg3+
Na8xb2+
Ngf2++
Nfd4++
N8g7
Ne7f5
Nb1c3#
Na8xb6#
Nha5+
Ng5a6
Nxe4+
N4xb6+
N1a7
Nb7d6
Nb8xh1++
N3xh1
Nc1b3#
Nd1xe7++
Nd8xc2#
Ne8d6++
Nb7xh8#
Nb2c8++
Nbxh7+
Ngxf3+
Ngxh7++
Nc8a1
Ne7xd1
Nb8xd7
Nca5+
Ngf5
Ng6e7
Nef7+
Nhf2#
Nc8a7+
N1xa8#
Ncxb8++
Nfh5++
Ngxh6
Nc2a3
Ngxa3+
Ng2xf8++
Ncxd8++
Nh5xa3+
Ngxh2
Nc3e4
Ne8d6#
N1a2
N8xe6#
N4e2+
Nc5xb3
Nd6#
Nfe8+
N3h4+
Ncxb1+
Nc2xb8++
Nxa4
Nexg8#
N6h7
Nc7d5#
Ngf3+
Nh6a8++
N5xf3#
Nd8xb1++
Ne4xg3++
Na6g7#
Ng3xf5++
Nd1xb2#
Nxa1
Ngxa6++
Nb4xa2#
N7d1+
N4b2+
Nag5
Nbxd2#
Ne4xd6#
Na6xg5
Ngh7+
Nbxh3#
Na4g5+
Na8b2+
Na5xg6
Nf2xd1#
Nhb3
Nxh6#
Naxh7#
Na6c7+
Ne4g3
N7h6++
Ne2d8++
Ng6h4++
Nc6d4++
Ng4xf6#
Nbxa4
Nd2e8
Nh3xg5+
Na8c7++
Ngxe5+
Ne8g7+
N5xh3#
Ng5xh7
Na2xb8#
Nba5
Ndxf2++
Nexg5+
Nfh7+
Nde2++
Na6xh4++
Na3xb1
Ne4f2++
Nhxb8#
Nc8d2++
Nb1h8++
N5c6#
Ng4f2+
Ng3xh5+
Nb6xh5#
Ng2e3#
Nxg6#
Nbxh3
N8xc6
N5c7++
Nf4g2++
Nb3c1++
Ne8c1++
Na5g6#
N5c3+
Ne5xf3#
Nxh1++
Nb2xc4+
Ng3e4#
N4c5#
Nh5xb4
Na5xg4++
Nh3xb2++
N6xc8#
Nah6
Na7xh5#
N8a7
Ne2d8
N4d3++
Nf1#
Nc5d7#
N4e5++
Ndb3++
Nd8+
Nxe5+
Ng8f6++
N5xd6+
Ned4++
N2c1
N6xe5++
Nhxf3
Neg6
N3f1#
Na1h3+
Nh7xa1#
Ndxb2#
Nc4e3
Nc7e8+
Nd3xe5+
Ne4xf6#
Nge8#
Ng1xa2+
Nb8xh7#
Nb8c2#
N7xe8++
Ne3xg2++
Nb5xh4++
Na8h6
Nd8b7#
Na8g7+
Nfxh6+
Ne4xg5
Ncb3+
Nc1b7++
Ne7c8
Nd4c6+
N1xc8#
Ng4xe3
N7xf5++
Nce3+
Nd5c3+
Na8b6#
Nc8#
Ne4c5#
Nc6xd4#
Ne8d6+
Nc3e4++
Nhxf5++
Naxc3+
Nhxb6
Nexf4
Ng7xa8++
Nxg6
Ng3f5
Nh7xg5++
Nh2xf1++
Nxe6#
Nfg5++
Naxb5
Ne7c6+
Na3xc2#
Nc5e4++
Nc4xb6++
Nc5b7++
Nh1a3
Nf3h4++
N4c3#
N1d3
Nb8d1++
N7xf1
Nd4f3+
Nh1a7#
Ngh6++
Nga5
Nd5xc7++
Nh1a7
Nexf7++
Nb4xh5++
Nec3
Ncxa8++
Nga5++
N6xd4++
Nfxe3+
N1g8#
N5xf3+
N3xg1
Ng5h7+
N8h6+
Ng3a2#
Na8b2#
Nb8xa2
N8h7+
N8f7
Nb7xd8++
Neg4+
Ncxe5
Ndxf1#
Ngh8
Ne4d6+
Nb8h7#
N7g6#
Ncxa6
N5xd4++
N4a6
Ne5#
Nc2xe1++
Ng2xe3#
Nb7xa5+
Na7xg8+
N4xg3++
Nb3xd2++
N6a4
Nbxa6
Naxh3+
Nb1c7
Nf5xh4+
N7xd5
Nb7xd8#
Nb4xa6++
N7d6++
Nef4
Ne2g1
N3c4++
Nexg8++
N7c6+
Nb3xc5++
Ne1xc8
Nh2a8#
Ncxb5#
Nexf7
Nb4a2#
Na1+
N6d8+
Nhxg4++
Nc3++
Nf4xd5+
Nga1#
Nexf1#
Nd7xc5++
N2xc8+
Ne2xf4
N7xc1++
N8xf2#
Nbd8++
Ng7xe6#
Nb6xh5
Ndxe3++
Na8xg1++
Nh1+
Ng8xh2
Nc4b6
N8xb1#
Nbxa7
Naxb1+
Nbxa2#
Nb4h5+
Ndxf7#
N7xa1#
Nxa8#
Ne8g1#
Nc1xa8#
N8xb6#
Nhxb8+
Nh2f1#
Ng1a8+
N1c8+
Nd2c4#
Nhxb1+
Ncd5#
Ng1xa2++
Nf1xe7
Nca8#
Nd1b8++
Ne1g8
Nd5c3#
N5xe7
Nf1d8
Nga2#
N1b7#
Ndc2+
N7xe8
Nxf7
Na7b1+
Nd7c5+
Nb4xc6+
Ne8xf2#
Na7g8#
Nde4+
Ncxa1
Nd2xc8#
Nexd5++
Nc7xd1+
Ne4d2
Ndxb6++
Nce1++
Nhg8#
Nca2
N5a4
Nhg1#
N5xb4++
N1d2++
Nf6xe4
Nxe7#
Ng8xf2#
N8xf7
Nd8xb7#
Nd4xe2+
Na4g3+
Nf8e6+
Nd7++
Ngf2#
Ng3h1#
Nfxh3++
Nb2xh1+
Nd2f1#
Nf3xg5+
Nh6xb5
Ncxb4
Ngxa4#
Nb5xd6+
N8g2+
Nb7a1++
Nc2+
Nd7f6
Ng3h1+
N6d7++
Na4c3
N7e6
Ncxe8+
N8h7
N4b6+
Ne5xg6
N3b4
Nxd4++
Ne2c1++
Nhg2+
Nf3xe1#
Nf6xh5+
N3xf2+
Ng2f4#
N3e1
Nag7#
Nf4h5#
Nxh6
Nf4g6#
Nf8++
Ndxb7++
N7xb8
N5g4+
Nac5++
Nexd5+
N7d5++
Ne3xd5++
Nd5+
Nh6a8
N1xd8++
N6g5#
Nec8#
N7xh1+
Ng3xh1+
Nb4xd3++
Nfe4#
N7xc5#
Nbxa8++
Ne2xc3#
Nc5xb7
Nfh1#
Nh8xf7+
N2d3++
Nh1b2#
Nexf1++
Nexf2#
N3xb1#
N6a7++
Na7xc8
Ngf4+
Nh4
N4h3
Nh5g7
Nb6h7#
N1xd8#
Nb3+
N5xb4+
Nbxd3
N3b1#
Ne2g3
Nhf8+
Nxg7#
Nh4xa6
Nba6++
N7xc8+
Ng1xh7++
N3e4+
Nde1+
Ng4xf6++
Nc8b2
Nb2xa8
Nc4d2+
N2e3
Nd7xe1
Ne4g5
Ndxc5++
N1e2#
N3xf5+
Nxf7++
Nh2a4++
Ne5f3+
Ne8xd2#
Ng2xf8#
Nf8d7++
Nc6
N4e2#
Naxc3++
Nb3xa5+
Nb1h8+
Nc8xb6
Nc5xe4+
Ng1h3++
Ngxa7++
Na2xg1+
Nb3d4#
Ngf1++
Nf1xh2+
Nhxg6++
Nbxd5
N5a4+
Ndxe2+
Nh8xg6#
N2xf4
Na7xh5++
N5xc4
Nbc6++
N4e2
N6e5++
Nf8xh7+
N6f8++
N2xh4#
Nh2b1+
N8e1#
Ne3xf5++
Nhb3++
N1xa2++
Nh4b5+
N8xd6++
Nh4xf5
N5xb3+
Nfe6#
Ng4+
N5f6
Nf4++
Nfxg3
Ncxe7
Nh1g7#
Na7xh1#
Na1xg2++
Nc4d6+
Ng3++
Nh3xa1++
N5xh6
Nc1xe8+
N1g3#
Nc4xd6++
Na1xb3
N8xh1++
N8h1+
N7d5#
Ne1d3#
Ng3xf5
Ng5f7++
Nd2b1
Nfxh3
N3e2++
Nexd4#
Nc2xe1#
Ng7xh5+
Naxc8#
N5xd7+
Ncd8
Ndxe8++
Nd4e2
Nhxf1#
Nc8a1+
Nag5++
N8e6#
Nh6g4#
Nf3xg1++
Nf7xh6
Nh3g5+
Ndxc3+
Ne8xd6#
N8e6++
Ndxf4#
Ne6xc7+
N8xc1#
Nf4
Nd3xb4#
Nhxg5+
Ne6f4#
Nd3xb2+
Na5xh3#
Ng3h1++
Nc6xb4+
Ng6a7
Nxf1+
Ne6xc5#
N1xh7+
N2xa3
Nc1xd7++
Nb1d8#
Nfe4+
Nh8xb1+
Ndxe3#
Na1xg2+
Ne1xf3
Nh7xg1#
Nc4d2++
N5xg3++
Na1b3++
Nb3xa5#
N2xc3++
Nb6xd5+
Na3xg2
Nd3c1
Nh1b8+
Ngf8#
Na2xb4++
Ne1d7++
Na5xc4+
N4f6
N2xc1#
Na8+
Nc8b6#
Ne7xc8
Nba5#
Ne1d7
Nc2xa1#
Nd3b2+
Nge8++
Ne8xc1++
N5xa4
N1xd2
Nxe2++
Na3g4
Neg4#
Na7xh1++
Nh1a3#
N5e6++
N1xb7#
Ne5f7++
Nfxd5
Na4b6
Nf4xg2+
Nba3++
Nf7xe5++
N8xa1++
Nh8b1
Nhb7+
N7xc1#
Nag5+
Nc8xb2#
N7xg1+
Nb6xh7+
Nb1xd8
Nab1+
Nf3h4
Na1xc8
Nbxc8
Ndf3+
Na3++
N4f3+
N8g2++
Nhxf7+
N3g1#
Na1b3+
Nb1xc7#
N5c7#
Ncb1#
N4xb2++
N8xb2++
Nfxh6++
Nh2g4
N7d1++
Ndxe8
N8xd1
Nge7#
Nc3xd5++
Ngxa3#
N1d8
Na6xc5++
Nd2xc8+
Nxa1++
Nd6b5
Nc3d1+
Nd2xe8
Nh7xf6+
Neg5+
N4xg5#
N4e2++
Ne1c8+
N4d3#
N3c4
Nf1xh8++
Nc4a3
Ne3xc4#
N1a2#
Nf6g8
Nxb3++
Ndxc4++
N3h2++
Nbxd3+
Nba4++
N4xe6++
Nbxc6
Na3h5++
N7g8
Nh8g2
N1xe7++
Nde5#
Ng4e5+
Nbh5
Ngxh6#
Nc2xd8+
N8c6++
Ng5a4#
Nf2g4
N2xc1
N8c1
N2xg8#
N7xh8#
N7xh5++
Na4xh2
Nh3f4++
Nf3xd2
Nb8h7+
Nc1e2#
Nxa4+
Nb6xc8
Nc6b4#
Ng6h8++
Nca4+
Nc3d5++
Nd4xb5#
Nef2+
Ncb5+
N6xe5#
N6xf8
Nfxh1++
Nd2b1++
Nh4xb5++
N4xc3
Nb6h5++
Nh8xb1
Nf7xe5#
N8h6
Nb1xh8
Nca7+
N3c2++
N8d7++
N8f1+
Nf3xh2++
Naxg5+
N2b8
Nbxa3
Nhxf6
Na5xg6#
Nf2h1#
Nh2b3+
N5h3++
N2a8++
Nh5a3++
Ncd5++
Ncxe5++
Nfxe5#
Ng7f1#
Nc2d4
Nh4a6#
Ng3xa4++
Nc7xb5#
Nc4e3+
Nxf5++
Nba6#
Na6h8++
Nb3a5
Nfxe8++
N3f1++
Na5xb3+
Ngxf7
Nf3xe1
Ne7xd1+
Nc7xb1++
Nhxb3+
N2xd4
N3xe1++
Nf2e8#
Nf1g7+
Nh5xa7+
N3g4++
Nb5xh6
Nf7g5+
N2xh8+
Nd8xc6+
Nf6e4+
Nf3d4
Nh2xa8+
Nb7d6++
Nc8e7
N4h5#
N3xc5
Ng4f6#
Na2xb4
N4xg5+
Nhxa3+
Ne5xf7
Nb3c1+
Nf6xe8++
N3xg4#
Nef6++
N4c3+
N3a2
Nbd1++
Naxb8
Na4#
Nd6b7#
N4e6+
Ng8h6++
N6xb7++
Nb8xd7++
Ne1xc2+
N2xg3++
Nh4f5
Nc2xb4
Ng2xh4++
Nfxd2#
Ndxe5#
N8e6+
Nb7c5
Nde4
Nag4
Nab4+
Nh3f4+
N3xg1+
Naxh4
Nd7c1#
Nxd7
Ndxf5+
Nfh1++
Ng1xh3#
Nh6xa4++
Ng6xf8++
Nd4xb3
N6xb5
Nge3#
Nd1f2#
N2b3#
Nh6xf5+
Nfg8+
N5xe4++
Ndxb8#
Nd7c5
N7xb8#
Nb2xa8#
Nc1b3+
N3xf2++
Ne2xg1#
Ne4c5++
Nf8xd1
Nf3xg1+
Nce6+
Ng6xf8
Nxg8#
Nc4xb2++
Nfe3
Nbxh8
Nc5xa4
Nh4g6++
Ngxh7+
Nexd3#
N3xh4
N2xa4#
Ng3xa4
Nca1#
Nh6xf5#
Ne1#
Na2xh8#
Na8xg1
N2xb3++
Nfe2
Nhxg4#
Ne2c1+
N8xg1++
Nf8xe2+
Nf5e7++
N2b8++
N8xd6#
Ng5f3+
Ncd8++
N6xe4
Ndxf8
Ndb8+
Ng3xh5#
Nh5b6#
Nf7xd8+
Ng6f4
N8h2+
Nd3xb4
Nd7xc1+
Nf6d5++
N6xf4++
N3a5++
N3e5+
Ne4g5+
Na4h2#
Na3b1++
Nag6++
Nxh2#
Nef2#
Nbc2#
Nd3b4
Ng2xe1#
Ng2xe3
Ne7xf1
N4f2++
Nf4xe2++
Nd8xf1+
Naxh6
Nh7a5
Nd7xb6
Nd5++
Nf7xd6++
Nhxb4++
Ng7f5++
Nh7f6+
Nfd8+
Ng2h4
Ncxd5++
Nde2#
N6xc5++
N7f6++
Ne4xf6+
N4xh6++
N1xa7+
Nc5xd3++
N1xd3+
Nh3xg1
Nd8xb1
Nbxh6++
Nhxf7#
N1g8++
Ncb6+
Nf8h7++
N1xe2
Ne5xd3
Nb7d8+
Ne5c4#
N7d5+
N5g3++
Nd1xc3++
Nd8xe2#
Ngf5#
N8f7+
Nc5xd3
Nfxg3#
Na2b4++
Nd5c3
Nhg3#
N4h2++
N6xd4#
Nc5b7+
Nb7c5#
Ne1g2
Nha3
Nb4xc6
Nd4xc6+
N7xd6++
Ne2#
Nexf6+
N5xh4
Nf8h1
Nh8b1++
Ng7e6
Nf6xh7+
Ng5h3++
N7c6
Nc4xd2+
Nd5xc7#
N6b7++
N4xe5++
Nf3g5
Nf3xg5++
N8xc6++
N4xa6+
Ng4xf2+
Nc6xe5++
Nhxa3
N5xa6#
Nd6+
Nxc6+
Nc6xe7
Nd5xb6+
Ne3xd1++
Ne6xf8+
Ne5g4+
N1xb8
Nxd6
Nh6b5++
Nc2d4++
Ngxf3++
Nbh1+
Nd1e3
Na4xh2++
Nd6xb5
N2c8#
Nga6++
N3xh2++
N7h5++
Ndf6
Ncd1++
Nab5+
Nf5h6#
N2xg3+
Na1g8++
Ng3e4+
Nc2a1
Nf1xg7++
Nd3xc5#
Nba2
Ng3f1#
N1xh8+
Nf4d3
Nc8b2+
Nbd4+
N6xa4
Ndxe2++
Ng3xh5++
Nce4++
Ne4c5+
N5f4
Nfg4
Nb5c7+
Naxh8#
N5b4+
N2xe4+
Nf6h7++
Ne6c7#
Ned2+
Ndf5#
Nd3xe1#
Nh5g3
Nac3++
Naxh6#
N4xh5++
N6f5+
N3xa5
Nec1#
Neg6+
Naxh1
Nhf2
N6e4+
Nd5b4#
N1xb3
N4g3+
Ngf2+
Ncd3
N7xc6+
Nga4
Na2xc3+
Nbh5++
Nf2d1++
Nh2xb1++
N3xa1#
Ng5f3#
N2h1#
Ng2xh4#
Naxh8
Nd3e5#
Nb6c8+
Nexg2++
N3b4+
Ne3c2#
Ng4e5++
N5g4++
Ngh6
Naxh5
N5e6
Nexg5
Ne5d7
Nce7++
Nb2c8
Nf4xg6++
Nhxb6+
Ng3xe4+
Nh6a8+
N8xb2
Ncxb2++
Na5xh7+
N7c5#
Nfxd3#
N8xe2++
Nf1g3+
Nh8+
Nb3xc5+
Nbxa4++
N3xe4++
Neg5
Ndxe4#
N2h4++
Ne3f5+
Nge5#
Nb3c5+
Ndxb3#
N2b8#
Nfh3+
Nf7xh6++
Nga8#
Nxc1++
Ne5
Nd3f4#
Nca5#
Nh2b3++
Ng2xf4
Nd8e6++
Ng5xh3+
N8c7+
Nd8xb7
Nh5xa3#
Nfd3++
Nbd1#
Nb5a7
Nh7b8#
N7d6+
Nfxe1#
Nc1xe8
N3e2#
Nb7xd8+
Nxh2+
Nb1xd8++
N2h4
Ng4e3
Nh3xa1#
Nh8xa6+
N4f2+
Nac4
Nxf4
N7xe6++
Nbd6#
Nh4xb5#
N7c6++
Ndxe1
Nfe7
Nd7+
Nhxg2
Ng8h2+
Nc1
Nb5xh6++
Na6g5+
Nc8e7++
Naxb6+
Ng6h8+
N4xb6++
Ng7xa6
Nf3h4+
Nbxc4++
Nf3xd2#
Ne1xd3++
Ned6++
Ne2c1#
Nc1xd7#
N1g3+
Ne4g5#
Nexg3#
N1h7#
Nb6h5
Nc2e3#
N8xe1++
Nb6xa8+
Ng2xa1#
N3xh4++
Nc2xd4#
N7xe8+
Ne3f1#
Nc5b7
Nb2xd3
Ned6+
Nb2h3#
Nf3xh4+
Ne4xc5+
Nh5xf4+
Ne7c6
Ng6h4+
N6c5++
Nfg2++
Ncxb8+
Na2xh4++
Nxg7++
Naxg1++
Na4g3
N7xb5#
N1h7
N4b5+
Nf3xh2#
Na1xb7
N4c2++
Nf6xd5#
Nf3e1++
N3xc4#
Ng4xf2++
N1f7+
Ngxa5+
Nfd2+
N3xh4#
Na6b8+
N5xg7#
Ng4h2
Nh6a4+
Ndb3+
N7f5
N7a8+
Nc7e6++
Ndf6+
Nbh7#
Ne7xd5#
N5f3++
Nd4b3#
Nb8h7++
Ng6f8
N8d1+
Nf2h1++
Na4h2++
Ng2xa1++
Ne6xg7#
Na1c2#
Ngf2
Na1xb3+
Ng2xf4++
Ncxb7#
Na8h2+
Ngxa8+
Nca5++
N3d5
Ng8f2+
Nf5+
Nd4xb3#
N1xf2#
Nac7++
Nc4xb2+
Nb7d6+
Ngxe7
Nf3e5+
Ne8xg1+
Nga6+
Ng3xe4
N4e3
Nfxd1++
Ng7xa6+
Ne2xc1+
Ne6xd8++
N4xa3
Nexd7++
Naxc4+
Nfxe6#
Nh5g3+
Nxe6
N4e6#
Ndxe3
N8xd7+
N3xg2+
N6c5+
N3xa4++
N5f4+
Nh8b1+
Nd1f2
Ndxf8#
Nb3xh2#
Nfd1#
N8xe2#
Ngxf2#
N7f1#
N4xh6+
Nf1xg3#
N2h4#
Nf6xh7
Nf4d3+
N1f8#
Nf4xh5++
Nd1c7+
Ne6g7+
N5g6
N7xf6+
Nh1xb2++
Ne3c4
Nhb6++
Ncxd5#
Na3xb5#
Nc6xd4++
Ng2xe1++
Nxb6
N3xc2++
Ng8e1
N2xg1+
Nh7g1
Na2xb4+
N1h8+
Nca6
Ne4xf6
N4a3
Nd6xb7
Naxc5
Ng2f8
Ng3e2#
Nbxd3#
Ng4e3++
Ng6e7++
Nh1f8+
N2xh8
Ncxd4
Nd5xc3++
Nca4#
N5xc4#
Nc2a3#
Nxe7++
Ng6xh4++
N5b4++
Ne5f3
N3e4
Nf4e2++
Nhb3#
N3xf4#
Nexf8#
N1e8+
Nxa7++
Ng4
N3f5#
Nab5++
Ne8xg1
Nh6xg8#
Nb7c1#
Ngxh6++
N6xa4#
Nh3xf4
N6g5++
N4xh2
Na1xh3++
Nb1xh2#
Ne5d3++
Nc5xd7
Nac1#
Nd6xe8
N4f6#
Nf7#
Ne8xf6
Nh1xb8
N6xe8+
Nexc4+
N6xg4++
Nc6xb8
Nxc4++
Ne2xf4#
Nh5xb6+
N8d2#
Nd8xc6++
Ng5a6+
Ne1xg8+
Nh8f7
Nxe1++
Nb2a8
Nh8g6#
Nf3xe5++
Ngxe4#
Nh7f8
Nfxe7+
Nb8a6#
Ng2xh8
Nxg2++
N8b6#
Nfxh8
Ngh8#
N1g2#
Nc8a1#
N4xf6
Nh8g2++
Nf8e2+
N8xe7
Ne7xf5#
N1xf7+
N8xg2++
Nfh2
Nf7xd6#
Nac6
N3xe1+
N8g2#
Nd1b8
Ne6xd4+
N7g1
N3b1+
Nexd6+
Ng2a3
Nxc1
Nf8g2
Nd4xf3++
Nf1g3#
Nfxg8#
Ndxb6+
Ng8e7++
Nc2xd8
N4xf3+
Nb8c2
Na2xg1#
Nb7xh6#
N7f6#
Nc1a8+
Ncxd3++
Nc4xd2++
Nh4xa2+
Nf2d3+
Ne4c5
Ngxe3
Nh1b8++
Na5xb7#
N1xb2+
Nhxb7+
Nd1xf8
Nh7xg5
Ne6xg7
Ng4h2#
Nd6xe4#
Nd7xe5#
Na5g4#
Nd7e5
N5xe6
N6xe5
Na7h1
N8xf1+
N2f4++
Nge6+
N5xa7#
Ng8e7+
Nec5
Na6xb8#
Ng7xh5
Nd3xb4+
Nd4xf5
Na4c5++
N1xg8
N8xd1#
Nc7b5
Nb5d4++
Ncb8+
Ng8xa7++
Nd7b8#
Ne8xg1++
N8g6+
N3xc2
Nga2+
Ned3
Ne6xd4++
N4b6#
N5h7
N7xf5#
Nb6xc4#
Nc1d7#
Nc6e7++
Ncxa8#
N6b7
Nde2+
Nf8d1
Nf7xe1#
Ng8a1+
Nexf3#
Nd7xf6+
Nd2b3++
Nf7h6
Nb2h3+
Nf1d2#
Na7c6#
Ne8d2#
Nh6g4
Nc5xa4+
Nag2++
Nc3xe2#
Nh4xa6+
Ndc4#
Nd6b5+
Nef1#
Nbc4+
N2a8#
N3a5+
N3xh5#
Nh5xa7#
Ne5xc6
Nb6d7++
Nhb4
Nf6d5
N3b5++
Nb2a4++
Naxc8++
Ne3c4+
Nb2d3+
Ng7xf5#
Na2xc1#
Nxa3#
Nh8xf7
N3g1++
Nh4+
Ne8xf6++
Ngh6#
N6d7
Ne4f6
N6b4+
Nf8xg6
Ne8xd2
Nd6xe4++
Nb6d7+
N7f8
Nc4xb6+
Ngxe3+
Nexc1+
Nd4e2+
Nd1c7
Ng7xf5
Nd2xb3#
N6xf5
N7xb5+
N4h3++
N4e3++
N3d2#
N3a1#
Na3xc2
N3a2++
Ncxa2#
Nhxf1++
N5xa4++
Ne5xd3#
Nga1+
Nf8xg2+
N2xh1+
Nxc4#
Ngh3++
Ng2xh8#
Nd2f3+
Nac1
Ngxa2#
Nd7e1+
Nexd7+
Na2h8+
Nh1xg7
Na4b6#
Nah5
Nab6#
Ng4xe5#
Ne2xd8+
N4g3
Nc6++
Nh5f4++
Nb6a8#
Ng4h6+
Nb7
Nc7b1++
N4xd2++
Nhxg8+
N2xb8++
N5h7++
Nac2#
Nf3h2++
Ndxc7+
Nhb1#
Nc1e2+
Nhxg6
Nf2+
Ncxe3++
Na3h1+
Nf2#
Ned2
Nxg1++
Ng1xa8++
Nb4d3#
Ncb7
N5xc7++
Ng5xh7++
Nhg5+
Nexg1
Nc6xd8+
Ned2++
Ng1xa8+
Ne5g6
N2a4
Nf5xg3+
N8xe7#
Ng1+
N8e1++
Na4xb2
N8xg7+
Ng2xf8
N8xb7+
N3b2#
N2xb4++
Nfh8
Nf2xe4++
N2e1#
N6h8++
Nc7a6#
Nhxf6+
Nd3f2++
Nexc7++
N2xa1+
Nh8a2+
Nfxe6+
Nexg6+
Nef4+
N8a1#
N4b3#
N8xe2+
Nh2a8+
Nhb5++
Nf2xg4++
Nf7h6++
N3h4#
Nc1#
Nec5+
Nf6g4++
N2xc3
Nb5xc7++
N8h2
N1xb8#
Nxd2#
Ng8xa7#
N7e1+
Nd4xe2++
Ne4#
Nd5xf4
Nc3xd5#
Ne4xf2++
Nb1a3+
N4h6++
Nc5d7
Na6xc5+
Nf6++
Na5h3
N1xd7#
N3xg5
Ncxe4#
N8g1#
N1g3
Ndxb5++
Na4g5#
N7xa1+
Ngxh5++
Nb6c4
Ng4xe3+
N2xb1#
Nbxa1++
Nb1h2#
Ne5d7#
N2g1++
N7xg8#
Ng7xh1#
N6a5
N4xa5++
Nbxh1
Nab2
Nd2f3++
Na4xc5+
Nc5a4
Nxd5
N5e3++
N3xc5++
Nfxd1#
Nhxa4#
Nf8h1#
Ne3g2
Nxh2
Nhxb1++
Ndxe1++
Nb4xh5
Ngxa8
N5xg4
Nb4++
Nb1xc7+
Nbxa6++
Nfd3
N6e4++
Nc2xe3
Nxb1#
N8f7++
N2e4+
Nc6b4
Nc8xb6++
Na5c6++
Nh8xf1
N8xe7++
Nf2d3++
N2g8+
Nd4c6
Nxd6++
Ne1xg2++
N1xa3
N6xf4+
N2xa8++
Nhb7#
N4d6++
Nc8xd6+
Ng5
N1xb7+
Nf3d4#
Na3xg2#
Na8xc1++
N4c3
Nfg8
Nhxf5
Nfg3++
N8xf1
Nd2f1+
Ngxf8
Nfxh6#
Nd8xc2+
N6c7+
Nhf1#
Nd5xc7
N6xa4++
Nh3xg1++
Nc7xa6+
N8xc2
Nh2xg4#
N3c5+
N3xc1+
Nh4f3+
Na8g7
Nh8a6#
Nfg4+
Nb2h3++
Ng7e8#
Nc7xb5++
Nxf2
Nd3xf2#
Nc1xb7+
Nhxg4
Nc2d8
Ndc1+
Na5c4++
Ng1a8#
N3xb5#
N7c1++
N3xa1++
Nf6d5+
N7xc1
Na2h8
Nf3g5+
Nh6xa8
Nd1f2+
Nb8h1
Nf2d1#
Nbc3++
Ng7++
Nf6
N4g6
N8xa2++
Nb7xd6++
Ndb1#
Nb1xh8+
N5xh7
Nb5xa7
Nf8h7
Nbxh2#
Nf1xh2
Nh4b5#
Nf2xe8++
Ncxb4#
Ncxd7
Nd6f5#
Nd6xc4++
Nc7b5#
N6xe7++
N5f6+
Nc7xb5
Nh8xg6++
Na7xb5
Nh7xb6
Ng6xf4#
Nef1+
Nxh6++
N3b5#
N5xh3+
N2f1#
Ngxf7+
Nhg5++
Nh2g8
Ndxb2++
Nb5#
Nab2+
Ne4xg5++
Nc8a1++
Nef6
Ng8e1++
N2xc4+
N6c8
Ne3d5+
Ne8++
N1xc7+
Nf3g5#
N7xa8
N6b5#
Nf7e1+
Nbh4#
Nh6xb5#
Nd1e7
N8xa7+
N7f6
Nh8g2#
N2c3+
Nb7xh6+
Nga8
Nd2xf3+
Nhb6
Ne5xc4#
Nxe4#
N3xg2#
Nd1xc7++
N2xf4+
Nc8xd6#
Nec5++
N6xd8+
Nd6xc8
Ndxe7
N2xa4
Nbh5#
Nb5h6+
Nd3f2
N2d3
Nh5xa7++
Nbxd5++
Ng5xh3
Nb8xc6++
N6xa7++
Na4b2#
Nhxf4++
N5xg4#
Nh3a5+
Nh4xf3
Ng6xh4+
Ne8xf2++
Naxh5#
Nb2xc8
N5d3+
Nfxh5
Nb6xh7
N5h4
N6xc7
Nf1d2
Nb1xa7#
Ng6h4
Nb3xd2+
N3xb2#
Nd1xb8
N3d4+
Ng4xh6++
Nc7a8#
Nxc6#
Nfg2#
Nc3d5+
Nc1d7++
Na6++
Na6xc5#
Nh5xf6++
Ncb7++
Ndxb2+
Ndxe5
Nb5a3#
Na1xg2#
Ng6a7+
Nhxb6++
Ncxe1
N6d4++
N7h1+
N7a8
N2b1
Nfh3++
Nce3#
Nc7e8#
Nc1xb7++
Nf5e3
Nd6xf5++
Ng2xe1
Na6h8
N3xc5#
Nf8xd7
N3xb5
Na7c8++
Nc6xd8
N3xc2+
Ne5c6
N4f5#
Nh7xf6++
N8xf2
N3f4
N1xg7#
N2xb3+
Nexg7#
Nbxd4++
Nb3d4++
Nfe3++
Ne7
Nec8
Ngh7#
Nd6e4
N2h8++
Nc4e5
N7h1
N8b7#
Nd8xe6
Nbxd2+
Nh3xg5
Nb2xh1++
Na4xb6++
Nd4f3
Nc4xa3
N4xa3#
Ng1xf3#
N1xg8+
N3xb2+
Nh3xb4
Nexf7#
Nhg4
Nfe3+
Ne2f8+
N2a1
N2xf4++
Nexf5#
Nde8+
Ncxe6++
Nfg3#
N1a8++
Ndxc6++
Nc7xa6
Nd6f7++
N4xc2
Nf3xd4#
Nd1++
Nbxa2
Ng6xf8#
Ne2g3++
Nf8xd7++
N3xa5++
N1g8
Ndxf7++
Nf7xe1
N7c5++
Ng2xa3#
N7b8
Ng7xe6+
Ncxa5#
N3f2+
N2b4#
Nd7xc1
N1f7++
Ne8xg7++
N1xc7++
Nfxg1#
Ncb3#
Ndf6++
Ne8d6
Ng8xh2#
Nh2b3
N3xe2
Ndxc1+
Ng1xh7
Nag3#
Ncd3+
Na7g6+
Ngxe3#
Na5xc4#
N7d8
N5xe6#
Nah7+
Nc1d3++
N8g2
Nh1g3++
Nhg3+
Nh1a3++
N5xg3#
Nh6#
Nc7xa8++
Nf4g2+
Nh3++
Nxe3
Nd2xc4++
N1xc8
Ngxf5
Nd4xe6+
Nd7f6++
N6c7++
N7f5++
Nc8xd6++
N4d3
N3xb2
Na8xb6++
Nce3++
Nh2g4++
Ndc2#
Nc3xe4#
Ne6xd8
Nc4xb6
Nhg7
Na4h2
Ne6c7++
N8g1
Nc8xa7
N3xe2+
N6xe7+
Na5b7+
N4b5++
Nhxa1++
N4b5
Nxg2+
Nbc8
Nf7e5+
N4a6+
Nc8xd2#
Ng6a5
Ne5xf3++
Nf6xh5#
Nbxc2+
N5f3+
Nxc5+
Nxd8++
Nxf7+
Nb4+
Ngxa1#
Nge1+
Nd7e5#
Na6g7+
Nexc7+
Nb5h6#
Nbd6+
Ne5d3+
N2xg4
Ne1g2++
N6b4#
Nc1a2+
N1xf8#
Na2g1++
N5xa4+
Nce8
Ne5xg6++
Nc7b5+
Nc2xb8#
Nfxg4++
Ng5a4
Na4b6+
Nah8++
N3b2
Nc8e1#
Ncxb2
N3xc4++
Ngf8+
Ned7++
Nh6xb7++
N4e5
Nf6g8++
Ne6f8++
Na5h3++
N6xa5#
Nc3a4++
N1a7#
Na2c3
N3xd2#
Nf7xg5+
Nfxg1
N4d2++
N6e7
N6b7+
Nh3b2+
Naxc1
Nfxg3+
Nb8xh7++
Na7xg8#
Ne1
Nfg1+
Nh3g5
Ngxa2++
N6c8#
N3xa2++
Na2xc1++
N5xd4+
Nec1+
Ncxe1+
Nb4xc2+
Na1g2
N7xd1
Nxb6#
Nb5d4
Nc7xd5
N7xb5++
Nb1xd2+
Ncxd4#
Nd4e2#
Nbxa3+
Nc8b6
N8xd2#
Nd4c6++
Nh7#
Nbxa5+
Nac5+
Nhxb1
Nc4a3#
Nh5xb6++
N6c7
N3b5+
Nh5xg3++
Na2g3#
Na4xh6+
Naxc4
N5xf3++
Ned7
Nd7c1
Ng8e7#
Nhb5#
Nh2xa4
Nh6f7#
Ngxh4+
Nb3xa1++
N8b2
N8c2+
Nd5e3#
N2b4
Nbxa6+
Nxf3
Nga3#
Nge1
N6xc5
Nxf6++
Ne1g8#
N7xd1+
Na1c8
Nf6xe4++
Nd4xb5++
Na3xb1++
Nd3c1+
Ned5+
Nf8xd7#
Nf8xe2
N2xb8+
Ngxh4#
Nga5+
Nd3e5+
Nac3+
Nf4xe2
Nb3d2+
N6d8#
Na8xh6
Nf4g2
Nf1h8++
Ngh2
Ng3xf5+
N5xe3++
Ne3f5#
N4a5#
Nf6g4+
Nxc6
N2xg3
Naxb4#
N2f4
Nxa6+
Nde6#
Ng3a4+
N4a2+
N1xd3
Nb7xa5
Nh7xb8#
Ndxf6++
Ngxa7+
Nbd7+
Ngf4
Nf3xh4#
Nd4xf3#
Nb3xd4+
Nf7g1#
Ncxa5
N7xd5+
Ne3#
Ndxf3#
Nb2a8++
Na1b7#
N2xb4
N5xe7+
Nxg4+
Nf2g8+
Nfxd7#
Ng2xa1
Nd5c3++
Ng1xa2
N5c3
Nb1d8+
N4b2#
Nb8xh7+
Nc3a4+
Ncb1+
Ne5xc4++
Nxb7+
Ne2xf8+
Nexd6++
Nf2xd3
Nf6+
Nf5xg7++
Nd8f7
Nf8xe6
N1e7++
N3xf1++
Ne8g1+
Ncxb3
N3d1
N3xg2
Nf5xg7
N1e3#
Naxg8++
N3xe5+
Nab3++
N4xb3++
Nf4xd3++
Nh3f4#
Ne1xc8#
N8d6+
Nb7xc1+
Nb6h5#
Ngxf4+
N3xb1++
Nc2xe1+
N1xb7
Na2h4++
N8h2#
Nxf3++
Nh2f3+
N7d6#
N1xg2+
Na3c4+
Nc3xd5
Nf4xh3+
N1d7
Nc2xa3
Nfe4
Nexc5++
Ng2xe1+
Nexd5#
Nha6+
Nd2#
Nb1c7#
Nh8xf1+
Ne6xg5++
N8xd2++
Ndf8+
N2d3#
Ne2g3+
Na2h4
Nd6xb7++
Nb5xd4
Nc1xd7+
Na4xg5
Nb8a6
Nha7+
Nfd6+
Ne2f4
N7xc8
Ng4a5+
N6g7
Ndxb1++
Na7c6++
Na5xg6+
N1a3
Nh8xa2++
Nge2#
N6c5
Nbd4#
N1xf3
Nf5d6
Ndc4++
Nfd1++
Nfxe3
Nef5+
Nfg3+
Na1xg2
Ncxd7++
Ne5d7++
Nh1xa3+
Nb2d1#
Nb4h3
Nd5xe7+
Nbc3+
N8xc6#
N7h8
N8xc1
Nh7g1+
N4xh2#
Ngxh4++
N7xf8
Ngxe5++
Nga3++
N3b2++
Ng8xf2
Nac2+
Ndc3+
N3xd2++
N7xg1
Nd7xb8#
Nxh7
N7b6++
Nf5d4#
Ng5e4
Ne4xd6
Nb1xd2++
Nca1
Naxg2++
Nh4xg2#
Ngxf8+
N6xh4+
Na1xg8+
N8xd1+
N4a3+
Nc5xa6+
N8g7++
Nfxg2#
Nba3
Ne8xd2+
Na8xg7
N4xd2
Nb1xh8#
Nf4h3+
Ne8g7
Nh7xg5+
Nxg6+
N2xe3++
Nhxg7#
N5xh7+
Nhg2
Nbxh5+
Nd3xc1#
Nb8xc2
Nf2g8#
Ne2xd4
Nfxe3++
N2g3#
N2xe8
N8xc1++
Ngf5+
Nhg4#
N8xf2++
Nbc7
N7xe1
Nge2+
Nbxd7++
Nf3xh2
Ncxe6+
Nexc5
N5f6#
N1g7
Nc7xe8#
Ne8xc1+
N6a7
Nxb3+
Nbxa5++
Naxc7++
Nh4f3++
Nfh8+
Nd3e5++
Nhxf1+
N7d8++
N3c5
N1f3+
Ne7xd1#
Nha7++
N7xe6#
N1c7#
N5e4+
Nd3xe1+
Ngh5+
Nf6d7+
Nc3d5
Nde2
Nxb2+
Nh5a7+
Ng8xa1#
Ncxd6++
Ngxf6#
Nbxd8++
Na8c1++
Nf1d8#
Ng8xe7++
Nb5xh4+
Nh7b6++
N1e8
Nd7xb8
Ng1e8#
Nb5++
N5g7
Nhb5
Nca2#
Nh7f6#
Nb1c3++
N7xh1
Nh7b8
Ncb4+
Nbxc1++
Na5+
N8xe1#
Nh1g3
Nb8c2+
N3xg1#
Na4xh2#
Ncxd5
N3e5#
Ndxb5+
N3xg4+
N2d4+
N6f7
Nd2e4#
N1xb7++
N5f7++
Na6c5++
N7xd6+
Nd3b2#
N7xf1+
Nd5xb4
Nh1b2++
Nhxa8++
Na2xg1++
Nh3f2
Nhxf6++
Ng5a4++
Ncd4++
Ncd7#
Nfxd7
Nf7xg5#
Ndxb4+
Nb8xa6+
Ng3e2+
N7b1++
Nfe1#
Ne5xf7+
Ne1f7+
Na1xh7#
N5f7+
Ndxf6
Nfg6#
N7h5
Ngxe6
N7xh1#
Ng5xf3
Ne6xd4
Nf4xh3++
Ncxb3+
Nbd7++
N1xc3#
Ne4f2#
Nb5h4
Nab5#
Nc4d6++
Nc2a3++
Nxa7+
Ngxh1
N8xf2+
N5c6
Ne3d5
Nh3a5#
Nh6f7++
N7c6#
Nc1b7
Ne4d6#
Naxh3#
Nxb5+
Ncxb7+
Nc8xe7+
Nexc4
Ng5f3
Na2g1#
Nb2#
Nh1xf8#
N5f7
N3xa2
Nh5a7#
Nd2c8#
N2f4+
Ndxc1#
N6xb4
N2xd3#
Nbxc1
Nb3xd2
Nf3h4#
Nh2xb1
N8g6++
N4xh3++
Nf2e4#
Nc2xd8++
N3xb4
Nc1xe2++
Ne4g5++
Nd1xf2++
Ne7f5#
N2xc3#
N3f2++
Ng8xa1+
Ne5c6#
Nxd1
Nca3
Nfxg5++
Nhxf3+
N4h5++
Ng5xa6++
N7h8+
Ng8+
N4xb5++
Nh8xa6++
Nd5f4+
N5xe7++
Nb1h2+
Nf3xh4
N1b2#
Ne4f6#
Ng6f8#
Nf6xd5+
N8xg7
Ne5g4++
Nhxb7#
N7h8++
Ncb1
Nc1e8+
Nh7xb6++
Nd6b7+
N1xh3+
Nde5++
Nc5b3
N3xb4++
Nf3xd4++
Ng2xf8+
Nhg7++
Ng1xa8#
Ng6f4#
Nd6xf7
Nh8g6++
N4xf3++
N4xh3
Nf5e3+
Nxc8+
Na8xh6++
Nd4b5
Nxh5+
Ne3xd1
Ngxa1++
Na3g4+
Ne7xf1#
Nexf8
N7h6
Ne8xg7
N3b1++
Nh3xf4+
Ngxe8
Na1c8++
Nfg7++
Nf5xe3
Ne1f7++
Nc3b1+
Nd3c5#
Ne6xc7
Nh5f4
Ne7f1+
Ng1#
Nhb6+
Nbh3++
Na8#
N2g8#
Nd8e2++
N4xf6++
N6a4#
N4g5++
Ncxa2+
Nbxc8+
Ne2xd4#
Nxb7++
Nd8xb7++
N4xf3
Ncxe8++
Nag6
Ng6e5#
Ngxf2+
Nh6++
Nf8xe6+
Nxe2#
N2xb3
Nd2xe4+
N1xh2+
Naxb3
Ne2xc1
Nf1h2
Nb7xc5
Ng8h2
Nb4d5#
Na7h5++
Ne5xc6++
Nd1xe3++
Ndf2++
Nc4a5++
Nh3g5++
N7xd5#
Na6g5
Nc2a1++
Ne8c1
Nc8xd2+
Ne2xf8++
Na6xb8
Nc6e5
Nhf1
Na5g4+
Nf2e4+
Nh8f1#
Nb4xc2
N1g7#
Nb4h3++
Ncb4
Na1h7
Nc6e7+
Ne1xf3#
N7xc6++
Nd1c3
N5d7#
N2e8+
Nh5xg3#
Nhxg6+
Nd5e7
Ne1xc8++
Nc1xe8++
N5b3#
Na8h6++
Na2++
Nd8xf1#
Nd1c7#
Nb2c8+
Ned4
Nfh5
Nb7h8
N4xg2++
Ndxb7#
Nh5g3#
Nf4xe2#
Nbc2++
Nfg2+
Ne2d4++
Nhxb5#
N5xe6+
Nb5xa3+
Ne2f4++
Nec2#
N1c7++
Nc6e7
Nc5a6++
Nh5a3
Ngxa3++
N4f6+
Na5xb7++
Ne6c5+
N7xa6#
Nd7xc5#
Nce6++
Nfxd7+
Nef7++
Ne2d8+
Nga3+
Naxb2++
Nd2c4++
Nc2b8#
Ndxc3
Na8h2
N6xa8+
Nc4e5+
Nf6h7+
N6xc7+
Nbh3+
