Bc5??
Rfg1+
Rgxf4?!
-74.1]
Raxc4+
-9.29]
Bcd3
N4b5+?!
N1d2
-119.65]
Rgxg2#
R7xf4+
-36.62]
-24.73]
R8xg3?!
-40.79]
Nbd5?!
Q1xf4+
R4b2??
Reg7?!
Kc5#
R8xa4+
-19.51]
Rhg4?
R5xg4+
Rhh5
-120.66]
Qge4?!
Rec1?!
-76.11]
-77.6]
R5g4#
-62.25]
R1xb5
Q8b3
Rfxd6+?!
-92.08]
Qc3?
-34.2]
Qhxb7#
Ngxh4+?
-122.46]
dxe3+?!
-36.21]
-15.13]
Qxc8+
-15.03]
Raxa4#
-65.37]
-54.24]
R6xf3+
Qxg4?
-21.19]
Rhf2+?
Rcxc8?!
R7c2+??
-10.71]
-56.14]
-71.09]
Qxd1+?
Rdxh2?
Re1+
Qexe4?!
g1=Q+?
cxb4#
-5.06]
-10.8]
Nxe1??
-81.97]
Neg2??
Qhb1
Qaf7?!
R7xf4?
Q8xf2#
Ndc7
f3?
Rbxa6?
Ke6#
Rdf6+
Q4b3+
exf3
Qdd6#
Nfg4?
Qcg6?!
-47.5]
Nbd4
Qad5#
Ra2+
-30.46]
-72.33]
R2h4?!
-43.53]
Re6+?!
N6f4?!
Qhxf4#
N3e5?
Rec3#
Nexd2??
-8.92]
R4b3#
Q4xh4
Rcxh4+
-44.26]
Bc5+?!
Rhxg1??
-119.95]
Q8b8
Q7h7+
N5h3?
-77.25]
Rb5+
-27.01]
-13.29]
Qhxf5
-91.67]
Kxb8?!
Rgd4+?!
R2g4#
Q1xb6+
Nxg3
Qb6+?!
Qgxf7#
Qaxf1#
Q5xf4#
-76.32]
Reb1??
R7b6?
-32.83]
Ncxe3+?!
Bbc7
Raxa1
-45.88]
Nxe4?
Qd5+?!
-26.79]
R4h7+
gxf5+
N6d7?!
-35.77]
Ngf3#
Rad7+
-26.11]
-47.25]
-36.91]
-12.62]
-41.89]
Qhh8#
Bea4
Rbg5+
Rbg7+?!
Qhe7+
-14.7]
-92.85]
Rcxd5?
Raf7+?!
Reb5??
Reg1??
Rhd6+
Nxc7
-94.18]
-70.67]
e8=Q+?
-30.52]
Qgd3+?!
Rfxf3+??
-118.82]
N3d4?
N1g3?
-99.7]
-44.1]
g1=N
Ncxb3??
Rhb3
Q6g2
-9.33]
-34.78]
Nxd6??
R5c6?!
Kc1+?
-66.95]
Rdxg1
N6xe4+
-5.72]
Qhg6?!
Bg5?
Kxh5?!
Rexb2??
Rxg5+
-115.75]
Qgb6?!
N5xe4??
-23.01]
Rhxf7?
R1a5?!
-91.48]
R1xg5
-23.26]
N8b6
Rac3??
-10.81]
Qbd8?!
Qhxg7??
N3d4??
Q5e3+?!
Nec4
Rfxc6+?!
-83.64]
Qxb7
Qcxf2
Qhh6#
Rcf5?
Qhh1+?!
Qcc7#
Kxd6
Qbh4
Qxd5?
Nfd1?!
Nexg6
R5xg4?!
-22.98]
Rba8??
-54.89]
R1g4
Rff7
d8=R+
Ne7+
hxg4?
Reb7?!
R4xd5?
Raxe7#
Re6+
-40.9]
-47.32]
Rfg7+?
-65.62]
Q3d3#
gxh8=Q
Qgg7+
Qac6+?!
-111.77]
-109.59]
Qh4+?!
Q6b6+
Ngxe6#
-66.79]
cxb3+
Bd2?
Ngh4+
Qfd4+?!
Rbe6+?
-64.85]
-67.29]
-2.05]
Rxg6#
Nce8?
Qexc4#
-24.94]
Rgg1#
Q2d5+?!
-70.22]
Rfc6?
Q7b3+
Q7b3
Ncb4+??
Qgd4+?!
Kxa6??
Qgf2?!
N8xa6
Qad8+?!
Rcxb1?!
-114.14]
#49]
Q1xc2
-108.55]
Qfh5?!
Rcc5?!
Rdxc7?
B3d4
Kxe8?
-27.97]
Q4g6+
Rdc2+
-88.2]
-1.38]
#-55]
Bxe7?
R8h5??
R8xg2+
R7h5+?
-55.41]
Q3b5#
R2d7+
exd1=R#
-78.18]
Nexc3+?
Qdd4#
Nba6?!
R4c7+?!
-109.96]
R8xg5
Qh6+?
N3h4
Rcxd7+
R4e6
Qaxd3+
-43.32]
e3+?
Kf3+?!
R4h7#
Bxh8?
-116.78]
-113.57]
N1h3?!
Ndf5?
Q2f2?!
-100.53]
Rbxg4#
Rgc1+?!
-52.19]
R8xe7+?!
R5h3??
Rcd5+??
a1=Q+
Qxd5??
Nexf3
Ra2??
Raf2+
R3a5?!
-39.4]
R7f4?!
-27.48]
Na7+?!
Qexc7#
Raf8??
-114.35]
N2b3
Rgxf1??
Qhxh2#
Qfxf5
c6?!
Rgg4??
Rexc3#
Qc6+?!
-11.77]
Rfb8??
R8c6
Qhh3+
Nexc3+
-35.08]
-113.89]
Qxb1??
Rdxc2??
-38.89]
dxe8=B
Ncb8
Rexc8
-61.63]
Ngh2?
Qaxg8#
Qxa6+?!
-47.76]
N5xg6
N5e6?
Qdxc6+
Qgg6+?!
Q3xa3#
Qeg2+?!
Qdd5+
Nab7?
N5c6?!
Nxb5??
-45.85]
Rbxh7#
-40.39]
Rfe4+?!
R5b3#
Nfd2
a4
Rcxg2?
Q8xc4
c2?!
Qha4#
Q4a8
R3c4??
-28.46]
Raxd3
-90.96]
R8a5#
bxa5+??
Rae5?!
Q1h2+
-102.64]
N2b4+?
-50.88]
Nb5+?
-80.56]
Q8f4#
Qbxa7?!
Q5g5#
Rfh7??
Qcxc2+?!
-79.78]
-118.23]
Qbxe1+
Qdxe4+?!
d5
-10.53]
-57.67]
N7xd6
Rgb3+?!
-7.89]
Ke8
dxe8=Q#
Nxc5+?!
R6xe5+?!
axb8=R+
Qb1??
bxa4+
Bh3+??
Qbb4
-14.86]
Rbxe1+
Qfd8
Qbb3
R7xa6+
Rbxd4?
-44.58]
-0.08]
Nbc6+?!
Q8xg6+?!
N1e2?!
R4c7?!
Rgxg6+?!
Rgf6#
Rbxc7??
-85.87]
R8xb7+
R3a7?!
-11.69]
Rfxb7?!
Qgd4?!
Nexf6+?
Rcxb6?!
Qce5
Nexf3+?!
Raxd4
Reg6??
Rhf2+?!
Bd4+?
Rgh7??
R6xd7?
-12.6]
Qaxb3+
Rbxd5
-108.72]
Rdxg1??
Qff3+??
Nca3+?!
Ncxe3?
Kxb3?!
-60.0]
N8e7+?!
Rdd4?!
Qhxa6+
Rde6??
-40.95]
Nxe3+
-8.79]
Rgd1
Q2a6+
Rhe7
R1b2?
Ngxf5?!
Q5e1+
-16.59]
Ncxe4+
Bxb1+
R1d5?
-60.65]
Rcf4#
-106.38]
Rxd6+
Qeb5
R6d4+
Rhxf5
Q6b5+
Rhe7+?
Qbxg1#
Rxb5#
-65.6]
Neg6+?!
R8a7?!
R6c3?!
Qbh6+
f7?!
Qfxe4+
Red4
h3??
-15.52]
Q4a7+
Qda6#
Rbe8+?
Qbxd2
-81.25]
-73.81]
Rff8?!
R6e5??
Nfd7+
Nbxd3+?!
Rdxd3#
Qc5#
-2.76]
axb1=Q?!
-118.2]
Nce4+
Rdc8?!
-116.04]
-65.48]
-23.94]
-38.29]
Rdc5#
R6f7+?!
Qxb8
Rea7
exf8=B+
-23.3]
Q2xg4#
Qxc8??
f8=N+?
-107.72]
Raxe8?
Q5h5#
-7.14]
Q6xe5
Qdh6
hxg7+?!
Rexd3#
N4xh5?!
-23.33]
#-13]
Be5+??
Rxh8+?!
Bf2+??
N3g2
Rfxf4?
Nde6+
Nc3?!
Rec1?
Nxa7
Q5e2
Qad2
Q4h7#
Rbxc4+?
-38.71]
Nxf6+
Q3xb5#
cxd1=N
Rfd2#
-26.88]
-29.12]
-23.64]
Ngxh7??
Rdf6+??
-68.76]
Nca2+
cxd7?
-28.85]
-17.02]
-32.71]
-90.42]
Ba3+?!
Bxe2+??
Rah5
Nbc7?!
N2f4?
-22.91]
Q7d6+?!
Kc6??
-26.68]
Ra8+?!
d1=Q+
Raxb2
-64.64]
Nge3
N6c5?
-121.84]
Nc4
Qee3+?!
Bfd5+
Q8xe2+
Qdxf5+
Rh7??
Rh1+?
-66.44]
-108.1]
-0.92]
-41.46]
Qxb5??
-43.45]
Qbg8+?!
h8=N+
-59.11]
Rdxd3??
-100.77]
-65.05]
Rdf2??
N6xb5+
Nb6#
Rbxa2
Rgxh7?!
Qaxc1+
R2d7??
N3f4+
Rhg8+??
Rcxd4?!
R8xg5+
-111.45]
-32.58]
Rdxb7?
R1xg7#
Q6xf6
Kh6#
Q8g2#
Qde6??
-118.56]
-75.53]
Ncb6
Q3e2+
Qhxf6#
Rbxd2??
-115.82]
-12.55]
exd1=R??
-4.36]
R8d3
-70.53]
N5xg4??
Q2c1+
-103.17]
N1h3+
Qexb4
Qbb7
Ka6?!
-18.65]
-24.39]
g8=B+?!
Rexb4?
Rfxf4?!
Raxc4
R1f7+
-16.2]
-53.19]
Qa3+?!
b3??
Rdd1+
Q6xb7
Qfh7
R4d6?!
-98.94]
axb6+?
axb5+??
Qaxa6#
Rhxe2+?!
Rdxd2??
Rhxc2?!
-80.58]
Rcxe5#
Qhh2+?!
N4a5+
-10.86]
gxh2??
R4xh7
-55.27]
Rgxe5+??
Qxg7+?!
R1xf3?
-13.28]
c8=N
Qaxd2+
Rfe1?!
Rhxh6+?
Rxg5
-50.35]
-1.31]
Rgg7?!
-88.32]
Na5+?
#35]
exd2?
Kg1#
Qaxf7#
Q2e5+?!
R1xe6
Rda4+
R2g4+?!
-39.49]
Rcxb5
Qfa6
Rcxd2
Rab5
Nbc2?
R2e4?!
Raf2??
R2d3+?!
-51.79]
Rhe1?
Rhc7
R7f4
N7xe5?!
Qac3
-118.89]
Qdc3
hxg8=R
Rcxc6?
-7.23]
Nb1+??
Nbxd7??
Rexc2
R2g7+??
Qba6#
Qb6#
Qab3#
Qgb3?!
Qha3+
Red5??
R5e7?
-86.49]
Rce7?
Qexd4+
R5xe3
-104.09]
Ndb7??
Kxd4+??
Qbxe7
R4a3?!
Bh2+?
Rcd5?!
-66.4]
-7.47]
-112.06]
-97.91]
Q1xf1
Rcb1+
Rbb6?!
-110.9]
-100.14]
gxf2?
Rad5#
Rfc3??
R7c6+??
Nbc1
Qhg1+
R8xa5#
Q2c6?!
Rcg6
Qcc7?!
Qxe6+
-27.45]
Qxc7+
Nxc3+
Rexa2#
-2.74]
Qc7??
Q8b5
R6d2
Q6b5
Ke8+??
Qge2#
-15.42]
Q7xc7+
Qgxh4+
Qexe7#
Rfh1
Qxa4?
-114.62]
Q7xc6
Bec3+
-57.87]
Bg4+?
-0.05]
Rgg8+
-54.46]
-27.44]
-30.57]
Qcb8+
R6c7+?!
Rcxa4+
gxh7+
Qfxg2
Q8c6
Q5d2+
Q5a3?!
Qcxb4+?!
-58.25]
-123.05]
R3h2
-49.0]
c1=N+?
Bg8+?!
-14.92]
Re7?!
-54.1]
Qfh2#
Nhf1?!
R7e4
Qgd6+
-96.03]
Qbb6#
Rab7
Rfxc8#
Bd3+?!
Rge5+?
-94.87]
Be6#
N6d4?
Rbxc4
Rxc5?
Ndxf6+
Qgb3+?!
-62.96]
Qxh7
Q3a6
Kd7
-12.92]
Ncd7+?!
Qfa4#
Rdd7?!
Qfg8
N5e3+
c1=R#
-51.19]
-104.89]
Q2xf3
R8g3+?
Nf1
Q8d8
Rbf4??
-31.2]
Ndf5+??
N6d5??
-44.87]
R8h3?
Q4h7
d7+?
N3a4??
Rexf1+?!
g8=Q
Raxb4
R2a4
Q4xa5
-36.4]
Qg2+?!
-99.06]
Qxb3??
R8a4?
R4c5?!
-40.93]
Qh4??
Rfxf7?!
R2xe5
R8xa7+
fxe5#
Qbh1
Qhxd1+
Neg4?
Rgh6?
-12.93]
Raxf7+??
Nxe1#
Rfxe6?!
-70.61]
Nxe8
Qdxf4
Q6f6
Qea4?!
-109.32]
Qdf2
Rab1+
Qdxf3+?!
R8xe7?!
-5.14]
Ree2+
Qad7
-18.64]
-102.02]
Qf2+?
Qaf4#
Rxg6??
Re3??
Qgh7+
Rxg3?!
Rexe3
Q3xg4
-37.33]
-2.56]
R8f2+?
-57.45]
Qg4+??
Bb1??
-57.55]
-28.74]
Rfh7?!
Rae2+??
R1c2+??
Qbxa4#
-38.11]
#-61]
Nf2?!
R1d7??
R1xe3+?
-2.32]
Qaf6?!
-109.91]
R8g4?!
Ndxe6+??
g4#
Kxf7+
-74.41]
-115.34]
-6.11]
Qexb3
Ngxh7+?!
Rff7??
Nfxe3+?
Qhxc3#
Q1f3?!
Q4xb6#
-29.75]
-84.84]
Naxc7
Ndc2?
Rcg2#
Nf5+??
Q3h8+
Rhd6??
Rad1?!
-7.57]
-100.59]
-59.79]
-22.29]
-69.9]
Rb8+?
N8e7
Q2a7+
-37.87]
Qee2??
Ndf4+
R8xf7?!
N5xd6??
Nexg5?
Bc1
Q1xe2
-6.39]
-53.51]
Rgxb1
-48.01]
Rxc8
O-O?!
Rcxf8+
Rdxc6?!
Q1h6#
Qhh8
-106.93]
-5.46]
Rbe1??
-98.05]
Nde3?
Qbxa3+?!
-18.62]
N5e3?!
Rxa1+?
Rbg3#
Rdxd5+?!
Q6c4+?!
-62.41]
-100.09]
Qhd2
Nge1?
Nxf8+??
-8.13]
Rfe6+?!
Qxg2+?
Qaxc5#
Qgd3#
-92.17]
-58.5]
Qfd6
-8.84]
-23.0]
Rfh5?!
Qdc2+?!
Rf6#
-45.45]
-69.18]
Rcxf6+
c3+?!
N1e3
Qhd4+?!
-23.52]
Rexa3
-6.55]
Raa6
-75.55]
Rbxf7#
-27.04]
Qgf6?!
Bxc6+
Qaxc8?!
R6g5??
Qhh5+
Qce8?!
-99.12]
Rfxh6?!
-7.39]
-91.55]
g2+??
Kxg3+
-32.25]
Be5#
hxg2#
Q4c4+?!
N5g4??
Ngf1?!
-11.55]
Qda3+
-46.96]
-102.97]
Rad2+?!
Nge5+
Nab2??
Rdc1+?
Bfe3
Rcf2#
N2g4
Qcxc5+
Na2+
Ncb5+?
Rxb4??
Qdxh1+
-3.68]
Qac6
Qxa6?
N3e5?!
Qa2+?!
Q5e8#
Rbxg2??
-123.25]
Qgh4
Rfxc8?!
Qaa1#
Rfd7+?
-97.79]
-3.65]
Kg4?
N6c5+??
-104.37]
-34.34]
Rbh6
Qbh5#
-52.29]
Rbxd3?
Rca7?!
-29.86]
-18.14]
Q2g4#
N7xa6
-13.7]
Q6e5#
-1.19]
Qff8
Nab3?!
Rbxd4
Qxd2+
Raxb7?!
-5.83]
-7.28]
Rhh3??
-85.63]
Rdxh7??
Qexe1#
-25.92]
Qexh1#
dxc4??
-5.74]
Bxb2+??
Nfd4+?
N6xa5+
-87.07]
R8xg4+
Nexg4+?
R5h3?
Q8xh6+?!
Rda8??
Q1c3
Rdg5+
-44.24]
Rhc1+??
Qcb4+?!
Qah2
Q2f3
Rhxc8?!
R3d5+
Bxh2+
-69.31]
Rgxh2#
Nxh7??
-33.82]
Ka3??
Rc6?
N7g6+
e5
Rgc7??
Rdg6
Nxb2?
Qaa3+?!
Nexg6+?!
Rbf7?!
Rd8+?!
Qg6+??
Rxb6??
Rcxe5
Nca6??
Rbe6?
R8xh2+
-23.8]
-46.39]
Rc3??
Rbxb4#
Nc2
Qxh6#
Raxc5
-75.52]
exd4?!
Qfxa2+
-11.42]
Ng4??
-30.74]
-25.01]
Nge6+?!
Q8f7
hxg7+
-48.77]
Qee8+?!
Rac7+??
-70.38]
Bxe5??
Rhe2+?
dxe1=N
-119.59]
N8a6+
R1h2+?
Nfxe3?!
-1.44]
Qdd5?!
-4.22]
Naxb2?
Qec8
-34.95]
-115.01]
Bxe2??
Kxb7+
Rfxc3?
-119.69]
-2.18]
Qhf5?!
R4a6?
bxa8=R
-3.66]
Qe2+?!
N8b6+
-58.22]
Qdh4+
Nexf7??
Qgf8+
Q8b5+
-48.54]
Ndxf6+??
-122.22]
Q5xg6+
gxh1=N
R1c5+??
Qcxd4#
-90.68]
-33.86]
Nhxf2??
Rexc1#
R7xf2+
-10.26]
Qbxe1#
Nb3??
Qbb6
fxe6#
Nxc2?
Rcf7?!
Rce4??
-68.83]
-93.22]
Qcf4+?!
Ka4+??
Rdxh3?!
f6+?
Qed4??
Kb5??
R6f2+??
-36.03]
Q8f6+
fxg1=Q??
Ke4?
-70.84]
-58.0]
Qc1#
Rgxe5??
-122.83]
Bxh8?!
Kd1+?
Rexg7+
Ref8?
hxg5+?
R8f6??
Nd5+?!
Kh2+??
-113.84]
Rec8+?!
R6xd5?!
Bxg4+??
Ned2+??
-17.15]
Rf7+??
a1=N??
R1xb4
-77.03]
-33.44]
-96.12]
Nxa6+??
Kd7?!
Rch5?
Nfg7?
Qga8+
R2b5
-11.99]
Qgxf7+
Qfxg4+?!
-104.2]
-49.48]
Nexc8?
Nfe7#
bxa7??
Qdxd4+?!
Q8a7+?!
Ngxh7
c7+
Ndxf2#
Nf2+?
fxg1=R
-15.58]
exd1=B+
Rhxg7??
Nb3+?
-56.32]
-83.7]
R5xd3+
Q2f3#
Qfc5+
-14.88]
-8.04]
-55.85]
-21.02]
R6e7+
-44.68]
-41.62]
Qed7+
-38.22]
N7xe5+?
Ngxf4+?
-99.8]
Rdxd1
Qbe5?!
-113.71]
N5h6?
-3.44]
Kxh4?
R1d5??
Qbxb5?!
-4.16]
Rce5
Q1h4
Rge6+?!
R1xh2+
Qbe8
R7xg6+?
#7]
R3xf2??
-29.77]
Q8h6
-92.47]
exd1=Q+?!
Re8
-28.94]
-94.73]
Rbe4??
Q7d6?!
-11.91]
Qga6
Qd6?!
c4?
R7xb4+
Qxe7+?
N2c3?
Rdd2
Nbxa7+
Raxc3+??
-32.31]
Rg3+
Rec4??
Qed4?!
Bca4
R4d2
-15.37]
Rac3?!
f8=R?!
Qae7+
-1.09]
Kg5?!
Qc6#
-104.79]
-2.12]
R5d3?!
-112.36]
h6#
-3.86]
-14.23]
R7xc5+?!
Qbh6
-114.93]
-29.96]
R6c7#
N5xf6
-2.24]
R8xd6?!
-69.16]
Ng8?!
Q8xc8
Nxd7#
e8=R+
Q7xc5+
Q2b3+
-70.17]
R1f7#
Q4c6
Nexc6#
Rcxf2?
-29.58]
Rdxa3+
Qbc3+
-1.5]
R6c2
Rhb5
Q6xg2+
-6.24]
Rbxd7#
N4e3+
Rgd8+
-117.13]
Raxh1
b6+
a8=Q+?!
Qxf1+?!
R6xe2+
fxg5+?
Nde3#
Q3g8+
Qxb8+??
Nfh2?!
R5d2??
-109.99]
-20.7]
Nbxa6??
R4xa5?!
Qe2?!
-24.29]
-43.1]
gxf2??
Qfxg4+
-116.25]
-21.4]
-99.51]
Ka4
Qdf1+
-108.57]
-67.67]
cxb7+?
-62.91]
-39.51]
Kxe7?!
-37.58]
Rbg3+?
-103.57]
Nec7?!
Neg8?!
-95.88]
Rcxe2+??
-104.93]
Nde5
-122.66]
N3xd5+
R5f3?!
-9.1]
Nxc3+??
Rhh2??
R5xe7+
Rhd8+?!
Rbh1??
Q4a4
R7b4?!
-82.66]
Qhc3+?!
Kxa6?!
Qea7+
Qxc3?
R1c4#
Rexe4#
-5.12]
R3d4+??
Rf8?
-53.23]
Nef4+??
-48.6]
Nba7+?
-33.05]
Qea1+?!
Rbxf7+??
Ref2?!
Rbxd1
gxf4
-5.49]
Reb3??
R1d3#
Rxd5+?
Qxd8+?
Ngh3
-57.02]
Rch7?
-125.47]
-30.77]
exf1=Q+?
-61.39]
-28.71]
bxa1=Q+
Qxb1
Ndf2#
Qgxf5
R3xh4
N4xd5+
Qaxg5#
Bxg8
Bcb3?!
Nc2+?
-67.6]
Qxc7+?!
-62.1]
Nab6
-36.23]
-62.78]
Nxf5
Bxc4+?!
Rb6
-0.31]
-5.81]
-32.27]
Qaxh3#
-92.35]
-41.33]
Ngh3+?!
Qbxf4+
-113.63]
Bb4+?!
Rbxe8??
R6d5?
-7.9]
Qxh7+?
Q1f4+
Neg6#
Rec1+??
R1e2?!
-44.09]
Qdxg1+?!
Qgg8+?!
Rgf6+??
Qgh5+
-53.96]
Q8e4+
Rf6?!
Rfxg7?!
Ref2?
Rce6+??
Qaxb3#
Qxb3+?!
-70.7]
Bg2+
-43.73]
R7g5+
-57.17]
Rc7+
-66.39]
-50.86]
-2.93]
N7e5??
-14.22]
Qxd6+?!
R6a5?
-44.66]
fxg4+?!
-3.58]
Qa5+?!
-32.66]
-47.88]
-71.08]
Nde4?!
R1e6+?
Q5f3+?!
N7xf6
-85.05]
Rfxf3??
#59]
N6c7?
Nce6#
-79.12]
Rge2
-64.86]
Qxb4+?!
-7.86]
-72.81]
axb7?!
Q1g7?!
-32.6]
R6g3
Qfh3#
Rcb7#
Q7xd7#
Q8xg5+
Qaxa2
Rfxf7#
Rec7#
Rag1#
N5h4?!
hxg2??
Q1xf4#
-112.84]
Kxh7??
-91.56]
R4b2?!
R5a2
-115.87]
-75.74]
R8d7#
-120.62]
Qhxd5?!
Qff2??
N3xf4?!
Q5c1+
Qbc1+?!
Nhf4#
Rcxc2+?
-50.91]
Kh3#
Rde5?!
Rfc3+
Q6e6#
Rec2+
-114.66]
-115.63]
Nef5?
-68.19]
Rg7+
Rxg8+?
Kxd6??
-39.92]
dxe8=R?!
Ngxe6?!
-25.86]
Ng6
-47.89]
bxa6
R1xf6?
Kxe6?
-63.35]
R8f2+?!
R8e3+??
Rfa3?
Rhg7#
R8c2?!
d1=R+?!
R8xb6?!
Nge3+?!
Rbxd6+??
R1xe3?!
Qfxh2#
Nxe3+?!
Ref4??
-15.43]
Qg8+
Rfxd4+?!
R5xd4?
Reh5?
Kxe2??
Raxg8?!
-118.58]
Q8xc7+
Nb1#
-14.66]
R5c4#
cxd6+
cxd7+??
exf2+??
R7b4?
R8g7?
Rcxc7#
Q7b3#
R3c6?!
Rde5
-4.49]
Qbc6?!
Q3xd2
-12.39]
-28.45]
-46.3]
Nc5+
N2h3+?!
Rhc1?
-93.7]
R8xa3+
a7+?
R6xa7
-22.65]
-31.36]
Qcxc6?!
Rdb4
-72.41]
-36.82]
Nd5#
Rf1+??
Nfg8?!
Rfxe3+?!
Q7xd5+
Qbf2#
Ngf2?
Kxa2?
R8g2?
h6+?
Qd1??
N6b5+?
N5f6??
R5xh2
-1.04]
Qfa4
Qee7+
-59.67]
Qhd6+
Raf5#
Rgxg7+?
Rfxc4
R8d7?!
Qg8+?!
R6g4+?!
-97.01]
R5xe2
-98.67]
-20.13]
Qxe2
R8e7??
-112.33]
R5h6+?!
R6xb4+
Qc2+??
-55.98]
Kxe1??
Qhh6
-19.45]
-49.56]
Ndxf6??
Rdxh4+
Nxf8#
b7+??
-71.14]
R1xf3
Neg2+
Q5f4+?!
Qf4#
N6e7?!
-121.36]
Raxd2??
Qdc6??
Qbb3+
Bd7+
-41.35]
Kxe4?
R7h2#
Qexd8#
cxb3?!
-25.19]
Ree6?
Rbh4?!
Nxc7+?
Qhd1?!
-26.75]
Kxh1?!
-45.77]
Raa5?
-42.1]
Ref2+??
Rbf2?
-12.4]
-11.95]
-69.3]
R8b7+
Qg2#
-99.97]
-65.61]
-50.21]
Rgxe4?!
R2xc4?
Qcxb1#
Nexc3??
Bg4+?!
Rhb7+?
Nec4??
R6xd5??
Bxf6+?!
R1xd4??
-3.24]
Rexg4?
Rf4#
-26.59]
bxc3+
Qhe7+?!
Qah5#
Qcxd3#
Qbh4+?!
Qba5#
R3d6#
Rbxc1?!
Rcxf1+??
Qdd1#
-2.54]
-53.17]
Bde2+
a8=N
Qcxg7#
f8=R+?!
-50.06]
Rbxf6?
Qdxc7?!
-116.69]
Nfh5?
Q2b1+
Rxf5
exf8=N??
-4.04]
Bxc1??
-53.64]
-89.16]
-14.42]
Bd8#
N2xe3?!
R4xg6+
-57.07]
Rcxc2??
Bxf2+?!
Bb5?!
Rcg8?!
-98.01]
cxb7+?!
Rexf2#
Qcxf6#
-43.25]
N6b5
Qbc6#
Qf4??
R1f7??
Qa3?!
Q6e7+
dxe4+?!
Qbxe6#
-22.07]
Qga5
Q1h2#
Qbxh7+?!
Q2e6?!
Bxd7?!
-57.71]
Nec5??
-25.16]
Reg7
R1xe6??
R3d7+
Kxc5
h1=N+?!
-60.04]
Be8
Ba4?!
Q4c7#
Kg8+?
R3a6?!
-88.96]
-32.1]
Rf5
Nb1+
-39.97]
-23.13]
Qdf8#
Qch8?!
-21.84]
Rhc5+
R3xd5?
-114.01]
Rfxc7?!
Rbxc3
-110.96]
-5.62]
Ndxc7?!
Qfe8+
Rfc1+?!
R3a7+?
Qb6+??
f2+??
-15.93]
R3h5?
-83.39]
Rhxd1+
-105.37]
-12.45]
-48.22]
R1b5+?!
Q6xd7+
Qc7+
Naxb3+
R6e7#
Nbc6
Rdf7
-3.63]
R1e6+??
-71.62]
Qfc2+
R8xc2+
Na2#
Ng2+?!
-4.44]
Nac6+?!
Kxb4
Rdh3?!
Rc1+?
-38.66]
Qea1
Rda4??
R8xg6?
-2.63]
-118.92]
Rhf7+?
Qcf8??
Rbxb6+??
Nxc4+?!
Kb3+?!
R6xb5+
-56.1]
Rfe1?
-2.72]
Qf8
Raxe1
Rhb8
e7#
N3xf4
Rbf4+
Bf8
-10.65]
-49.69]
-58.39]
Q4g4+
Rgf5+
Ncxb7?!
Bb6+??
cxb8=N?!
Q1xc3+?!
Q1xa2?!
Rbxd8?!
Bg7
R2f3?
-86.46]
Nfxe5+?
-1.76]
Rhe8??
Rch3??
Qxb1?
-51.62]
c8=N+??
Rdf4??
-24.31]
Qe1+??
Neg4??
Nxb8?
Ngf4??
-110.59]
Rexc1+
R5xh6
Qe8?!
Rdb2
-122.76]
Rce4?!
dxe6?
Nxh4#
Nbd5??
Rgd7+??
-4.74]
Rxb5?
-26.16]
N1xh2
-63.16]
-48.68]
Ned1+
Rxc8+??
-41.09]
N2xe3+
Qda7?!
-11.64]
-44.56]
-14.19]
Bf1+?
-52.95]
Q7e2#
-16.83]
Rf8#
Qhxa1+
R4h6?
Ngxe3+?!
Q3xg3+
R8b3+
N5f3?!
Rcxb1?
Q8xf5#
-15.23]
Rfe4+?
R4a6#
R4e2+
Ncd7?!
Q7b7+
Qce1#
Q5xc3#
Rdxa2#
R1d5
-46.75]
Q3xe3
Nxa3+??
Rxb1?!
R2e4+?!
Rdf1?!
Qcc5
-39.62]
-8.75]
R1d2
Be2+
Bd8+
Qbh1+
Qdxc1
-16.02]
N5b4
Rgxg4+?
Qa2?
Nc8
R5h6
Bxh2+??
Qag5
R7e3?!
R8h5?
R5g3#
Kh3?
Kc1??
Nhxg3+
Ngxf7+?
Rgxh3
Nexd3
Ncxd5??
Q5g3+?!
Nba4
Raxc2
Bxf1+?
Qcxb2
-7.26]
Bxg7+?!
Rgc1+
a8=B??
Ka5??
-13.95]
Bde5+
Q6xf5#
c8=Q+
Rcxc1??
Qaa2?!
R8xh3+
Qgxb5+
Rf5+??
Rfc1
Nd2+
Qxe5+?!
N1c3
Qdd2??
Q8xe8+
Rhe8#
Nxf4+
R7xe5+
g4+?!
Nce2+?
Q4f4+?!
-118.21]
Rhh4??
-75.08]
Rexd7??
-22.22]
R2d5?
-10.35]
Rdxf2+?
bxc1=R#
Qaxa1+
Bd1?!
Qde6+
R6b4??
Rdh2
Rf4+?!
Nxa4#
Qaxf4
N7b6??
R2xe6
-52.97]
Qeh5+
Bxf7
R5h6+
Rcxa3?!
Qcf7
Qxg5
-7.77]
Ng2#
Rhxf6
-70.48]
Rbxf3?
Qfxe7
R4xe6?!
Qee6
-92.84]
Qh4
e1=Q+?
Qfxa3#
R5f6+
Bxe6?
Qb8
-6.76]
-112.08]
-110.46]
g3#
Rgxh4?!
-107.81]
Qbd8#
Rcf6?!
Q3xg4#
-63.7]
-22.21]
-23.6]
Kg1+??
Rfb7??
Qa8?
Rfe5#
Rxc7#
Rbxg4+
-31.72]
Qcd1#
-26.05]
Bxd8+?!
Rhb1?!
-65.55]
-26.69]
Q5d8#
Rbb4?!
R1b7+
Nhxg1
N6xf4??
Kb6?!
Rdc2+?!
Qaxh6+
Kc4+?
-69.15]
-6.42]
R1xe3+
Nxe6?
Rgb7
-83.66]
{
Qb3?!
R6e4+
Nbd5+??
Q3f6
-106.95]
exf1=Q#
Ned3+
-100.39]
Q6d5#
Rfxf5?
R8b7#
Qfxa2
Rbxg6
-18.26]
-13.69]
Rcf6?
R8e4+??
Qfxa3+?!
Qf5+
Qaa8#
R7xd5?!
g3?!
Qxg1+??
-78.21]
-104.05]
Rec8+
exd3?
Nge4+??
-26.34]
R2b4?!
Rfxe8+
Rfxe1#
Raxh6#
Nxc1??
Qac7+?!
-25.43]
Ndb6
-24.33]
-32.94]
g1=R+?!
Rd2+??
Qxc3#
-118.64]
dxc6?!
fxg1=Q+??
Qfc6?!
-15.21]
-69.52]
Rcxd3??
R1f4+
-53.09]
Qxh1??
R1xf6+
R4e7+
-53.37]
Rexb3#
Ne4+
R1d3?
R3f6+
Q8g3
-86.03]
R1e2?
-55.04]
N5xe3
#6]
-71.17]
Qfh5#
Kh7#
R1e4
Rbf1?
Q2xc4+
-93.33]
-28.61]
Ng6+
Beg6?!
Qad4
Kc6?
-19.41]
-109.18]
Ref3+
Nec1
-78.35]
Rcc2+
-82.91]
Nc3+?
Rb1+?
Rbe1+?!
R1xg4+?!
Ndf7#
Rhf8?
-15.9]
Kd4?!
-18.74]
Ndxe4
-55.3]
Nf4+?!
fxg1=Q+
Nd6?!
-5.82]
Qxg1#
Nba2+
Qeg6?!
dxe5?!
R5e4??
R2b7+
-17.51]
Qd1+?
Qaxc5+
-74.97]
R1c7+
Rxc7+??
R3c7#
-68.15]
-7.15]
Qcd3?!
-44.73]
Rxh8?!
-54.55]
-59.91]
Qfxf1#
Rha2?!
-7.91]
-31.62]
-20.51]
Qcd6
Rxf8+?!
Ndxb4?!
-61.32]
Kg5+??
R6f2?!
Ncxb4??
-4.88]
Q4f3
Ndxc4?
Qxh4??
-13.81]
Nfg6+?
Rxd3+??
Q3e2#
-9.36]
-53.92]
N2e4+?
Rge8?
R2xd4
R1d6?
-52.36]
Ra6+?!
-85.17]
Rgxe4?
Bgb6
Qag1#
R7g3??
R2xf7
Nfd2+?!
Qha4+
Q4xe6#
N5h4+??
Rac4+
Raxe4??
Qhxe7#
R1xh4+
gxh6+??
Nh1
Rac2#
Nhxg8
Rcxa6??
Rff6
R5e2
-105.99]
Rfxc7
N7xc5
fxe1=N+
-5.23]
Qbxd4
Ne7+??
Qba4?!
Nfh6?!
#19]
B6c5
Qhxf3
Rfxb8??
Nexc5?
-77.8]
Qhxd3
Rcxb3?!
Q5d5
-35.21]
Qda7
fxg7+?!
-77.97]
Qf2??
gxf2
Rhb3#
Rdh8??
Ba6+??
Kxb8
R4xc7?
N7xa6??
-74.49]
Ngh5??
Rgd2?!
dxc1=B+
-20.02]
Rexh6
-43.62]
Qbxf3
Ra4??
Rgb3+
Qhxc2+?!
R4xa3
-49.45]
Q6d5+?!
Qah6
-57.36]
Rf7??
-20.88]
-10.15]
-15.12]
Rgf3??
Ng7+
Nb7#
Raxe8#
-96.46]
Bge3
Raxf8+
-15.75]
-10.04]
-49.84]
Naxc6?
N4b5#
-27.55]
-48.67]
Rag6?
Nxh3+?!
Rhe5??
-19.53]
h7+?
Bg3+?
R1a4+
Nxe6+
Rxb3#
-109.24]
-17.73]
Rbxe2?!
Qfxe6?!
-61.4]
N4xc6
Q5f6?!
Qgxg2#
R6xf7??
N3f2?
R5g7?!
-11.02]
c7#
Kc3+?!
R4f5+??
Q3e3+?!
R8xg6
Qhe1?!
Kd8??
-113.39]
Rbf5+
Rbxb6#
Qxc3?!
Qcxd6
-75.12]
Qdxe4
Rae2??
R5xe3?!
Nhg7+
Rcg6+
Q5f8
Nhg6#
Ngf7?
R4xf6+
Qfe5+?!
R4e6??
Q6xg8#
Raf5
-102.03]
R8f3?!
-94.68]
-105.18]
Qdc1
-25.96]
Rbf1
N6xa7
N4g5+?
Qab4+?!
Bf4+?
Bxa5+?!
Rxe8??
Na1??
Ngxh5?!
Qaxe2
-56.63]
Q5f5
R4e6+??
R2h4
Rgxg8+
-61.64]
-55.86]
Qag2
d1=B?!
N5g6?!
Qgxf3+
Nfg8??
-49.72]
Rfd5??
Rce3+?!
Q4b1+
Q8xc2+
-55.69]
Rhxg2+?
Nxe5+?
R4a3
Nhg1?!
R2f7?!
Rdxb2+
-62.5]
R5xc6+
R2c4
Rhe4?!
Nhxg6?!
Qea2
Qd2?!
R6c2?!
Qfc2#
Raxc3?!
R5c6
Rhb1??
Ncb3
Q4g5#
Qa1+?
-32.03]
Nef5?!
Ref1?
-74.46]
Nfxe2+?
Rbxe2+
B4e5
-74.94]
Qdxf4+?!
N5h6
N5d4
Raxc7
Rdf5+
Qd7+??
Rxh1?!
-85.94]
Raxb2?
Rbxb2?
Qdxg4
Nba8??
Red8?
a2+??
N4xf5
Rgxa7+
R3c6?
Q7a2
Nh6??
-34.07]
-0.97]
Q6xf5+
R1h6+?
R1g3??
Qbb5
Rdf8??
Qfa8?!
Q1xd3
Rhd7+?!
-38.61]
Raxe5
Rgxg7??
Rgxd5
Q5xf2
Kg4??
Rc6+?!
Rdg7?
Nxd8??
R8h6+
-14.13]
Qbd2
-86.19]
-21.16]
Q5g1+
R8c3
Naxb6
-65.47]
Qfxe3+
Nxf3?
Qfxc7
Bh1+?
Qcc8+?!
-1.62]
R1xd5
Ba7??
-120.35]
-46.23]
-59.3]
-57.46]
Ndf6+?
Qdf4#
R3b2??
-66.13]
Nh4+??
Reb6
-14.29]
Bh8??
Rb2?
Ned5
Rxc7+?
-24.62]
-31.37]
-31.77]
h1=R+
-38.64]
N6xe5?!
Ncxd2??
-36.28]
R2c6
Q3xf2+
N3b5
-113.09]
Qhg3?!
-27.07]
-61.51]
Qhxd6#
-116.59]
R5c3?
-114.45]
-26.63]
O-O-O#
Bh2?!
Kf7??
Rxe7?!
R6h5??
Ne5+?
fxe8=Q+?
f1=N+?!
-39.34]
-42.27]
-84.98]
Qea1#
Nxc4?!
-60.87]
R3xe7??
R1e5
Kd3+?!
Q8f8+?!
bxc8=Q+??
Rgxg1+?!
Qda3
Qbxf4#
Q4c4#
Qca1
R1xa5+
Ree7?!
-16.53]
Ngh7?
Qgxh7#
R8c3+??
Q2c5#
-65.29]
Q4d3#
Rdxc7
Q7g6+
Rd3+?!
Nfxd5??
Q5f2
Qdh4#
Q5d5?!
R2xa7+
Qeh2+?!
Rfb3+
cxb8=Q+??
Rha3?
Qaxb1?!
Q8d3#
-28.32]
Rhc8+?!
-24.4]
-66.59]
R4g5
Qcxf1+
Kxd6+?!
Nhg2?
-51.37]
Q3b2+
Qcxg1
Ncxd2+
Rfxa6?!
-35.39]
Nfxd5+?!
-59.9]
Nhg5+?!
R5xd6
R8h3+
Bxd4
-68.7]
-40.18]
-53.91]
-6.68]
-58.28]
-46.93]
Q1xa5#
Q6xd6+
-90.39]
N5d6+
Nfg1?
R7xa4?
-121.91]
Qxh4
-8.21]
Qce2
R2c7
Ned7??
Rdxg1#
R1xa2?!
Rdxf1+?!
R2d3+
N2xg3?
Q8a7#
N3a4?!
R7g3?
-121.06]
Rfxg8+?!
R4g2+
Nexd3+?
Bxd2+?
exd5+
-26.47]
Ngxh3+
Qexb7#
Nxh2??
-14.95]
-10.13]
Q1xe2#
gxf8=N+
Raxa3?!
c3?
Rexb6??
Bg7+??
R5xf3+
R8h3+?
Qaxa2#
Q7d3+
Rfd5+
-116.94]
bxc8=R+
Qeg8+?!
-65.35]
Rhd5
Rfa1?!
Q6a3
-50.31]
Raxh6
-10.55]
-18.09]
Q1g6
Qd4?!
Q4xg6#
-96.39]
-30.43]
Rg6+??
Rxh5
Ne2?!
Raxd7?
-44.38]
R8xg5?!
Ra6+??
h8=Q?!
-76.18]
Kb1+
exd8=Q+
Rfxh5?
R8xe5
-21.81]
R3c7?
Ngxf3
-32.28]
Kxg4?!
R3b6
Nge3+??
Rab8?!
Rfxe5?
Q4xd5
Rg8
Rxb5
Qee3+
-48.64]
N5a6
Kd2+?!
Qdf4?!
-6.46]
Ncd3+??
-63.94]
Rbg8+?!
Q3xh3#
-41.66]
Rb3+
R8xf7+
R5xe6
R3c7+
Rgd4??
B1d3
Q8a8
Raf6+??
Q2xe4
Nxa4?!
Ref7+?
R3a4
Raf7+
Naxc3??
-19.6]
Qxc3+??
N5e3?
Qdb4+?!
Q7h5+
R8xa5?!
-31.29]
R7e2+?
Qeb5#
-7.32]
-81.48]
Rcc1
Qaxa1#
Qfxf7
Q5e3
N2b4??
-50.77]
Nfxh6?!
exf3?
-2.99]
-71.87]
exd8=Q??
-41.99]
-52.13]
Qfxf6+
Rcf1?!
Qdb2#
Rcxh2#
Qa3b2#
N3e2
Nb8#
Na3?!
Rhc7+
-64.62]
Nd7?!
Rcf8+
-25.69]
Nc6+??
Rxb2+?!
Rxe2+??
g8=Q#
R2b5+
fxe4+?
Qgg2??
Nfxd2+?!
Nfxe7?!
Ncxd3+?
-29.76]
-91.51]
Rexe7
Qgxc8
Ree8
Qeg2?!
Nbxa6?
-111.79]
Nbxd3?!
Qcb5#
Qge6+?!
Qb3#
Q3g7
-44.77]
Ke4+?!
R1xa6#
N7c5+
Rgxg4+
hxg5+
Bxh1+
Q1xc2+
Ngh4?!
-86.7]
Rae6#
Qab2
Rae2?!
Qxe3
-52.17]
Rexd3?!
Qdxf5#
Raxd5?!
R3g4+
Qfxb5#
exd5#
Qxb1+
Bc4
-68.51]
Ra4+??
R7g2+
Kc6
Rxc3+
R1d5+?
-99.69]
Reh6?!
R2h4??
Rgb2+??
R5e6?!
-27.3]
-31.61]
Rcxd6??
Rd6+??
Bc1#
Rcg3?
Rdxa3?!
-19.09]
Rfg8+
Rhb4?
Qfxd5
-38.46]
Qcxa6#
Q6xf7#
Nhf2+
R5xd4
Qa7
R2g3??
-40.67]
-30.38]
Rexd4??
Rbxe7??
R1e3+?!
Bxc8?!
R8xf6??
R8e7+?!
-45.13]
N2f4?!
Q1a1+
R8xd6+?
Rdc3?!
Nde5+?!
Q2b2+
-117.47]
Rdxf4?!
Rhd8+
fxe2#
Qgxe4+?!
R4g3+??
Rhxe1?
R3e7
Qe3#
Ndxf3+
Qbb4?!
-78.5]
Qexg2+
-27.49]
cxb8=R+
Red5+?!
Qf7?
g1=Q#
Qhxg4
Nd1+
-38.12]
Rcxh7+
Q5xb4#
Q6xb2#
R4xc2
-56.37]
Rhg8+
-43.47]
R7xh4
Qxa7??
Nxg8+??
Kxc4?
R8c6?!
dxe7+??
Rh6#
Qcxb6+?!
-77.63]
-88.05]
hxg2?!
Q7d4
Q1xh2
Rbxh3?!
-21.49]
Rdxc3
Kxd7+
N7xa6+
Kd1??
Qfxe5+
Q8xc5+
Qdxe4?!
R2xh3?
Qgxf4+?!
-23.7]
N4h3#
dxe2+?
Q2e5+
Nxg3+?
Qhc1?!
gxh6+?!
Qfxg8
Qhf1#
Rhb7+
-110.72]
Qbd7+
Nxa1+?
Qhg6+?!
hxg1=N?!
-56.53]
Qfb6+
-31.9]
-0.09]
dxc8=Q?!
Ndb3
R2xc7
Qfxd1
exd7+?!
Rgb2?!
Qgc3+
-11.34]
-104.77]
-71.93]
R3g4??
N1e2+
Qcd7?!
Rxf5+?!
R6xe5?
Rac1+??
Rxc1?
Ree8?
R3xh6
R7d6??
Ned2+?!
-3.29]
R6a3
Rxf7??
Qcf2?!
Rah4?
Rcg3?!
R7e2+
-112.68]
Rhd4+
Qdf6#
-58.08]
-46.43]
Qgh8+?!
Qfe1?!
-19.96]
Ne5+??
-19.56]
Ned4?!
Q3g6?!
Rbe2+??
Nbd2+
R7xd4
Nec3??
R1d5?!
Nexf3+
R2xa6?!
Qde1#
-120.51]
Qde5?!
-37.34]
Raxd2?
-13.18]
Bc6+
Qxe5+?
Rdf1+
Ng5+
Qhe8
Na1
R8xc3?
Qge1
Qaa4
R8d2?
N5g3+
R4h7
Nxa4??
R8xb4
f1=Q
-67.02]
Qexh8
Qxg7+??
Qgf1
Rexe4?
-63.04]
-13.25]
Nhg5
R1a3??
Qfh1?!
Rfb8?!
-27.68]
Nfxd1?!
Qfg5#
Ngh7??
N4xb6
Rgf8??
Ndc3+?!
Nc2?!
Nxa8
Qcxd5+?!
Qah3
-54.04]
Qbxf2#
R5b2#
-101.22]
R4xc6+
Ngh7
-87.68]
cxb1=Q+
Rcxa3??
R2h3??
N3xf5
-53.89]
Bxd4?!
Q2g7+
R1xb6#
Rdg2?
Qxh6+
N1xa2
Qdxa7+
-29.15]
Nh1??
N3xe2??
Bg6?
R2a7+
R2g7?
Rgc7+?
Reb8+??
R3xf6?
Rdc7??
Nfg4#
gxh4
R4xa2
R8xf5?
-62.66]
Rexh5+?!
Qgb7#
Qdxa1
fxg8=B
Q3c6#
-29.7]
Nexc8?!
Nexf2+?
Rab4?
Rgxf6
Rfe7+??
-117.05]
f8=R#
Q4xa5+
R5g4+?!
f8=N??
R8xc5+
R6g5
Qfe1#
-42.91]
-5.84]
Nhxg6#
Nfxg3??
-61.77]
Q8xd7?!
Q5b4+
Rf1?
Kd5?!
Nbd1?!
Rb1??
-10.01]
-2.87]
Nxd2+?!
-28.62]
Nde3+?
Rexc8?!
-98.18]
-111.33]
Qgxb3#
-108.69]
N7e6+
Ba3#
-46.82]
Qba4+
Qgxc5
d2
-108.41]
R8a6
Qhxc1#
Rhc7??
-71.04]
Rfc1+??
-69.86]
Q4a7
Rgc8+?!
-62.64]
Ndc5#
bxc1=R?
Qgc2
Nb4?!
Q3e3+
Rdxa2?
-31.46]
Qdxc4+?!
Rhb5?!
Ngxh6?
Rfa6??
-78.89]
-59.7]
Raxa6?
Qf1+?
exd7?!
Rxd2#
Rxh4??
-58.72]
Q1xa2+?!
Qhxb3+
Bxc5+
R2a7?!
N2a3
Qxb7#
Rhxf2?!
Ndxf2+
R8xf5?!
-96.81]
Nf5#
Nfxh3+?!
R2c3?
Bd8+?
Rda6+
Nxf5?
Nexf8?
Rexd7+
Ncd4+?
Qch4#
-52.39]
N1xg2
-56.2]
R2xf5?
-50.73]
Rfxf4+
Qcf6+?!
Qdc5+?!
N6xe4+?
-76.81]
Qcd7
Qaxg4
Rbxc6+?!
Qd4+??
Bc5+??
Qeh3?!
-8.38]
Nbc2?!
Qdxe3
Ndxc8??
-46.28]
Ba3??
c8=B+
Nxd4+
-93.68]
N7xb6+
Qhd3#
-64.91]
-70.08]
-51.61]
Bd4+?!
Q5e6+?!
Rfxf2??
Qde2+?!
-7.05]
Rhxe8
-23.11]
Rxd3#
R2g7+?!
Nb2+
Qexc3+
R6b4?
-2.51]
R1xb6+
R1h2+?!
Rgd8?!
Nexf3?
-94.53]
Red4+
Ra1+?!
R2e7+
N7b5
-31.13]
R5a6?!
-100.41]
Nexg4??
Rdb4??
Ngxf4+?!
Ne8
-24.02]
N5f6+?!
b1=N+??
Rbxe2+??
-35.52]
Rhxg2
Raxf3
Nfxg2
N4a6?
-3.12]
N3xd5
Bc8+
R4xa3+?!
Rbxf4?
Qaa6?!
-91.72]
-4.82]
Qxe7
Qad5
Rdh2?
R3e4
Rfxg5#
Nac5#
Rfd7+?!
Raxc3+
-58.85]
Ngxe3+?
a4+
Qgc4#
Nec7+
-97.29]
Nhxf6?
N7f5??
Qexg1#
R1a4+?!
Q1g3#
Bc2+
-17.1]
N7xg6?!
Qae8#
Qff4+?!
R1a4?
-55.17]
Rhxg7+
R8xh5?!
Q2d4
-65.19]
N6e5+?
Qd1?
Rhxa7+
h8=Q?
Rdxc6?
Rcg3+?!
Rf7
Rxe1??
Qgg3?!
h1=N?!
-25.6]
R1c6+??
Qcxa3+
Ndc5
Qd3+?
Rb6?
Rgf4+?
Qdxf4+
R5xd4+?!
Rhb5+?!
Bd8+?!
Nxe1+?!
Rgc4?
Rge2?!
Rad8#
fxe7
Q7e7
Rexc8?
hxg6#
-29.0]
-43.55]
-14.02]
Qexe5+
Nxg5??
Raa4?
Ree3?
Nef1?
Rf3?
Nxf3??
-9.67]
-105.36]
Rfg3??
-18.11]
-120.77]
-43.88]
-4.01]
R1f7+?
dxc5??
N5xd3?
bxc2+?!
Q2xe5
-45.6]
Q4xf6#
-43.99]
R3g5+
-49.12]
R4c6
Q3b3
cxd5
Rhc8?!
Ba8
Rc5+?
Rxh7+??
Qdb8?!
dxc2?
R3d6??
Qbxf8+
Q3xf4+
R4xa5+
Rea8
-17.58]
Q1xa2
-16.28]
Qcxe1#
Q8xe7#
a1=N?!
Rhxd3?
Ra4+
Rdc2??
-69.96]
-111.65]
R1f4?
Kxb5?
g8=R#
c8=Q+??
d8=B#
Q6b5#
-49.96]
Qaxa7#
Kxc1
-54.22]
N8xg6
Qexf8
Q2xb3+
R8b7?!
R2g4?!
Raf8+??
-42.46]
-18.43]
-77.33]
-73.1]
Q4e2+
-21.94]
Rfc8+??
-56.58]
f5?!
-72.7]
Rxe8+
Qfxc8#
R2xb3#
Rff3+
-56.26]
Bxa3?!
Rcxf2??
-67.72]
Raxh5#
Rhxe2+??
-108.35]
R8xe6+
Rxe6?
Raf7?
-1.92]
exd3+?!
-53.1]
-5.67]
Bxe1?
-13.07]
Nhf1+
Qdc4+?!
Q7xe7?!
-110.75]
-111.6]
Kxb2+
-44.5]
-113.17]
-107.53]
Rcxh7
Qxe7+??
Qhxf6?!
Q8h7+
a1=R#
-105.49]
Rae7?
-18.34]
-63.22]
-64.2]
R8xh4+
Qb5??
-4.03]
gxf8=Q?
Qfxe3#
Q4c4+
-46.59]
-37.85]
Qhb7
Bb6?
-41.34]
Kb6+??
-36.39]
Q6d3+?!
Rexa6
R6xc5?!
Qbxa2
Rbxb3+
exf8=Q+?!
-30.98]
Ncxe4+?
Raxa7
Qbxe5+
-41.4]
-103.2]
Rxc6+??
Qeh3+?!
Qfxe7#
Qaxh1
Nxf7??
Raf5+??
-76.27]
Q7d3
Bxg1+
-112.14]
Rexg6#
Qh3+?!
Nef3#
Rbe3?
Raxc4?!
Rbxg2+?!
Kxg2?!
Rgc1??
-40.75]
-25.46]
-102.13]
Nxb6+
Q8xh6+
-59.8]
Nexd8
gxf4+?
gxf2+?
Kxh2?!
R7xh5
Rxa7?!
Neg6?!
-64.01]
-71.94]
Rbh1?!
-21.9]
-119.06]
Qxf4?!
-110.61]
-47.35]
Rxf5??
Ke5+
Qg4#
Rbxb2+
-50.36]
Qgd7+?!
-10.05]
Rfe8?
Qgb2
Rxg7??
Q5xe4
-40.46]
Rbc3
Qgc5+?!
R2e5+??
R7xf6+
Rfxd8??
Q2d6+
-40.74]
R2a3+?!
-61.0]
h1=Q+??
-101.3]
Q8f3
Q1d5#
-40.78]
Qxg6#
R4d3
Rae6
Ncxb1
-41.11]
-49.95]
gxh8=N
Rxe2+?
Rbd3?
-68.95]
Q4a2
gxf1=Q+
Rfe4+??
Qbd8+?!
Kxg2+
R4c2#
-63.45]
Bxe8?!
Rad8
Qec1+
Qgxd8+
cxb7+
Qxe3?!
Rexb8+
Qha5#
Ngxf5+
R4h3?!
Qxg5+?
-17.21]
Ndf2?!
bxc6+?!
Qexg4#
-59.04]
R3h5+
Qec8+?!
Qgxb6+
Ncxd2?
Q4xe3#
Rgxg7?
Nfxd4+??
Rexh1
h8=N+?!
-15.47]
-117.78]
N3xe5?
Qb1?!
-8.42]
-78.38]
Qcxd5?!
Rcc8+
N4d6+
Ncxb2??
-64.94]
Rhb3+?!
-15.99]
R3xd4?
Nbd3+??
R6xh3
Q1g5+
-7.46]
Qa2?!
Nxg4+??
Qexd4+?!
gxf1=N
Rba8?!
Nxf4+??
Rbe3+
Qff6?!
Ned6+?
-113.93]
N5b6??
Q6xd4
Qhe7
R6g5?
R1f3?
-18.3]
-83.1]
Q8g7
Kg6+?!
Rgxf2#
-8.96]
-73.66]
g1=N+??
Nab5
R8h4?
Q8xg7+
Qcf6+
-82.06]
Rexb6
Rfxb7
R1xa7+
Qeb8+
Qfg6+?!
Rdf7?!
Nef7+?
fxg5+?!
Nxf8?!
Rea7?!
Rexe5??
Bxh5+?
R6c7?!
Bxe8#
Rcb4+
-59.97]
-1.24]
Q3e4?!
Bxf1+??
f1=R
Qhxh4#
N1f3??
R2xf3??
Qee4
Reg8??
Qhf4+?!
Q8xf3
R5f4
Ndxc6??
Bxg1
-84.85]
Rfxf2?!
R8b2??
-20.71]
Nce1?!
-40.25]
Q8e6#
Qef7??
Re4#
N4xh3+
R8d3+??
-90.88]
-36.69]
-112.44]
Qhxg5#
Rxb3?
-40.13]
R3xd7??
-13.39]
Qcg5
Q8xa8
-97.97]
R1a2??
Nd5+?
Rfxf2+??
Rbxc3+?!
Q7c7+
Nxb5?!
Bb8#
-9.82]
-4.8]
Kc8
R5g6??
-61.2]
Rab6+??
-15.45]
Rcxd7+??
Re2+?
-25.71]
-74.38]
Kxa6?
Rxb2
-47.09]
-35.86]
Qac6?!
-27.86]
Rhxb7+
R1h7+?
Rgxe5+?!
Ndc1
Rbxb6+?
Rxa5#
-37.55]
-73.98]
Bb8+?
Nxe5??
-80.66]
Nxc5+?
N6xc4?
Rf6
Qh5
Rgxg4??
Red7+
Rf7+
Rcxd1??
Rce8+??
Rfxg1
Rxc2#
Ncxa7
Ndxf7?
Rhxd8?!
Bde6+
-25.81]
Qbxb2?!
-30.13]
-7.76]
-54.9]
-117.61]
Rfa1?
-47.24]
Ncb3+?!
N5xb6+
Ncxd6??
Rhd6?
R8b5+??
h7??
exd3??
Rga4?
R5h7#
R3xh2
Rc2+??
N3d5+?!
-86.31]
-109.0]
-122.09]
-90.36]
-54.36]
Rbxc2+??
N4e6
-66.86]
-13.53]
Nxf4??
Q3g2
Q3e4#
-27.65]
R1xa5?!
Qde4
h1=N
R4xe5?
Q3xh7+
Rhxd4+
Q3f5+
R6xe3
-65.72]
-25.14]
R3c5
Nxb1+?!
fxg7??
b5?!
gxf6+
R2b7
dxe8=N
Kxf1?
-12.1]
Rbf2?!
R3h4?
g7+?
-61.95]
N5h3?!
-52.22]
Ra8??
Q1e4+
Rbg3+
Qfg8#
Rg2?!
-98.86]
Rfe3+?
Qfa7#
Qhd5?!
-28.4]
R6e3+
Rgxg1
Bd8??
Ngxf3+
Qac2
R8xa4??
Ngf5
R8d4?
Nef7+
bxc2??
Rge7?!
-70.49]
b8=N?
-106.2]
R2g5+?
Qg7?
Qxd6
Rab5?!
Q3xh4+
Rcxh3
-72.2]
Qba8#
-83.55]
-53.5]
Nd6#
Rhd7+
-87.54]
Q8d2#
N2xh3?
Q4f1+
Qdh8#
Qfb4
b1=R?
-18.93]
Nxa4
N5xc6?
dxe8=R+
R1xh5?
-5.71]
Q1f2+
Qc1+
Q6d3#
Rfd7?!
Qgxh3#
-111.98]
-17.48]
Nec4?
-107.16]
Rexf4+
Rdxd8??
Nxa1
-27.91]
Qdxd3?!
Ba4+?!
Qhxh2
-49.02]
Qah1+
Qaxg7#
Qbxd3?!
-54.11]
N3f5?!
Kb1
Qbxd2+
Kxa2?!
N2g3?!
Qaxd8#
R3h7??
Rgd4?!
N6a5?!
R1xb7
Rc3?
R2g5#
R4b7#
-39.2]
Kf6#
Raxg1#
Rhxf6?
Bf3
Reh2?
Rhxf7?!
Bxf3+?
Rhxh3?
-23.49]
-42.08]
Rhf7+
Qcxe8+
-55.95]
Rgxf3??
Rba8
Qaxf7+
Qxc3??
Nexg5+
Kxh5
-60.13]
R3a5?
-67.53]
-64.78]
Qcf1#
Q1xf2#
-111.58]
N6a5?
Rfe4#
Rexf5+??
Rdb7?
Ncd8??
-101.11]
Nhxg2?!
Q6f7?!
R6d2+
Reg6
Q4f8+
Rxa5?
-24.7]
Rch4
Rdg7??
R4h2+?!
-47.26]
Rcxa3
-26.26]
-16.07]
R7xc5+
Nd8?
R7b6+??
Q1b5#
Q5f7#
Red2+
-28.86]
Qdd6??
Rcb8?
Bxa4??
Rgxf1
R4c2?
Nd8+
Ncxb7??
R2xd3+
Rbxd3#
Qxa3+
Rfd4??
Rg4?!
Ndc1?
-11.08]
Rxh5+??
Rh7+?
Qcxf6
-110.38]
Rbc5??
R1xb3?!
Rac4+?!
Q3e5+
Qhxf6+
-8.62]
-113.04]
-19.59]
Kd8
Qxh6
Q4xg4+
cxd2#
Nhxg7?
R7xd6??
R7xd6+
R2d4+?
Qdxc4+
Qae3
Rgc3?
-21.33]
R3g7?!
Rdf3?!
R1h5+?!
R1h7?
R5h6+??
Rgxf7??
Raf5+?
Qaxf6+
Qcc3?!
R5d7+
Neg5?!
Qxh8??
Q3xd4+?!
-107.57]
Rbxc5+
gxf7??
Rcxb3
-85.51]
Qdxd4?
-26.2]
Q1f2#
Q8xd2+
Qdxa3
Rec6
N7g6??
-56.6]
cxd2+
Rxd2+??
-22.1]
R6xc4
Rexh2?!
e6+?!
Kxe5??
-94.07]
Qag3
-94.94]
-63.71]
Rexe8+
-18.35]
Q8f8+
Neg4?!
Rgxd5+
-66.25]
Rxd6+?
-109.22]
Rcg2+
N3f5?
R3d7#
Qhxd4
Q3f8
Rxg5??
-3.14]
Rxb1+
Kh8??
d1=Q
N1f2?!
-6.94]
Q1c1?!
f4?!
-94.93]
g6
Nh3+??
Rxg2
-49.74]
Rfg5#
Rgxe3?
Kb2?!
R6g7+
-89.61]
Qg1+?!
Nhxg3+?!
Rb5??
Qbh1#
R2xd7
Rb3+?
g1=R#
-58.36]
Rag2+?
Q7d2+
-71.81]
R1xb3+
Rab6?!
Kxg1+
-99.68]
Qg4+
Red1#
N6a4
Nab8?!
-77.3]
Qhxh1#
Rhxf4?!
-60.66]
Qeh8#
-69.04]
-3.53]
Nxb6?!
Q8xd7+
Kxc7?!
Rbb2
-5.17]
R7xd5?
-66.46]
Q2f1#
R4xe7?!
Nexf7
Qdf5#
Q7d8?!
Rca2?!
-119.82]
-119.55]
-114.94]
Rad6+
Qcc4+?!
Rah4
Kxc3??
-31.63]
-61.6]
Rfh2?
R6xe4?!
-12.88]
Bxe5+?!
-11.54]
Rda3+??
Q3c4
R8xc5??
Ra3??
Nxa8#
Rdg3
-120.02]
-33.29]
R4xh6+
Rexd8?!
Qh5+?
-10.43]
Nxh1+??
Qgxa1+
Raxd7??
Ndc2+
Qch6
Naxb3?
-49.51]
Rexg7+?
Qfe2+
-108.07]
Nxc3??
-67.65]
Rhf8+
Q1c6??
Nexd4?!
-36.1]
-109.65]
Qxf7+?
Q4b2+?!
-86.24]
Nca6?!
Qde7#
Nca2
R6e2+?!
Reh7
Ne4??
R2xd5+
Rb6+?
Nxe7#
Rga7?
-43.85]
Rfd3+
Kh4?
-105.83]
Kxc5?
-69.51]
Rbb2?
c1=B+?!
Qxc6+
R2c3+?
Qcxh3
Nfh6+?!
Kxa4??
Ngf2#
R2e7?
-63.38]
-51.97]
R4f2?
-73.57]
R2xc5
Rexc2?
R3d7?!
Qg8+?
R8c3+
Rxa5+
Nc2+
R2e6?
-108.83]
N6f5??
N7e6
-100.08]
-66.92]
Qhf8
Rxd8?!
Rexh2
exf5+
-58.87]
R1d2+?
-84.3]
Rhxd7?!
-20.66]
Nexg6+??
g2?!
-25.1]
Kb5?!
N5g4+
R4h3#
-41.96]
Rbc1+??
-21.07]
Qgg1+
Rexc2+??
-52.01]
exd1=Q?
Kxb3??
Raa7
Rfxb4
-105.84]
Be5??
Qbxb4+?!
-23.99]
Rfh5??
-117.32]
Rdc3??
Nexf2#
#39]
Qfxh3
Nh4
Bxf2#
Ngf4+
-118.26]
-10.39]
Q5g1#
Rc7?
Nbxd3
Qgh2+
Nhf8+
-60.33]
N4f5+?!
Nde1+
dxe2??
Nxe6+?!
Rgxf8
Q6d5+
-29.99]
Qh6g7#
Qcc2+?!
exf7#
Nfe8?!
-20.92]
-111.34]
-54.35]
R6h7?!
-56.25]
-1.55]
-56.59]
Rhd6+??
Rce5??
-35.11]
-82.7]
Rdxf7#
Ndc5+??
Raxe7+?!
R3xd4+?!
R4e7#
Rfxe1+??
-1.65]
Qdxe1+
-107.19]
Q4a2#
fxe8=Q+
-24.35]
hxg3#
R2a5?
R2f7??
R2b4
Kxa5?!
-2.41]
-113.14]
R1b2+??
Qxd4#
b1=N
R4c5??
Rgxg6
Ndxf2+?
Rxb2+?
R8xf3+
Qec2
Rcf2+?!
Qh7?
Q4h5+
g1=N?!
Rfa3
Bef6
Q4c3
R6f4?!
-52.88]
Raxh4
Rfd7??
Q5xc6
Qf7+?
Nfxg3
Rgf5?!
-43.93]
Rexc5+
Rhc6
-50.96]
Q8h2+
R4xd3+
R3e4?
-25.63]
Qdd7#
Rdxa3#
-69.77]
-8.25]
-123.18]
Na2+?
Qbxd8+
g3?
Rac2?
Nfg4+??
-63.57]
Qch4+
Qaxa5#
-75.32]
-121.42]
N4xe5??
Kb2#
R2xd7?
-63.65]
-111.53]
-62.99]
Nhxf7+?!
Rxa5+?
Ncxb3+??
Ndxf4#
-103.11]
Rdb5#
R1h7+
Rae4?
Rfh1?
R7e5+?!
-51.07]
-46.54]
N7xf6??
Ndf7+?
Rfxc7??
N5f6?!
R1xb5?!
Bb7#
Ncxb5?!
-121.31]
Q4xf3#
Ba1?
Rcc1?
Qaxa5+
Raxa2?
Naxc5?
Rde8+??
Rgxd7?
Kxh1?
-110.89]
Rxb3+?
-53.41]
Nfxd6+??
N4f6
R1g7+?!
Na8+
Rhg3+??
Ka4+?
Kg1+?
Q6g6#
Kf7+
Rbxc3#
Rce1+??
-36.53]
Q3c3+?!
Qag7
Qfh8#
Qhd2#
bxa7+?!
N6b5?!
-8.59]
R6e5+??
R3xe5?!
fxg1=Q+?!
Ng8+?!
-50.41]
Ref7
-122.48]
Qdh1+
-89.43]
R5e7?!
-26.58]
N5d4?
Neg4#
Qea6
-22.34]
Rh6+?
cxb1=N+
Qf8e7
R2a6#
Nfxd5
Ncd7?
-10.44]
Nfxe2+?!
Qhxg4??
Rcxb7+?!
R7b3?!
Rxh6+?!
Nxf7?!
-58.75]
Nxf7+?!
Ngxe3??
Rhxc4
-50.85]
Rfb1#
-63.54]
-61.18]
Nab1+
Qxg7??
Nfe6??
Q8xa6
Ndf3+
Rbf6?
Rdb1??
R7d6+?!
Qec4
N4f3+
Q6d5?!
-17.83]
dxc8=Q+?
-10.52]
Rfxg5+
-57.73]
Qgc4
Qexd5
Qdxe8?!
Qfxb2#
Nhg4+?
Raxb1??
Qf5+?
Rff4
dxe2#
-8.4]
R6g2
-26.23]
R1b4+
d8=N+??
Bxh1
Nge7#
R1h6+?!
-57.5]
-3.21]
R7c4+?
-74.16]
-108.66]
Rcg1?!
R8g3?
N2d4?
R6g3?!
d8=Q?!
Qxe2+
-59.87]
Q6xd5
Qaxa3#
-122.13]
Rfxb2+
Nc4?!
-24.22]
Bc8+?
Rbd5
N3c4
Bc2??
e4+?!
Qaxc8#
Q6d3+
Q8e7
Qhh7#
-0.1]
R1c3?!
R6g4
Ndf2+?
Nxg6?
-46.41]
-56.93]
Qcxg8#
-68.2]
Kxh7?!
gxf4+??
R5e2?!
-20.18]
Q6e6
Kg4+
-6.96]
Rhd3?
Nexd5??
Ndc4?!
-66.57]
-43.06]
-33.49]
Rd1??
Qexf1?!
-21.08]
-89.47]
g1=B+??
Qbc2
Qgc8+?!
R7e4+?!
Qaxh7#
Kb2?
cxd1=Q+?!
Rff6?
Rgxd2
N4xc3
-2.5]
Qgb3+
Rgg6?
Rexe7+?!
-18.73]
-52.42]
-57.37]
Q6g7
Ncb4+?
Q7xg7#
-4.23]
N8h6
Qda8+?!
R1h6#
R8xf5
-11.36]
-104.43]
-101.85]
-36.93]
R3e7+??
Rxe5?
N2e3?!
Qgf2#
Rcxf6#
Rdxd2+
Qdf3#
Rad8+?!
Raxe1??
Rhxh3
Ncb1?!
Qbxd3#
Raxa7+?!
R4c5?
-49.98]
Nba2+?
Rbxb5??
-123.3]
-44.32]
Qfb2+
-18.94]
-48.39]
Rxe1
Rdd4?
R2e7?!
-6.8]
R7xc6
Q3h3+?!
-62.46]
Ng7??
-98.56]
Qfb8+?!
Kh3+??
Rhd2+?!
Qab3?!
R3e6?
Rh5?!
R8f5+?
Red1+?!
dxe2?
Rcxe6??
Qbc6
R5a3?!
R5b6
Rfd3+??
Q8xg7?!
Qcc6?!
Qag1+?!
Qfe4#
Qxb2+?!
-18.29]
-46.89]
Rgxe6+?!
Qaxc2#
Qxb4?
Kg4?!
Rbh7
Nxf5+?!
Rgb1??
N4e6+
Nce4+??
-0.75]
-42.39]
cxb1=N?
Qb5#
-45.53]
gxf8=Q+
Qgd8#
axb5+
Qexg1
R2h6+
R2xe4?
-107.96]
Ref8?!
R2xa6+
Qcg6#
Qdxg5
Rdxb7+??
e2+
fxe1=R??
-45.32]
-120.01]
R5xc2?!
Qbc5#
-52.08]
-55.67]
Rexf8?
Qxf8+?
Qed1#
-20.41]
N3f4?!
Q2f4#
Rgg8??
-0.48]
-31.33]
Qdxh4+
Qf5?!
N8c7?
Nf1?
-51.76]
Rxc8??
-44.69]
N6f4??
R6g5+?!
Qe8#
Qd1
-23.5]
-46.16]
Nxg8#
Qhxe5
-13.71]
Rdxg6#
Qae2#
-109.62]
-42.53]
Nxb5+?
-36.37]
Rxb4+
Rcxc4+??
Q6g4+
-47.15]
Rhxe3?
Qab4
-57.72]
R7c4#
Rbe2
Raxf3?!
Nfe2
Rff1
-26.55]
-16.82]
Q8f7+
-5.52]
R3d7
Q4b2#
Rxa1+??
Rfc3?
-11.72]
Reb8??
Rhxg3+?!
Qdxb3+?!
Raf4?!
Rbxg2+
-37.67]
-17.57]
exf8=R+??
-118.48]
Q8b7#
Qfd3#
Nxf2+??
N3e5+
Rxa4
Qcxe3#
Rgxh3+?!
Q8c6#
Rfxg8#
R6xb2+
Qfa5+
Qgc5#
Q2xh7
R7xg4+
Bxg1+??
Nxd4?
Q5a4+
Q5b5+
Nh3?
-98.21]
Rdxc2
d5+?
fxe3+??
R7g3#
R6c4
Qc1+??
-68.68]
h1=Q??
Raxc3#
Rf5#
Qea8+?!
Rf7+?
-37.41]
-15.4]
exd8=Q#
-92.13]
Reg6+
Ncb6+
-108.18]
Raxb8?
-68.72]
N1xe2
-17.39]
Rdxh6+
-9.83]
-120.21]
-82.3]
N8f7+
Rfxa3
Qah7#
-44.43]
Bxe8??
N6b4?
-0.38]
Qexb3??
Kd6??
Ng1?!
Rgxf6?!
R2f7+??
-113.64]
Qaf3+
e1=Q+?!
Qaa7#
R4c5+?
Q7f7+
Rdh7?!
Nxe2+?
R4a2
Bc3#
Qxe2??
Bd5+
Rcc8
-33.09]
-73.89]
Ncxe4+?!
Ref5??
Q1e4
Ndxc3?!
bxc1=Q?
-86.2]
Q7e8+
Qef4#
Bdc6
Red1?
N8b7?
d6+?
Qh4+?
Nb1?!
Neg7?!
bxa1=Q+?!
Nhf2??
Nxe7?!
Rhd2#
-110.73]
N4xc3?!
-70.95]
Nfe1?
-61.26]
Rhxc1?
Rae1+
-35.89]
Kh1?
-4.52]
Rdxa2
Rbc8+??
-116.6]
-86.81]
N6c4?
-3.78]
Qda7#
R3xh4+
Bcb7
-3.2]
Rcxb8#
-50.23]
-111.44]
-11.6]
R4xh3
R7a5?!
Rff8
Rfd8
Rexd3??
Raxh3?!
R7e5+?
Q6xa4+
-79.42]
R3xf6+
N6xa4
Qda7+?!
-0.45]
-18.05]
Nfg4
Raa8?
N5f4
-68.1]
Qhxf2+
-72.91]
Qcb5+?!
-4.96]
Qbxe3#
Ncxe5+?!
N2xe4+
-33.2]
-64.53]
R2d4+?!
R6e3#
Qcxe7
c8=Q?
Qbxb8+
-110.52]
-7.96]
-23.21]
Rexg5+?!
Qbxc8#
-27.37]
-50.01]
Qgc2+?!
Naxc4+??
Qdxg7+
Qhf3+
Rcxf7?!
-23.08]
R8a3?!
Rca2
Qcd1+?!
-14.33]
R8h5#
Neg6+
Nhf2
N4g3+
-121.8]
-74.7]
Ngf2+
Qha1?!
-39.75]
-49.4]
Q4b6+
-69.93]
Bxb8+
-68.65]
-52.94]
-7.06]
Q7d4+
-30.28]
Ndc7+?!
Rad6??
-4.24]
d3??
-65.56]
Bxh8+??
Ref6+??
-17.22]
-113.55]
Qhh5#
Rdxb7
Ke8?!
-112.81]
Q1xd1+
-120.71]
Rcxg7+
Q5xh7
-113.49]
Rbxc3?!
-63.39]
Q4xe2
Neg5
Nxg8?!
Rcxh6+
Rac2??
Rcd5??
-43.29]
Rfe8+?
d8=Q??
Rbb4
-120.11]
-37.19]
Qgg5+?!
Q3h2+
Q3g3+?!
Rgxh6
Nxb8+?!
-112.53]
Rea7?
Qe6+
Qcf6
N8c7+
Nxb7?
Rbxa6?!
b1=R
Nbxd4?!
Rbb5?!
R1xh2
-33.19]
Rhf4?
b7#
R8xf5??
Nxh2+
Qxa5#
N8a7??
R5xf4
Qef1+
Nac5+?!
-62.95]
Rad2+
Rxg6+??
-42.07]
exf8=Q+?
Rhxe4??
Ndxe1
Nd7+
Rge5??
Nc1
R8e5#
Nde4??
R5h7
Rbe8#
Rxg1+?!
Qd1+??
Qca5#
-107.36]
Rexc2#
Qba8
Qch2
R3c2??
Nfh7??
d1=N?!
Q8xf5+
Kxf3??
Neg6?
R1d7
Qeh6#
-83.83]
Qdxh5
-43.83]
h1=B
Rgxa8
R4b6?!
Bxg7+
-13.31]
Raxd8?
h1=R
-69.07]
-24.54]
Rcxe2+
Qae4+
Rbxd1+
R3g7
Qh6??
Ne1+?!
-66.94]
Q6h4#
Nge8?
R4b2+??
Rdg1?
-51.95]
dxe8=Q??
Ngh3??
Rdb4?
-69.13]
-110.88]
-10.91]
Rdf3#
Rcxb1+
-3.96]
b1=B?!
Qaf6
Be8?
-40.4]
-37.86]
Red3?
Ncd3+?
Rhg3+?!
Re2+
Kxd5??
R7c5
R6d4#
Qeb1
-47.93]
R3d2?!
-116.41]
Q6c5+
-6.69]
Ndf6+
Kxd2
-69.85]
-114.18]
Bxg8+
Q4xe6+
-106.84]
Ndxc7??
N4f5?!
-90.47]
-9.69]
Ncd6+?!
Nxh6+?!
Rexe6
Qf6??
R7b4+
Qhd3+??
Nh5?!
-7.51]
-70.37]
Ngf2
f6?!
Rbf1+
Bxa8?!
R8e4
Rgxb8??
Qaxb1
Qcxb1
Rdg5+??
R4h7+??
-50.38]
Qxh4+?!
Rh6?
-10.58]
Q4f2#
-40.62]
Rfg8#
R5xc4#
-62.57]
R8c5?
Rbc6
Qbd7?!
Qfg6?!
Q4e2
R5xf4+
Rc7??
Rexg3+
Qee6+
Qxb3?
Rac6??
Nfxe6#
#4]
Ka4??
Qdc8+
Rbg7?!
Qe1?!
Kc2+??
Qgxc5+?!
N5xf4?
Rhb2#
-66.82]
Nxh5??
Rcxb5+
R4a6+
Rha1?
Rxc4?
Bxc2+
Bxe6#
N5f4+
Rff6?!
-32.81]
Q5xd3
Q6e3
Q5f3#
R4c5+
N5a4??
-29.31]
Kxf3+
Qxe7+?!
-102.61]
Raxf7?!
Qfxg5
N7xf6+
-68.12]
Rgxd3?!
N7e5?
Q3xh4#
Q4xe3
Qhg7+
-66.72]
Nge3+?
N6xf5?!
Rde7#
Re2+??
R5xh7
Rcxh3+
-54.44]
Qfe3+
Rhg1??
Qhg5#
N4a3
R5d3+
Qdxf3#
-57.75]
Q4xc7+
Nxe7??
Qexb5+
Rhg1#
Q1xc2#
Ba8?
-36.86]
axb1=Q#
-30.47]
Qdc6#
-4.66]
-32.06]
Ndb7?
Q7e5#
-39.39]
Rdxf3?
Rc8+?
Qxb2#
-72.43]
R7c5#
-39.18]
-12.22]
-113.99]
-35.64]
Rca4?!
-25.9]
Qhf8+?!
-17.18]
Ncb7?!
Rhxd6+?!
axb1=N?!
Rde8?
N7d6??
Rfg6??
Rxe8?!
Rf6??
-28.0]
Rdh8?
Rexb4??
-94.64]
-24.47]
-34.48]
-118.25]
Qbh3+
e1=R#
N3h4+?
-121.27]
hxg4??
-25.29]
-27.03]
-47.74]
Kxd7?!
Ka8?
Nb7?
Nde5?
Q8xb4+
Q5xh8#
-33.96]
Q2d3#
-28.15]
-35.57]
Qdf3+
-51.9]
R8g5
R5d2?!
-70.26]
-91.75]
-49.28]
Q3xb7
-9.54]
Ndb1?
Rxe8#
R8g6
-54.6]
Qcxg7+
-47.17]
R8h4+?
Qxd7+??
Nhxf3+??
Raf1+
-81.96]
Rhh7?!
R1xd6#
R1xd5?
Qa7#
Qxh2
Bxa7#
N8xe7
Nxh2+?
Rbc2
R8e7
-13.91]
-94.89]
Rgxf2?!
-62.07]
-36.81]
Rad7?!
b8=Q#
Qea6#
a1=R+?!
Kxa3?
Qfxc3+
N8b6?!
R8xd6??
Q6xd4+
Na2??
Nexd6+
Nxc1
R4g5?!
Raxa3+
Qbxb6#
Rbc2+?
Be7+?!
-42.92]
-46.72]
Rhxc7+
Rgd2??
Q2d2#
Rgf6
Q8h6+
R8xb4?!
N3a4?
Qde2
Q2xc7#
N4g3??
Rbg5?
Qxd5+?
-57.29]
-89.67]
Nhf4?!
Ngxe3
Rdc5?
Qg7+?!
Qgxb2+
Rxe6??
Qxb6?
Rcxe3
Raxf4+?
-56.05]
-59.84]
N8f6?
-35.76]
d8=R?!
-60.71]
Rbc6+
Qcxb7??
Rha2??
Rbe6?!
Qcb6#
Nfe1?!
Q4e8+?!
-63.97]
Bef5
Qhc8+
dxe8=R#
-116.39]
-44.99]
Qbc2+?!
-36.79]
R6f3+?
Qgf2
Qexb5
R3xg5
Bxh8
Rexe3??
-20.15]
N7f6?
-15.77]
-35.37]
Qhc3
R6b7+
dxc6??
-37.89]
-15.6]
Qeg1+
exf5??
R2xg7+
Rbxh2+
Rbxa6??
Qbxd3
N6b7
-60.36]
Qdxd5#
Rfxg1+
-68.48]
R4d5+?!
Qxc3+?!
R8xb2+
Ke7?!
Nexf3#
Nfxd5?!
Qgxf2+?!
-67.56]
R6e3+?
Nf2??
Nxe4?!
R6e3??
-68.21]
Qxb6
Qhh5
Qcg6
N3xc2??
Q7g2+
-63.86]
R7xf6??
-46.85]
axb4?!
N8xd6?
-4.56]
-110.33]
-30.48]
N4xe5?!
Nef1#
-28.66]
Qa4
cxd2??
Rhc5#
-36.68]
-58.73]
Qhxb6
Qxe8#
Rdxe4?!
Qfxd4#
d3?
Rde4+?!
-26.85]
-14.75]
-76.73]
-39.52]
Qcxc3+
Rhxh6??
R2d3?!
Nd7+?!
Ngh6#
Rexe8+?!
Rba6??
Kb8+?!
Ra5+??
R4c7#
Rdxg4#
-12.3]
-58.01]
-78.28]
-18.51]
-88.98]
Nxa3?
Rxa6#
Rxa8?
Qh1#
Raxd6??
Rhxg2+?!
Qgxc4
-74.44]
R8b4?!
Bxc5?!
N7xb5+
Qa3+?
Qf1+??
-9.23]
Rfxe4+
-17.75]
-121.6]
#30]
cxb4
-20.05]
-35.48]
R3xe5+
N2c4??
R4e7
Q6xa5
R7xa6?
Rdc3
Bfc5
-68.36]
Rhxc1#
Qd7+?
-14.68]
Rha6
-112.42]
Nfxh7?!
-23.87]
Ngh3+?
-59.34]
Ree6+
Rec7??
-34.76]
R7xa6
-50.5]
Q8g4#
Qexf4+?!
-63.05]
Nbxc4+?
R2e7#
Rh1#
Ne7?!
Q2f7
N7e5+?
-5.28]
c1=N+??
Ndxc7+
Rcd2
-62.97]
Q5c3?!
-22.43]
Rcd2+?!
-121.63]
-4.65]
Nf2#
exd4#
Raf3??
Kxg1?!
-105.45]
Qb8+?
a8=B+?!
Rhxd8+
-57.09]
-45.35]
Rdxc7+??
-15.95]
Ncb7
Nexc7?
Q1a4?!
R6b5+??
R3xc5??
N2a4
R8xh4?!
Qhxd1#
Raxd1+?!
Rbxe2?
-40.09]
Bxc8+?
Qbf5#
Rgxh4+
Rge2+??
R2xd3??
dxe8=Q+
Q3h5#
-37.77]
Qxf3?!
Qcd2
Bc8??
-35.41]
Qg7+?
Q7b2+
Rfxe4#
Bce5
Kc6+?
Rgxa3
-40.97]
-69.45]
Rxa2??
Rce7
-59.24]
-5.68]
-59.92]
-110.63]
-46.56]
Rgg4?
Kxa2??
Qbxh7#
-109.85]
Rfc2+
N2xc3
Reg5
Qb2+?
-46.06]
-59.13]
-51.58]
-28.84]
Ra6?
Rge6?!
Qdxh7+?!
Nxd2+??
Qg2??
Rae2+?!
R1e4#
-102.84]
Be3+?!
-42.02]
Naxc5?!
R5xd6?!
Rgxa6
Q7h4+?!
-47.07]
Qexe3+?!
gxf6?
-7.16]
a8=Q#
Rf4
-11.35]
-9.75]
-47.31]
Rgg2?
R1xa7
-69.29]
Rexa7+
Rexh6+??
d4+??
-110.29]
Rce8
R1h6+??
-33.58]
Qca8
Rfa8??
Neg4+?!
-17.06]
N6e4?!
Qxg5+??
Rexc2+
Qgg3#
Nxd5
R6xf5#
Qdb8??
-45.72]
-30.49]
-37.42]
g6+?
bxc2
Rah2?
Nxh2
-63.01]
Rcxh7?!
-50.95]
Rfe6?
-69.43]
e5?
-39.3]
fxg1=N+
Nxb1#
Rba2??
-88.48]
Qxd2?!
Rah3?
-26.74]
-30.21]
Q4d6#
gxf4?!
Bxg7#
Q8c8#
-43.41]
Nab3?
Rxc4+?!
R3h5??
N4b3+?!
Qfe6#
-55.68]
-13.74]
Q7b5+
-57.23]
Kxb6?
-88.8]
R1e3
R8e5
N6xf4+
Qfb3?!
N8e7?!
-107.18]
Rfb6?
Bd8+??
R8d6+
Qhc4+??
R4e6#
Q7b6#
-22.71]
R7h6+??
-32.3]
Rbb1??
Qfg2
R3g6+
Rgxe7#
Q1xd7+
-66.07]
-123.65]
Ka5+
Qbxe6
N7xb6?!
-58.6]
-54.71]
axb6
R4xb5
-72.77]
Q3h7#
R1c5??
Rexa5?!
-106.51]
Rfe6+?
Qfc1+?!
Nxf5+??
Q8xh4+
Raxe7+
R8xb5+
-60.12]
Q4f5+
-78.8]
Rbd1?!
R8e6
Nbd8?
Rdxd6+?!
N5e6+?
Rfxc2+
-76.89]
Ndb1#
R8d6
R5a4#
gxf2#
-44.92]
Rgxb1?
-74.09]
Qdh7+?!
Ndb5?
Qfg4
cxb1=Q??
gxh8=R#
d7
-57.21]
Ncxd7
Qde7+
R7d2+?!
cxd6+?!
N6xa5?
Rgxf7#
Nfxh6?
Rb5#
#12]
Qexe6#
Q3e6+
-33.7]
e7?
Qexd6?!
Rfxe6#
Qbd2+
-19.94]
-20.36]
-31.32]
Q7f8+
N4xf3??
-24.61]
bxa1=R
-108.26]
-13.88]
R4b5?!
Bf1??
Qgd2
-20.03]
Rhxd6#
Qcg2#
Bxf5?
Rhxh3??
Bh6+?
R5xc4?!
Nhf4??
R8c3+?
R6b3?
Ncxe3+?
Bg2+??
Qxh8?
Rg8?
Raxf7??
Nhg7?!
R6b7+?!
Rdc4+?
-61.03]
-4.69]
Kd5+
R2xf4#
Rgf4+
Rhxe5+?!
Qb1c1+
-66.77]
Qaa3
-37.2]
-120.18]
-6.34]
axb2+?
Raxb6??
#-20]
b3#
R1xd5??
Qfd7+
R5xe2+
-113.25]
R1d2?!
Raxb2+
Qdxg4+
R2d5+?!
N2xa4
Rxd7+?!
Qeb8+?!
R3a6?
-40.87]
Rexc7
Rce5?
-100.83]
Kxg1??
-116.79]
-36.47]
R2e4??
N4f5+??
Qfxc4
-102.78]
N7xe5+??
Nec3?!
R4xh3+
Rexh4#
Q6d8?!
Rbxe4?
N6xd5?!
Bg5+?
c5?
Ndxf3?!
Rbc5
-16.06]
R5f2?
Raxf7
Rbxf7??
-48.65]
Rgxf5?
N5d3+
N5h4
N6xc7
Nfd4?!
-117.81]
R3xa2+
Rhc1
R3a4??
Reb2?
Q8a2
Rgxh6?
Nbd2+?!
Rae4??
N2b4?
-60.83]
R8h4+??
Ref1+
N3d4+
Rgxf5
Raa8
-2.35]
R7e3??
Rgxc4
-32.67]
-82.8]
Qbg2
-57.56]
R7f4+
Qdd1?!
-102.55]
d6?!
Rhe8+
-87.74]
Rdg8#
R1xg6??
Q2h4#
Bc2?
Q3c2+
-78.58]
-69.39]
R5xh4
-107.21]
-53.2]
R8xd3+
-115.77]
-71.1]
Bfe5
N3f4
Q2xd7+
fxg4?!
Reh5
Q2f4+?!
d5?
Nexg7#
-111.56]
R4c3+??
Kxc8?!
Qgd6#
R1d4#
Nd6+??
f7??
Qgf5
Rbxa2+
-21.66]
Bxb3+??
Bxd2+
Ngh7#
Nf1?!
exd1=Q
Qfxg3+
-120.69]
c6+??
Rff1+?
Bc7+?
-13.97]
Nfxh6+??
Rab1+??
Bf6#
-59.48]
Qgxd3#
Qxh5#
-24.67]
Rdg8+??
g3+?!
-39.65]
-52.8]
Nhg5+?
-115.57]
Ndxe2+?!
Rdg2?!
-90.03]
Rexc4
a5??
Q8xa3?!
-68.43]
Qab6#
Rxd1?!
-47.27]
Rhe7+
-1.95]
-43.24]
Kxa7+
Nexf5#
Bxa5?!
Bxc7+?
Nde8+
-70.91]
Qdxg1#
R3f5+??
Bh2+??
Qxd3
R7a5+?
R4xc5
Rexg4#
Rdg5
Q4a3+
Rae1#
Nxa6+?
Nab3+?
Qfh3+?!
Rdxa7?
Rcf8?!
Ref1+?
axb3+??
Rgxb1?!
hxg8=Q?!
e2?!
-62.19]
R3h2??
hxg8=R#
-59.0]
-4.42]
R7xg5??
R5e2+?
dxe1=N?!
Raa8?!
c8=R+?!
Qgg2+?!
Bxh5
R8h2?
Qfxa6+
Rhxd7#
-77.77]
Q4xf6
N1e3?
Rfxd2+??
N3d2?!
Q3b2#
-19.52]
Qfxf5+?!
-67.33]
Qhxb5#
Rxd5+
-18.78]
R8e7+
Ncd3+
-33.94]
-55.46]
-5.24]
b8=R+?!
Rcb5+
-66.42]
Qhxc6
Raxa2
Qhe3+?!
cxd2
Q5g4
Qaa8??
e3+
-58.64]
-108.7]
Qa5#
Qbg4+
-2.85]
-59.07]
Kd5+?!
Rfxh2#
Rdxg5?!
Nbc8??
Q6g8#
Nfh7+?
Ngxf5
Rcg7
-30.75]
N4d3
R8c2
N3xb2
Nde6?!
N7xd5?!
R7xc5
-17.45]
-7.79]
Nef6?
Nhg7
Qxa4?!
Rhd8+?
Bxd6#
-19.42]
R4b3??
Rag2?
Re5??
-56.07]
Rb1+??
-76.01]
R1e2+??
Nab1??
Rgxe7?
Rac8+?
R2d3#
Bxe7#
N4a6+
#9]
Nbxc2+
Rbxd7
Nxc5+
Qbxg8
-96.35]
-33.38]
Qgxe5+
-80.83]
Q6d7
Qgxf8+
#-28]
Qfd8#
Rhxa6#
Nba3?!
gxh2+??
R2f4+
Rhxg6?
Rbxh4
Bh8?!
Q4xg7#
Q5xb5+
Nh2+??
Kxd4?!
N4xf5?
Q6a1+
N2xg4
Rxf6??
-22.81]
R4xh6
cxd8=N+?
-23.77]
-64.35]
Q5f2+
-43.92]
-68.44]
Nexg4?
Ned7?
Nce8
Rhb6+
-70.23]
Rea2?
-67.59]
Q5xg5
Qad1
Kxb2?
-50.29]
-109.87]
-85.69]
Qgf3
Rdxe4+
-104.55]
Kxd6+
Qhxh4+?!
R5e6+??
R2xc4+?!
Qf8?!
Rgxe5?!
Qexc2
Rbxc1+
N1f3+??
bxa1=B
-50.69]
Qe7+??
Qba3+
Qbxd5
Ndxe6?
Qe5?
R4d6+?
R6xf5
Qaxc8+
Rfxg5?
Bd4??
-106.57]
Q6xa2?!
Rbxc3+
Reg4+?!
Qxh6+??
-14.76]
Rdd4
Ne1
-123.35]
Rexe6??
-52.28]
N5xd4+
-6.27]
Ngxf7?
Nxc3+?!
Qcxa2
R6xg5+
Reg3??
N8xf7?
Qaf7+
-51.83]
Reg5+?!
R1f3+?!
bxa5??
-45.91]
Bg6#
-6.77]
Rbxg1
N6c7
Nxh8?!
Rbxc7
Rdxe6?
R8b3?
-42.29]
Q5d3+
Q1f1#
Rbe6+??
Qfg3
Q6e7
Nb8+?
-55.39]
-4.35]
bxa7
Q4g7+
Rfa4
R3h4
R7xd6+?!
Q8xe5
Qeh2#
-81.59]
R3h6#
R4c6+
Rxc4#
Q6b1#
Rgxg8+?!
bxa6+?
Rhxh7+??
Qh7+?!
Qaxg2+
Bgb2
Rdf5?
Rhe3+??
R7c6?!
exd4??
Rad4?!
-18.68]
-35.53]
Q7xf7+
Rae7+?
Nexf4?!
Qdd7?!
R5d4?!
Rcxe5??
Qhe5#
h8=B+
Rexf3+?!
-57.51]
Ncxd7?
Q5h5
Nexc1??
Rhd4?!
Ned5+??
-33.47]
Be7#
Q5e4+
Rexg5??
R7xe5?!
Rec1#
Rg2+??
Rh5?
-13.59]
R3a5
N2xg3
-67.86]
-54.97]
Nxa6+
Qhxe5+
Q7d7#
Qb5
g4?!
-22.63]
-47.04]
Q2c3+??
-112.02]
N1xd3
Rhxf3+
Qaxe4+
Ngf4
Rxc5+
Ncxa5
N7xd5+
Bg2?
-48.24]
-31.87]
-46.77]
-42.83]
Nxb8?!
Q4d6+
R7g2??
Qec7#
Rdxd7#
R7f5?
Naxc6?!
Rxb7+
Rhd5#
Kd6+??
-114.25]
b8=R
-66.04]
Rg1#
-39.1]
gxf1=Q+??
Ncb1+
-44.31]
Nf6+
R5xg6
Nxb3+?
Q5xg3#
Na7??
Qfxd3+
R8a3+?!
N1xd2?!
N3xg2
Rbxf1#
Bh8+??
bxc4+?!
R5d4??
Rge1#
Bg3+??
-123.03]
Q5e4
-50.97]
Rexf6+
-46.5]
-71.61]
Rexb7#
Rexe2?
Ndxb4+?!
Q6c6#
-82.88]
Nfe4
-109.63]
Nbc4+?!
Rd6
-31.24]
-64.25]
Qbb5+
-103.86]
R4h5+?!
-89.39]
b8=R+
Rd4+?
Rgc8?
-59.4]
R6xc4??
-14.14]
Bxc3+??
-23.37]
N5g3?!
-92.23]
Q6b4+
R1xe3?
Ra3+??
-51.64]
R8d4#
Q1h1+
Qxd4+?
Rcxg7?!
-42.65]
-9.06]
Rfxg7+?!
Ne6+??
Nfg3+
Rfxd2?
-20.58]
Qxf3#
Rfd6?
Raxa6?!
Bxb6#
R4xe5??
axb8=B+
Qbxe3
Qexd7+
R3xf6
Qaa2#
-67.14]
-64.06]
c6
Qdd4
Bxd3+??
Rbxe5
-16.77]
R6c2#
Nxc3?
d1=Q+??
Q8e2
-5.32]
-30.33]
R8a3??
Qbc4+?!
-110.8]
R3c7?!
Reg2?
Qgxd4
Qbe4+?!
Qbg7#
Qgxg7
Nfe5?!
Qf3+
Rhxg6+?!
N7xa5??
Rexh6?!
f6??
Rbh8??
R6g5?!
Qaxb6+
Rxe6+?
-40.69]
-3.18]
Nfxg2#
Rha7?
Rde6+?!
Rff5+??
R2xb3??
Nxg6+
Qd2+?!
Rexe5+??
Qg2+?
Ndxe5+??
-14.58]
-45.51]
R1h2?!
Rgxd3?
-1.61]
Kd8?
Qcxc7#
Nxf8??
Rcb3#
Bcd5+
Rfxd5+??
Qexg7#
Rbh2?!
Ndxf5+??
Rhd3#
Nxf1??
Nexc3+?!
Bxb2??
a1=Q?!
Nhg4??
Rcxa4?!
Rf3?!
R8e6?
Nge2+
Q6f6#
Rh3
Kxb6+
-41.16]
Ncxe6+
-12.2]
Q7a8#
Q6b2#
-65.52]
N4a6?!
-108.6]
-5.27]
e7
Rfxf7+
Rfh6?
Bg7+
-10.03]
-17.53]
Rdb1?!
N5e4+
-88.16]
Ndc2+??
Ngh5+
-57.57]
Nexf2+??
R1d4
-83.67]
Rfxd1?
Qgb4#
Rhf5+?!
Rcxe2+?!
Rh2+??
#22]
-123.12]
-51.25]
Nhxg5?
Qgb1
-17.87]
Q4f6
Rfxc7+??
-55.76]
Rgf3
Qfe7?!
-37.04]
Rbc6+?!
-34.15]
Qaxd2
Rcb4
Be6+?
R2b6#
-95.47]
Rbc5+??
Rg8+
Nxb6+?
R8d3+?!
Be6?
Qda1?!
-4.63]
R8f5??
Nxd2?!
Q1d4#
Rbxb3?!
Q2b6#
Qee4??
N6f7
R8xa7
-91.32]
Qef6?!
R7xh6
c2+??
N7xd6+
Bxf7+??
Rexf6
Qcf4+
dxe7?
Ngxe6??
Nbxc2+?
Ra4?
Re1??
c1=R+
-44.74]
Qhc4#
Kxh6
cxb5??
R4xe3
Q6xh6+
Qfe4
gxh1=Q+?!
Nexf7+?!
-89.36]
Qhh6+
Qxf2??
N1c3??
-13.52]
R6f7+
-97.37]
Kxh4
Ndxf6
Nfg6#
Kxc6?
Qcxe1+
-63.75]
Qcf1+?!
f5?
Q1xg2
Bbe5+
Qexf1+
Q3f4+
-11.71]
Qgd1+
Qaa2??
-45.8]
N6h5+?
Rga7?!
R7f6
R5e4+??
Rgd1?
Qcxe7+
Rcxe6?!
dxe6+?
R2g7+
-54.16]
Rdc2?
Qb8c7
-108.68]
Q1f7+
Q2b5#
Qbxd5#
Kf4+??
-100.87]
Raa5
hxg6?
-14.4]
Nexc4
Bxf8+?
Bxg2?!
Qhe2#
Ndb4+?!
-73.26]
-69.89]
Nb2#
Qbd4+?!
Nc3?
Rfg7
Rhb7#
Nhf6?
Raxe4
Qxa6+
Q3xf1+
-21.57]
Nbxc1
Qbe6?!
-52.81]
Nhxf8?!
Nxf8+?
Qac7#
Qexd5#
N1xh3?!
Qgc6+?!
Rbc8?!
Rhh3
Ngh7+?
-11.29]
-109.49]
Raxe5?!
-23.63]
Rdd8?!
Qaxa4+
-43.71]
axb3+?
-73.33]
dxc8=Q#
Rfxa1
Q5b7
Rcb6+
Nhxf3+
Rbf3??
Rad1
R2xe3??
Rbb4?
-71.79]
Rfxd6+
-54.53]
R3c4#
Q1e1
Ng8+
-65.08]
N7d5+?
-14.11]
Qgb6
Nde2?
Rbg2#
-2.88]
Q8xf8#
Q5g4+
Kxh3
Rbf6?!
-25.49]
Kxd2+
R7f3#
Qgxf2#
Qhxh5+
Rgh3?
N3d2?
-48.45]
-15.89]
Ka3+
Rbxf7
R2xg4?!
Bg8??
Raxb6#
Qxh8?!
-28.26]
Rexe8?!
Rhxd4?
Rxh4?
-53.29]
-51.51]
Qeb3#
Rhxf8??
-113.83]
-102.1]
N4xh3
-58.3]
-7.09]
Qexe2
-55.32]
R3xf2
Qbd4
R4g5+
Qch8+
R7xe3?
Nfxg4??
-74.91]
Qd1#
N6e4+?!
Nxh5+
Rgc8??
Rcb2+?
N7h6
R6c4?!
Rbd2
Rgh8?
R1g5?
Qeg4
Rxg6?!
Qdc4+
-62.92]
Qdxa8+
-21.18]
-16.1]
Rc8?!
Ng1#
Na8#
Q5b1+
Qed3
Qcxb7
Ncxa2+
-35.25]
Qfe7+
-116.91]
R8a4+?
Nexd6+?!
R5a6#
-16.91]
Q7h2
Rcc8?
Rcxa4??
dxe4?
-35.87]
Rdc2+?
Rbxd7??
Nhf3?!
Bxh6??
Qca6#
Rbe8+
Ngxf2+
Qff7?!
-106.76]
Nxe2#
R4e6+?!
Rea8??
R6xa2??
cxd7?!
Q1xa6+
Rah7??
Rdxb3+
Qdd4+
R4g6?!
Qg2?
Neg3+?
-56.85]
-16.55]
-117.41]
-109.68]
a6+?!
bxc1=N
-98.89]
Rgh1
Rdxe6+?
Rda1?!
-25.13]
Q6g7+
-1.59]
Q1e7#
-14.12]
R7xa3??
Ndb7?!
N2xf3?
Nge4+?
Qexg7
Raxb4#
Rfxe7+
Rdc8+
R4f6+?!
Qbf2+?!
Rhxb8#
-30.91]
Rfxe2+?
Qfe1
Nab1?
Qgc4+?!
-10.73]
gxf7
-52.77]
Nc1??
R1e6?
Rdg1+??
Kc6+
R3a6+
Bxc2#
-10.51]
Nfh5
cxd2+?
Rgxc4+
g7+
R6e3+?!
-6.51]
Qbb2??
b8=B+
Ngf6+?
Nfg2+
-48.36]
-102.66]
Rbxb5#
N5xe6+
Rexh6#
-5.63]
Bxa2??
-2.28]
Ka2+
Nec2#
-33.59]
Qxa4
e3?!
-39.81]
Q3g7+??
-42.14]
Q6h5?!
Rfxb7?
-78.11]
Q2e5?!
-39.23]
Qbe4#
Nec8?
Rag8+??
Q3xb6#
Qcxd7
N5e6+?!
Qb5+?
Nab5??
Rgxd6+
Rbxd2?
Bg4+??
Bxb3?!
Ndf8
Ncb5+??
Rg5+?
Ncb4?
axb2+
e1=Q+??
Rbxf4#
-14.46]
Q1xc7+
-67.08]
Bxc6#
Nbd5+?
-57.86]
Qae4?!
Qbe8+
hxg3+?
-114.11]
#-1]
R3h2#
R5xe6??
-105.12]
-2.64]
Rxb3+
Bxh7+
Rxg7?!
Na7
R1xd3?
exf6#
R5xb2+
-58.09]
dxc2#
Rab1+?
Nhxf6+??
-34.27]
Bxa3+
-85.08]
Rcb6?
Ree3
Rbxc2?!
Q8xg5
R1e5?!
R4xf3
a3?
-27.74]
N8f7?!
-72.82]
Q3g4+
Rdxd6+??
-4.73]
Rab4
-24.36]
Qcxd5+
-22.45]
-90.5]
-119.35]
gxh3?
Rgf3#
Nxg7+?
c8=R+
-69.47]
-17.31]
Qhxd4+
Nxh7+?!
Nd5?
-3.76]
Rdxd7+?
Rdf5#
Be5?
Qexe6+?!
fxe6?!
-48.15]
-87.93]
fxg2
-16.78]
Qb4b3
Qcxh5
Rxg8+
Kd8+
-22.52]
Rhg5?!
Qbd4#
Raxg3+
Bxa4+?!
-31.89]
R1g6#
R6h2+??
Qexd6#
Bxf7??
Qf2e1
-38.54]
-21.23]
b8=N??
Qdb7#
Raxa6??
-5.08]
-53.01]
-121.32]
Rcxf5??
-111.38]
-9.66]
Rge6+
R2f7#
Rexd6#
Q8h8
Qdxb5+
R4c6+??
Ncd7??
Ndf4?
Qhf2
Qea7
N4xd5?
-45.23]
Bce2
Bh4??
-44.4]
Rdg5+?!
Rfa6
Qch5#
-45.55]
R2xf4
N7xh5
Ndxb4
-121.0]
-5.0]
Rfd1+?!
-61.89]
Ncxa3
Ncxb6
#-18]
-87.2]
N4g3+??
Rcxa2??
Nxb1+??
R3xd4+
Q5c6#
Rc7+??
Qae8+?!
-61.44]
Rhf8??
-99.0]
Baf7?!
Rfxf7
-78.32]
Nd2+??
R8xf4#
Rbd7+
d8=R+??
Q2h3
Kxe3?
Qxf2+?
Qab5+
-83.47]
Qxd6#
e4?!
Rad4
Bh5+?
Ndb4+?
Reb8
-3.1]
-20.75]
Rcxd7?
-11.85]
hxg8=Q+?!
-32.43]
N8d6?
Rd8
Raxh2?!
Q3c7+
-7.27]
N2xf3+
-60.55]
-32.73]
N5xb6?!
Qxd1+?!
-89.62]
Qda8?!
Rda3?
Nhg3
-4.45]
-112.91]
-120.97]
-100.66]
-106.86]
Ra2+?!
R1f5+?!
-93.19]
-57.74]
Q6c7
-73.74]
Rff8+
Qfxe4#
R8d4+?!
Kxe8+
Rfxd6+??
R8xf6
N6a5+
Q1xd6+
R2e5??
R8a5?!
Nfh4+?!
a1=B?!
Q8d8+
-7.64]
Rfxe7+?!
Bb4?
Qxe3+??
Rbf2+?
R3xf4+??
R6xd2
Rec4+?
-118.68]
Rbxe7+??
Qc7+?!
-107.01]
-44.41]
-8.44]
-47.21]
Kc4+?!
Rdc1?!
Rcxd4#
-1.82]
fxe6+?!
-44.78]
Rhxg1+
dxc8=Q??
-10.28]
Reg6?
-107.35]
-31.86]
Qxg2?
Rfxd2
Q8xc8#
Rbxc4?!
N4xc3?
R1e7+?!
-100.46]
R6a7?
-37.45]
Qda1#
-10.59]
Rhxg1#
Rbxf4+
-27.93]
-64.3]
R6b3?!
Rdb8?!
Nd1#
R2xc6??
Ra6?!
Rhe6??
-2.81]
g8=N+
Qbb1?
-32.29]
Q6g5+
Nfd6?!
Rcxc5?
Qac2?!
Qfd7#
-121.22]
Ree2?
Qeb7+?!
Nba2??
-120.96]
Nbxd7+
Rhd8
Ke6??
-25.52]
Q4g2#
Kg2+?!
Qdf6+?!
Reg1#
Ndxf8?
dxc8=B+
N5c4?!
R2xd5?
-12.17]
-120.48]
Qfxe2#
Rec8?!
-18.59]
-78.13]
Rfxe4?
Ba6??
Qee1+
Rdxc8#
N4f5
Bxh7?
-111.74]
R1h5?
Ndf4?!
R1f4
-54.85]
Q2xg6
-22.2]
Kxg5??
-55.21]
Rgf5#
-58.79]
B6e5#
Qe7?!
-80.51]
-45.87]
-53.56]
R1g2+
-67.98]
Rgc1
-8.7]
Qcg6+
Rdxb7#
Nxh7+
Nfd1+
Qec8+
Rcd8
-87.37]
Rd2+
Rgxe1#
Nbxd2?!
-121.71]
Qee1#
Rxg5+?
Kc6+?!
-91.64]
-90.76]
-61.09]
Nfxe6+??
Q1e4#
Rhxf3?
Rdxf4+
Nxe3+??
dxc1=R#
Na4+?!
-37.7]
R7a6?
R8xb3
Ndxc5?
g5??
Rcf2??
-71.91]
Q8g6
-29.44]
-52.06]
Rff8?
R8xg7+
Nc5?!
-29.3]
-73.76]
Qhh4+
Nef3??
-48.61]
Ra7??
Q1d5+
-5.47]
-11.84]
-109.36]
-0.26]
R3g4?!
Qcxf5+?!
Ra5?
f4
R8a2?
Rgc4??
-38.5]
Q3e1
exf3+?
Bh6?
Bxg1#
N5xc6+
R6e2#
Rfxc1??
-54.69]
Bad4+
Qeh1
Qdxd4?!
Rcf3#
R2a5??
Nxc5?!
-109.74]
Ng3+?
N4xf3+?!
Raf3?!
Nd1?!
axb3
Qfb5#
-30.12]
-86.77]
-76.26]
Q8xh4
Qhh7?!
Kg3?
Rdh4
Ngxf4??
Q5d7?!
-0.82]
f5??
Na1#
-46.92]
f2#
Ba4?
-44.7]
Bxc8#
Rge3??
R1xg7+
-117.03]
bxa8=Q?
Q8xf4
-53.87]
Qbe1+?!
Raxe3?
Qdxd3+
-61.93]
Rexc8#
-95.53]
R3b6?!
Bxc2+?!
-104.97]
Q8c7+
Q2xe4+
Rfb2+
Rdxd7
-17.35]
Rhxa6?!
R1d6?!
-11.15]
Rdxg2+
-56.21]
-121.75]
N8f7??
Ncxa3+
-79.83]
-89.23]
N3xd5?
-51.21]
-31.91]
Raxe2?
Qgxg2+
-34.85]
c8=R#
-110.84]
Ncxe3+
Q3d2+
Nxb7+??
O-O+?!
-19.78]
Qbc8+
Raf2?
-40.2]
Qhc8
R8e7?!
-35.36]
N7b5?
R2a3?
Rfxg6+??
Q2h1#
fxg8=Q?
Rbd1+?!
Rcxb5+?!
-12.15]
-17.88]
Bxh7
Bg6+?
N2xc4
Qexg6#
Qbe6#
R8xd6?
Reb5?
-61.13]
Nfxd6+
Nfxh5+
Rge2+?
Qa3#
Qed4
Rda2?!
Rdg8?
Rae4?!
Rha6??
-5.45]
Rxf5+??
-74.05]
Bxd3+?!
Nfxd3?
R5xf6#
-35.24]
Ncxe5+
Qfxd5#
Qce7+
Rhf1+?
Rcg7+
Rdxg8#
b1=B
-104.17]
d1=R
Ba2+?
Qb8+?!
R8g3+
Nac3+?
Nxd3??
Rhb4?!
Nbc8?!
Raf2+?!
-72.83]
R5g6
Bxh6#
Q2h2?!
N5xc4+
Qaxf2+
-23.78]
-19.64]
Qad4?!
cxb8=N+
Qcxf1
exf4+
Nba5?!
fxg2??
-17.44]
Rcxb2?
Q3f6#
R2xf3?!
Ng6?
-73.41]
Qbe4?!
Qxa4#
Nxd7+??
Bd7+?!
R8xd7?
-50.87]
N7xh6+
R7h6#
-80.36]
Rbxe7
R5g6#
Bfe6
-18.58]
Rfxe2??
-92.42]
-106.02]
-5.36]
Rfd6+
Rdxf2?
Bh4+??
Rexf8+?!
R6xd3
Nxd2?
Qae5?!
Rxh2?!
Ndxe5+
Nbc4#
-2.25]
R4xg7?!
-32.86]
R7f2+?
Rcd6?
bxa3??
R3g5
-28.13]
Rbxc7?
Bxg4+
-46.79]
-94.37]
Rdb3
Rhxh4+
Nbd7+?!
Rhxf4??
-29.07]
Qcc6+
-61.92]
Qfc5
Raxd3#
-57.13]
Nf8+?
-15.66]
Qcf8?!
-74.4]
-97.95]
N6c5?!
Rfxf1+?!
Nac1?
-22.51]
-73.5]
-122.62]
Qxh4+??
-107.13]
N6xe7
Q6e8?!
-15.57]
Rhf1
-107.03]
Qxh3+??
-34.87]
-9.38]
Qfxh7#
Qxc8
R4h6
R7b2
R4xa6?!
-60.11]
Nxa2+
Qaxb5+
N2e3+??
Rxb6?!
R8d6+?!
Bxe3+?!
Rexa8
Qce3+
-73.8]
Ncxe7?!
-76.31]
Neg2
fxg1=Q?
Qdc6
Rxa4?!
Bxg4
R2xh4?
c7?
-56.29]
Qxc4+
R7xe3
Rhxd2
R7xf6?
-123.37]
Q7xf6+
Ndxf1?!
Qe3+
e8=R
R6d5+?!
Ngxh4?
Rexb2
R7h2?
axb8=N+
Rge5#
Q7a3+
Raxb4?
Bbd5
-46.84]
-63.44]
Qcxf4
Bb3??
dxc2+?
R7f5#
Rdb8+
Nexg2
Ngf1+
R5a2+?!
-70.65]
Rbd8+?
Ngh6+
-12.05]
Qae4+?!
-57.83]
-45.16]
Rbxh2
Rda5?
b2+??
Rac3
Rae8?
-29.59]
Rcxa5+
Kxd1?!
-54.34]
-74.0]
R3d6+?!
-36.2]
Qec6+?!
Rhe4
Qgf4
Rhd3??
-36.38]
R8a3+
Rcg4?!
-48.63]
