a2
a2+
a2#
a3
a3+
a3#
a4
a4+
a4#
a5
a5+
a5#
a6
a6+
a6#
a7
a7+
a7#
b2
b2+
b2#
b3
b3+
b3#
b4
b4+
b4#
b5
b5+
b5#
b6
b6+
b6#
b7
b7+
b7#
c2
c2+
c2#
c3
c3+
c3#
c4
c4+
c4#
c5
c5+
c5#
c6
c6+
c6#
c7
c7+
c7#
d2
d2+
d2#
d3
d3+
d3#
d4
d4+
d4#
d5
d5+
d5#
d6
d6+
d6#
d7
d7+
d7#
e2
e2+
e2#
e3
e3+
e3#
e4
e4+
e4#
e5
e5+
e5#
e6
e6+
e6#
e7
e7+
e7#
f2
f2+
f2#
f3
f3+
f3#
f4
f4+
f4#
f5
f5+
f5#
f6
f6+
f6#
f7
f7+
f7#
g2
g2+
g2#
g3
g3+
g3#
g4
g4+
g4#
g5
g5+
g5#
g6
g6+
g6#
g7
g7+
g7#
h2
h2+
h2#
h3
h3+
h3#
h4
h4+
h4#
h5
h5+
h5#
h6
h6+
h6#
h7
h7+
h7#
hxa2
hxa2+
hxa2#
bxa2
bxa2+
bxa2#
hxa3
hxa3+
hxa3#
bxa3
bxa3+
bxa3#
hxa4
hxa4+
hxa4#
bxa4
bxa4+
bxa4#
hxa5
hxa5+
hxa5#
bxa5
bxa5+
bxa5#
hxa6
hxa6+
hxa6#
bxa6
bxa6+
bxa6#
hxa7
hxa7+
hxa7#
bxa7
bxa7+
bxa7#
axb2
axb2+
axb2#
cxb2
cxb2+
cxb2#
axb3
axb3+
axb3#
cxb3
cxb3+
cxb3#
axb4
axb4+
axb4#
cxb4
cxb4+
cxb4#
axb5
axb5+
axb5#
cxb5
cxb5+
cxb5#
axb6
axb6+
axb6#
cxb6
cxb6+
cxb6#
axb7
axb7+
axb7#
cxb7
cxb7+
cxb7#
bxc2
bxc2+
bxc2#
dxc2
dxc2+
dxc2#
bxc3
bxc3+
bxc3#
dxc3
dxc3+
dxc3#
bxc4
bxc4+
bxc4#
dxc4
dxc4+
dxc4#
bxc5
bxc5+
bxc5#
dxc5
dxc5+
dxc5#
bxc6
bxc6+
bxc6#
dxc6
dxc6+
dxc6#
bxc7
bxc7+
bxc7#
dxc7
dxc7+
dxc7#
cxd2
cxd2+
cxd2#
exd2
exd2+
exd2#
cxd3
cxd3+
cxd3#
exd3
exd3+
exd3#
cxd4
cxd4+
cxd4#
exd4
exd4+
exd4#
cxd5
cxd5+
cxd5#
exd5
exd5+
exd5#
cxd6
cxd6+
cxd6#
exd6
exd6+
exd6#
cxd7
cxd7+
cxd7#
exd7
exd7+
exd7#
dxe2
dxe2+
dxe2#
fxe2
fxe2+
fxe2#
dxe3
dxe3+
dxe3#
fxe3
fxe3+
fxe3#
dxe4
dxe4+
dxe4#
fxe4
fxe4+
fxe4#
dxe5
dxe5+
dxe5#
fxe5
fxe5+
fxe5#
dxe6
dxe6+
dxe6#
fxe6
fxe6+
fxe6#
dxe7
dxe7+
dxe7#
fxe7
fxe7+
fxe7#
exf2
exf2+
exf2#
gxf2
gxf2+
gxf2#
exf3
exf3+
exf3#
gxf3
gxf3+
gxf3#
exf4
exf4+
exf4#
gxf4
gxf4+
gxf4#
exf5
exf5+
exf5#
gxf5
gxf5+
gxf5#
exf6
exf6+
exf6#
gxf6
gxf6+
gxf6#
exf7
exf7+
exf7#
gxf7
gxf7+
gxf7#
fxg2
fxg2+
fxg2#
hxg2
hxg2+
hxg2#
fxg3
fxg3+
fxg3#
hxg3
hxg3+
hxg3#
fxg4
fxg4+
fxg4#
hxg4
hxg4+
hxg4#
fxg5
fxg5+
fxg5#
hxg5
hxg5+
hxg5#
fxg6
fxg6+
fxg6#
hxg6
hxg6+
hxg6#
fxg7
fxg7+
fxg7#
hxg7
hxg7+
hxg7#
gxh2
gxh2+
gxh2#
axh2
axh2+
axh2#
gxh3
gxh3+
gxh3#
axh3
axh3+
axh3#
gxh4
gxh4+
gxh4#
axh4
axh4+
axh4#
gxh5
gxh5+
gxh5#
axh5
axh5+
axh5#
gxh6
gxh6+
gxh6#
axh6
axh6+
axh6#
gxh7
gxh7+
gxh7#
axh7
axh7+
axh7#
a1=N
a1=N+
a1=N#
a1=B
a1=B+
a1=B#
a1=R
a1=R+
a1=R#
a1=Q
a1=Q+
a1=Q#
a8=N
a8=N+
a8=N#
a8=B
a8=B+
a8=B#
a8=R
a8=R+
a8=R#
a8=Q
a8=Q+
a8=Q#
b1=N
b1=N+
b1=N#
b1=B
b1=B+
b1=B#
b1=R
b1=R+
b1=R#
b1=Q
b1=Q+
b1=Q#
b8=N
b8=N+
b8=N#
b8=B
b8=B+
b8=B#
b8=R
b8=R+
b8=R#
b8=Q
b8=Q+
b8=Q#
c1=N
c1=N+
c1=N#
c1=B
c1=B+
c1=B#
c1=R
c1=R+
c1=R#
c1=Q
c1=Q+
c1=Q#
c8=N
c8=N+
c8=N#
c8=B
c8=B+
c8=B#
c8=R
c8=R+
c8=R#
c8=Q
c8=Q+
c8=Q#
d1=N
d1=N+
d1=N#
d1=B
d1=B+
d1=B#
d1=R
d1=R+
d1=R#
d1=Q
d1=Q+
d1=Q#
d8=N
d8=N+
d8=N#
d8=B
d8=B+
d8=B#
d8=R
d8=R+
d8=R#
d8=Q
d8=Q+
d8=Q#
e1=N
e1=N+
e1=N#
e1=B
e1=B+
e1=B#
e1=R
e1=R+
e1=R#
e1=Q
e1=Q+
e1=Q#
e8=N
e8=N+
e8=N#
e8=B
e8=B+
e8=B#
e8=R
e8=R+
e8=R#
e8=Q
e8=Q+
e8=Q#
f1=N
f1=N+
f1=N#
f1=B
f1=B+
f1=B#
f1=R
f1=R+
f1=R#
f1=Q
f1=Q+
f1=Q#
f8=N
f8=N+
f8=N#
f8=B
f8=B+
f8=B#
f8=R
f8=R+
f8=R#
f8=Q
f8=Q+
f8=Q#
g1=N
g1=N+
g1=N#
g1=B
g1=B+
g1=B#
g1=R
g1=R+
g1=R#
g1=Q
g1=Q+
g1=Q#
g8=N
g8=N+
g8=N#
g8=B
g8=B+
g8=B#
g8=R
g8=R+
g8=R#
g8=Q
g8=Q+
g8=Q#
h1=N
h1=N+
h1=N#
h1=B
h1=B+
h1=B#
h1=R
h1=R+
h1=R#
h1=Q
h1=Q+
h1=Q#
h8=N
h8=N+
h8=N#
h8=B
h8=B+
h8=B#
h8=R
h8=R+
h8=R#
h8=Q
h8=Q+
h8=Q#
hxa1=N
hxa1=N+
hxa1=N#
bxa1=N
bxa1=N+
bxa1=N#
hxa1=B
hxa1=B+
hxa1=B#
bxa1=B
bxa1=B+
bxa1=B#
hxa1=R
hxa1=R+
hxa1=R#
bxa1=R
bxa1=R+
bxa1=R#
hxa1=Q
hxa1=Q+
hxa1=Q#
bxa1=Q
bxa1=Q+
bxa1=Q#
hxa8=N
hxa8=N+
hxa8=N#
bxa8=N
bxa8=N+
bxa8=N#
hxa8=B
hxa8=B+
hxa8=B#
bxa8=B
bxa8=B+
bxa8=B#
hxa8=R
hxa8=R+
hxa8=R#
bxa8=R
bxa8=R+
bxa8=R#
hxa8=Q
hxa8=Q+
hxa8=Q#
bxa8=Q
bxa8=Q+
bxa8=Q#
axb1=N
axb1=N+
axb1=N#
cxb1=N
cxb1=N+
cxb1=N#
axb1=B
axb1=B+
axb1=B#
cxb1=B
cxb1=B+
cxb1=B#
axb1=R
axb1=R+
axb1=R#
cxb1=R
cxb1=R+
cxb1=R#
axb1=Q
axb1=Q+
axb1=Q#
cxb1=Q
cxb1=Q+
cxb1=Q#
axb8=N
axb8=N+
axb8=N#
cxb8=N
cxb8=N+
cxb8=N#
axb8=B
axb8=B+
axb8=B#
cxb8=B
cxb8=B+
cxb8=B#
axb8=R
axb8=R+
axb8=R#
cxb8=R
cxb8=R+
cxb8=R#
axb8=Q
axb8=Q+
axb8=Q#
cxb8=Q
cxb8=Q+
cxb8=Q#
bxc1=N
bxc1=N+
bxc1=N#
dxc1=N
dxc1=N+
dxc1=N#
bxc1=B
bxc1=B+
bxc1=B#
dxc1=B
dxc1=B+
dxc1=B#
bxc1=R
bxc1=R+
bxc1=R#
dxc1=R
dxc1=R+
dxc1=R#
bxc1=Q
bxc1=Q+
bxc1=Q#
dxc1=Q
dxc1=Q+
dxc1=Q#
bxc8=N
bxc8=N+
bxc8=N#
dxc8=N
dxc8=N+
dxc8=N#
bxc8=B
bxc8=B+
bxc8=B#
dxc8=B
dxc8=B+
dxc8=B#
bxc8=R
bxc8=R+
bxc8=R#
dxc8=R
dxc8=R+
dxc8=R#
bxc8=Q
bxc8=Q+
bxc8=Q#
dxc8=Q
dxc8=Q+
dxc8=Q#
cxd1=N
cxd1=N+
cxd1=N#
exd1=N
exd1=N+
exd1=N#
cxd1=B
cxd1=B+
cxd1=B#
exd1=B
exd1=B+
exd1=B#
cxd1=R
cxd1=R+
cxd1=R#
exd1=R
exd1=R+
exd1=R#
cxd1=Q
cxd1=Q+
cxd1=Q#
exd1=Q
exd1=Q+
exd1=Q#
cxd8=N
cxd8=N+
cxd8=N#
exd8=N
exd8=N+
exd8=N#
cxd8=B
cxd8=B+
cxd8=B#
exd8=B
exd8=B+
exd8=B#
cxd8=R
cxd8=R+
cxd8=R#
exd8=R
exd8=R+
exd8=R#
cxd8=Q
cxd8=Q+
cxd8=Q#
exd8=Q
exd8=Q+
exd8=Q#
dxe1=N
dxe1=N+
dxe1=N#
fxe1=N
fxe1=N+
fxe1=N#
dxe1=B
dxe1=B+
dxe1=B#
fxe1=B
fxe1=B+
fxe1=B#
dxe1=R
dxe1=R+
dxe1=R#
fxe1=R
fxe1=R+
fxe1=R#
dxe1=Q
dxe1=Q+
dxe1=Q#
fxe1=Q
fxe1=Q+
fxe1=Q#
dxe8=N
dxe8=N+
dxe8=N#
fxe8=N
fxe8=N+
fxe8=N#
dxe8=B
dxe8=B+
dxe8=B#
fxe8=B
fxe8=B+
fxe8=B#
dxe8=R
dxe8=R+
dxe8=R#
fxe8=R
fxe8=R+
fxe8=R#
dxe8=Q
dxe8=Q+
dxe8=Q#
fxe8=Q
fxe8=Q+
fxe8=Q#
exf1=N
exf1=N+
exf1=N#
gxf1=N
gxf1=N+
gxf1=N#
exf1=B
exf1=B+
exf1=B#
gxf1=B
gxf1=B+
gxf1=B#
exf1=R
exf1=R+
exf1=R#
gxf1=R
gxf1=R+
gxf1=R#
exf1=Q
exf1=Q+
exf1=Q#
gxf1=Q
gxf1=Q+
gxf1=Q#
exf8=N
exf8=N+
exf8=N#
gxf8=N
gxf8=N+
gxf8=N#
exf8=B
exf8=B+
exf8=B#
gxf8=B
gxf8=B+
gxf8=B#
exf8=R
exf8=R+
exf8=R#
gxf8=R
gxf8=R+
gxf8=R#
exf8=Q
exf8=Q+
exf8=Q#
gxf8=Q
gxf8=Q+
gxf8=Q#
fxg1=N
fxg1=N+
fxg1=N#
hxg1=N
hxg1=N+
hxg1=N#
fxg1=B
fxg1=B+
fxg1=B#
hxg1=B
hxg1=B+
hxg1=B#
fxg1=R
fxg1=R+
fxg1=R#
hxg1=R
hxg1=R+
hxg1=R#
fxg1=Q
fxg1=Q+
fxg1=Q#
hxg1=Q
hxg1=Q+
hxg1=Q#
fxg8=N
fxg8=N+
fxg8=N#
hxg8=N
hxg8=N+
hxg8=N#
fxg8=B
fxg8=B+
fxg8=B#
hxg8=B
hxg8=B+
hxg8=B#
fxg8=R
fxg8=R+
fxg8=R#
hxg8=R
hxg8=R+
hxg8=R#
fxg8=Q
fxg8=Q+
fxg8=Q#
hxg8=Q
hxg8=Q+
hxg8=Q#
gxh1=N
gxh1=N+
gxh1=N#
axh1=N
axh1=N+
axh1=N#
gxh1=B
gxh1=B+
gxh1=B#
axh1=B
axh1=B+
axh1=B#
gxh1=R
gxh1=R+
gxh1=R#
axh1=R
axh1=R+
axh1=R#
gxh1=Q
gxh1=Q+
gxh1=Q#
axh1=Q
axh1=Q+
axh1=Q#
gxh8=N
gxh8=N+
gxh8=N#
axh8=N
axh8=N+
axh8=N#
gxh8=B
gxh8=B+
gxh8=B#
axh8=B
axh8=B+
axh8=B#
gxh8=R
gxh8=R+
gxh8=R#
axh8=R
axh8=R+
axh8=R#
gxh8=Q
gxh8=Q+
gxh8=Q#
axh8=Q
axh8=Q+
axh8=Q#
N3xa1#
N2xg8
N1c2#
Na4
N2h1#
Nah4+
N2xb4+
Naxh8
N8xe1+
N6xc4+
Ndxc5+
Nab8#
Nexc1#
N7xb5
Nef7#
N5xd4#
N8h1
N6xc4#
N1d2
Nxa2+
N1f2+
Ncxd5+
Nexf2+
Nfxe5+
Ngxe8#
N3b4+
N7g1+
N7d5
N1g2
Nfe7+
N5h6#
N7a6#
Nfg7#
Naxh5
Ndxf4
Ngh6
N5e6
Ncb3
N7f1
Nexg5
Neg2
Ndc8+
Nh5+
N6g8
N2xa4+
Nxd1+
N3xd1+
Nxc8
N3xf1
N4c6#
Nhxb6+
N7xf5+
Nxg4
N1xd7+
N8xb2
N5h6
N5d4
N7c5#
Nfxd3#
N4d3+
N6d5#
Nh8+
N1f3
Naxg5
N1xh8
Nbd7
Neg5
Ndxe4#
Nbxh1+
N4xd6+
N2xb4#
Nbxc3#
N4c5
N5b7+
Nge5#
N4xf5
Nxe2+
Nh1#
Nfg3
Ndxb3#
N2b8#
Nfh3+
Nga8#
N4xc6+
Ne5
Nexg2
Ngf1+
N5xb7#
Nd7
Ndxb1#
Nca5#
N1xf7#
Ngh6+
Nfxg1+
N8c7+
Nah8+
Nbc1+
Nbd1#
N7d6+
Nfxe1#
N3e2#
Nxh2+
Nxh7#
N2h4
N4xb2+
Nhb4#
Ngxe7#
N3d1+
N7a1+
N4f2+
Nac4
Nxf4
N1xb3+
N7xh5#
Nbd6#
Ngxa6+
N6a8
Naxb6
Nxc7#
N6xg7+
Ndxe1
Nfe7
Nxh3
N1xg3+
Nd7+
Nhxg2
N4xh5
Nc1
Nbxc1+
N4xc2#
Nha2
N5xh4+
Nce1
Nag4+
N7g5
Naxb6+
N5c7
Nfh1+
Nf8
N8xe7+
N6xg8
N1xd2#
Ndc7
Nbxh7#
N6e5+
Nhb2+
Ned5
N1g3+
Naxb5+
Nexg3#
N1h7#
Ngxf6
Nhg6+
Nah6#
Nbd4
Nexg1#
Nbxh6
N4d2
N6xg8#
Nfg1#
N4xb6#
N3b5
N5xf6+
N6e7+
N7xe8+
Nhg8+
N1h2#
Nec3#
Ned6+
Ncd3#
N8c7
Nbxd5#
N3xa4#
Nbxa7#
N4xg2
N6b7#
Nhf5+
Ncxb8+
Ncxd3
N6f5
Nh2#
Nfd5
N7a6
N4xe6
Nxg3
Nxc3
Nfxd2
N5g4#
N7xb5#
Nhxb6#
Nxd2+
Nfg7
Nfe1
Nfh2+
N1h7
Nhg2#
N4b5+
Nhxf2+
N3xc4#
N7xh6#
Nhg5#
Ndf1+
Ndxc8
Nbxc3
Ngxa5+
Nfd2+
N1f7+
N7b5+
N3xh4#
Ngh5#
Naxh5+
N5xg7#
Ndb3+
N5xc7+
N2g8
N7f5
N7a8+
Nah3
Ndf6+
Nxe4
Nbh7#
N4a6#
N3xc2#
Nca7#
N6xc5+
N1b7
Ngf3#
N3xa5+
Naxb7+
N8xc2+
N8d1+
N1xe3+
N2a4#
N8xe6+
Nhxf8+
Ncxd2+
N3xe4+
Ngf2
N3xg4
Nxc7
N5xd7
Nexg7
Ngh1
Ncxb7#
Ngxf1+
Ngxa8+
N3d5
Nf5+
Naxh1#
Nbxa8
Nbd2#
N1xf2#
N4c2+
Nha4#
N1b7+
N3xc4+
Ngxe7
N6e4#
N7b1+
Nga6+
N5b6+
Nac8+
Naxb1#
N5d6+
N4e3
N5c7+
N6xe4+
N3h1+
N4xd5#
N7xf8+
N4xh6#
Nxc2#
Ndb8
Ng2+
N4xa3
Naxc4+
Nfxe6#
Naxc7#
Ndb1
N1xe8
N8b6
N4xc3#
Nxe6
N4e6#
N6xg7#
Ncd4
Ngxh3+
Nec4
Nab3#
Nab3+
Ndxe3
N7xa1
N8xd7+
Nxe3#
Ngf7#
Naxg2
N3xg2+
N6c5+
N5a7
N8b1+
N5f4+
Ndxf8#
Nexg6
N8f6
Nfd1#
N8xe2#
Nexc6+
Ngxf2#
N3a4
N2xf1#
N7f1#
N4xh6+
N1b8#
N2h4#
Nfd4+
Ne7+
Nfxg5+
N8xg6#
Nxa5+
N1f8#
Naxc2+
N5e6+
Nhxb4#
N5g6
N7xf6+
N7a1
N7xg8
Nag8#
N6xh8+
Ngxe6#
Ncxd5#
Nga4+
N2xg1+
Nxb6
Nhg8
N1h8+
Ngh4+
Neg3+
Nca6
Nec4+
N4xg3+
Ngxh5#
N4a3
Naxc5
N4xe6#
Nbxd3#
Ngxf2
N3xf4+
Nexd1#
Nxf3#
N2xh8
N7g8+
Ncxd4
N4g5+
Nhxf6#
Ngxf3#
Ngxf3
N3xc1
Nca4#
N5xc4#
N8xa6
Nag1
Nh5
Nxb7#
N3xe4
N3e4
N7c8#
Nab3
N2xg3#
Ngxa6
Nhb3#
N3xf4#
N1d8+
N5a6
Ndxf7
N7xf1#
Nexf8#
N1e8+
Nfh8#
N6g4
N5xb7+
N4d5
Ndc6#
N6xd8
N5xa7
N8a7#
Ngxf1#
N3f5#
Ng4
Nfg6
N6c5#
Ng2
N7xd6#
Ncxd7+
Nah2+
N6xa4#
N4xh2
Ndxf1+
Ncb7#
N3g4#
N3xb4+
Nac1#
N7xa5#
N4f6#
Nf7#
N3h4
Ndxf6#
N6xe8+
N1xg3#
N1xc3
N4d2+
Nexc4+
N3e1+
Ngxe5
Nxa3+
Nhb1+
N8d2#
N5a3#
Nhxf3#
N8d1
N7b1
N2xf4#
Ndf7
N6g8#
N7xg5
N7d1
Naxg4+
Ndb5
Ngxh1+
Nbxd2
N4c2#
Nxc2
Nexf3
Neg5#
N6e8+
N5a3
N4g2#
Ndc3#
Nb8+
N6h5+
Nec5#
Nbxd8#
Ngxe4#
N2xh3+
Nbh2#
N6xb8+
N8c6
N8d6
Neg4
N2b3
N3e2
Nfxe7+
Nhf6+
Ngh8#
N8b6#
Nfg5#
Naxg2+
Nfxh8
Nb8#
N8xh2#
Nbxh7
Nexc3+
N4h6#
N4e5#
Nag2
N5xd3#
N1g2#
N4xf6
Ncb8
N7c8+
Nhxa2#
N8xe7
Nbxc4+
N1xf7+
N6xg5+
N5xg6
Nfh2
N4e3#
Nga5#
N2g3+
Ndxe1#
Ndb4#
Nhxb2#
N5h3+
Nxe8#
Nac6
N3xe1+
N3f4#
N3b4#
Nbxh6+
N8g2#
N4f3#
N7g1
N3b1+
Nbxh2+
Nec7
Nexd8#
N2xf3#
Nexd6+
Nfd2
N2xf8+
Nhxa5+
Nxc1
N1c8#
Ngf7+
N5xf4#
N4xe2+
N6d4#
Nfxg8#
N3xd1
N8xg2+
N4xg3#
Ndxb6+
Nab8
Nxc1#
Nexg7+
N7c5+
Nfxe3#
Nf8+
Nbxa1
N2e1+
N4xf3+
Ndf7+
Nhg4+
Nah5+
Nfxe7#
Nexc2
N7f6#
Ngxh2+
Ngxa1
N3a4#
N5h7#
N3g4+
Nef3
Nge5
Ngxe3
Nah8#
N1e7#
Nxh4+
N1xb2+
Nhxb7+
N5b4#
N2a3#
N4a3#
N4xh3#
N2xd8#
Ndxb6#
N5xe6
N7xd6
N6xe5
N8xf1+
Nge6+
Nbxd4#
N5xa7#
Nexg8
Ncb2#
Nhxa2+
N5xc7
Nec5
Nbxa6#
N7b1#
N1c3#
N1xg8
N8xd1#
N2xd4#
Nfxh4#
Ncb8+
Nbd8+
Nfd6#
N8g6+
Ndxf5
N3xc2
N1xc7
Nga2+
Nba3#
Ned3
Nfd5#
N4b6#
N8xa1+
N3xf5#
N6xf8#
N3g2+
Nh3#
Nxd3
N5h7
Nxh3#
N1xe7#
N8xd7#
Nxd5#
Naxc2#
Nhf2+
N7xf5#
Nbh3
N2d1
Ngh2+
N4xg6
N6xh5+
Nca5
N7xe1+
Ncxa8#
Ngxe4
Ngxe1+
N6b7
N6xb8
N6d5+
N1a8+
N2c8+
N5d3
Nec4#
Nde2+
Nah3+
Nc1+
Ndc2
Nga4
Ngh4#
Nexf3#
Nd3
Ncxd2#
Nc7#
Nxg5+
Ndxf3+
N3f2
Ngxh6+
N3f5
N8g7#
Na6
Ndxe4+
N7c1
Nc6+
Nxe1+
Nce5
Ndc4#
N1xb8+
Nxe3+
N8xf7#
Nd1+
Ndxc5#
N8xd2+
Nef1#
N5xg3
Nbc4+
N2a8#
Ncxe4+
N3a5+
N3xh5#
N7f1+
N5xa4#
N8e7+
Nbxc7+
Nhb4
N6xd7#
N3xc5+
N5g7#
N6xh5
N8xb7#
N2xg4+
Nb6+
Nf7
Nbxh2
Nbh8#
N6xe8#
Nhxa7
Nxa3#
Nh7
Ngxh8#
Ngxe1#
Nh4+
Ng7#
N1xf3#
Naxh8+
N7xa6+
Nfxg7
Nexc8
Ngh6#
N6d7
N1c7+
Nfxe8+
N7xh5+
Ndf4
N5xd6
Nge3+
N5xb3#
Nfd7+
N2c1+
N8xg1#
N6b4+
Nhxa4
N4h3#
Nce4+
N8xa2#
Nhxb3
N7f8
Ngxe3+
Nexc1+
Nbh6+
Nxd3#
N8f2#
Ndb7+
Nge6
N8xg2#
N8xh2+
N6d4
Ndxc2+
N8f2+
Nbxa3#
N2xb1+
N6xf5
Nxg2
N7xb5+
N4d6
N3f1+
Nfh3#
N7f6+
Naxh2#
Nbc4
N3d2#
N8b2#
N6d5
N5h3#
N2xd8
Nhxg2+
N3a1#
Nbxd6
Nfh4
N6c4
Ncxa2#
Ndb3
N5h3
Nga1+
Nbd1+
Nb8
Ndxe2#
N2xh1+
Nxc4#
Ng7
Ncxb8
Nac1
N8xg1+
Ngxa2#
Nxf2#
N1e2+
N3c2#
Nbd5+
Nexd7+
Ncxb8#
Nexd1
Nxf2+
Nab6#
Nah5
N1xa2#
N2xe1#
Nbxh4
Nc3#
N3g2
Nbd3
N4g3
N5xa6
Nhxf2#
Ncxe7+
Naxc5#
Nde6+
Nbxh3+
N2h4+
Nfxh2+
Ng5#
Nxa7
Nb7
Ncxe4
Nfxg5
Nfxg6+
Nxf6+
Naxc6#
N8xf6#
Nbxh8#
Nxf5+
Nhxg8+
N3e1#
N6xg4+
N6xd4+
Nfd2#
N3e4#
Nca2+
N2f1+
Nac2#
Nxf5#
N2h8+
Ne2+
Ndxc7+
Ndb6+
Nfxh6
Nhb1#
Nxc4
Nxc5
Nfxh1
N8xh6#
Nhxg6
Nc6#
Nf2+
N6xf7#
Ncxb2+
Ned1#
Nf2#
Nbd2+
Ned2
Nha8+
N5xf7+
Nexf3+
N6e7#
N3xh5
Nfxe5
Ncb7
Nge3
Nc4
N2xc4#
Nhxb2+
Ngh4
Nhg5+
Ngxa8#
Naxc1+
N7g8#
N7a6+
Nexg1
N7a5#
N3xa2+
N2a4
Nbxa5#
Na3+
N5xc3#
N8xe7#
Nha3+
Ng1+
Nhxa7+
Ng5+
Nfh4#
N6xh7
Na1
Naxg8+
N3g5#
Nexc6
Nxg8
N5g3+
Nfg8#
N8xg7+
Nfxh5#
N8f1
N8xb7+
N8h1#
N3b2#
Ne8+
Nbxa1+
N5d6
Nfh8
N6g7+
N2xd1+
N2e1#
N2b1#
Ndxc4+
N7xd8
Nec6#
Ncd4+
Nfe6+
N6xb5+
Nhxf6+
N4xb2#
Nhg5
N2xa1+
Nb6#
N3a5#
Ncxd3+
Nbd5
N3g4
Nha6#
N3xb1+
N1xd2+
Nbh8+
Nfxe6+
Nba7
N4xb6
N3c1
N4a2
N3f4+
Nexg6+
Nha7#
Nde6
Nxa8
Nef4+
Nexf6
Nhxg4+
N8a1#
N4b3#
Ndxc7#
N8xe2+
Ncxb7
Nxd6#
Nxe7+
N4xg6#
Nexd2+
Ndb2#
Nfe2+
Nac2
N6g4#
Nde7
Nge8+
Nca3#
Ncd2
N3h4#
Nh7+
Ngh7
N2g1#
Nc1#
Nbd6
N2xg1#
Nec5+
N1f7
Ncb6
N2xc3
Nhb6#
Ncxa5+
Nga6#
N8h2
N1xb8#
Nhxb1#
N3xf5
N1xc8+
Nxd2#
Nba2#
Nd8#
N1xa2
Ncb5
N3a1+
N7e1+
Ne4#
Nexc8+
Nha8#
Na4+
N1h3+
Nxf4#
Nfg2
Ned6
N1xd7#
Ndxf1
N3xg5
Ncxe4#
Nxf7#
Nhxf8#
N8g1#
Naxg3
N1g3
N3h2#
N7xa1+
Nfg4#
Ngxa2
Nfe6
N6xd7
Nba5+
Naxh4#
Nxf8
Ndxc2
N7c1#
N3xe2#
N3g5+
Nce3
N4xf3#
N6a5#
Nfe5#
N2xb1#
Nbxc5#
Nhxa7#
Ndxc2#
N7b6+
N7xg8#
N4a5+
N8a7+
Nac1+
N6a5
N4xb3
Naxh2
Nbxh1
N4g6+
Neg7
Nab2
N6c7#
N2xe3
Ncxe6#
N2xe8+
Nhf5
Nhxg6#
Nxd5
N3h1#
N6xh7#
Ncxb4+
N3xh1+
N2xe4
Nbxc4
Nbh7+
Nbd3+
N6xd7+
Nfxd1#
Ndb8#
Nexg8+
Nd1
Nhxa4#
Ncd1#
Nhxa4+
Nxh2
Nfe3#
Ngxe2#
N5xe4+
N6xg7
Ngxa8
N5xg4
N4xe3#
Nfxg5#
N7e6+
Nge6#
Ndxe6
Nfd3
N7h8#
Nhxg7
N2e4
N5xe4#
Nxb1#
N6xa5
N2e4+
Ngf1
N8a2+
N3d5#
Nexf4+
Ncb6#
Ngxa7#
Ncxd8+
N4g2+
N8xd6+
Nd3#
Nfh3
N2g8+
Ngxh3
Nbh2+
Ndc5#
N1f8
Ng3#
Ncd2#
N5g3
Naxh2+
N1xe3#
N1xa3
Nexg2#
N6xf4+
Nhb7#
N3xe5#
N7g1#
Nd2
Ng5
Naxg6
N1xb7+
N5xc6#
N2xh3#
Nxg7
Naxb7
N6xd8#
Ned7+
N8a1+
N2c3
N4c3
Nfg8
N2a3
N5xf6#
Nhxf5
Ngxh7#
Ndxf2+
Ndxc6#
N8xf1
N1f2
Ngxf8
N1d7+
Nf5#
Nfxh6#
N4xh6
Nxg4#
Naxg7#
N6c7+
Nhf1#
Naxb4
Nbc1
Ngf6+
Na3#
Nxb8#
N7xc6
Nfxh4+
N8xc2
Nab1
N6h4+
N2a1+
N3c5+
Nxc3+
N3xc1+
N1xg2
Nfxg4
Neg7+
Ned4+
Nfe1+
Nc5
Nxc7+
Nfg4+
Nxf2
N7e5+
Ndf6#
N1b8
N2b3+
Nxa8+
Ndxe7+
Nbh2
Nexg1+
Ndf4#
Nhxg4
N7h5+
N5d6#
Ndf3
Nexc5#
Ndc1+
Ngxe2+
Nef8
N3xb5#
N6xg4#
N7xc1
N4xd3
N2h1
N7xc1+
N8xb2#
Nf6
N7xb6+
Nxd4+
N4g6
Nfh6
Nexd4+
N7c8
Ndb1#
N4xf5+
N1b3+
Nbxd4
N5xd6#
Nxg7#
Ndxe7#
Nb2+
Ngxa4+
Nhxf4#
Nbxd7
N5xh7
N4xf2+
N2xc1+
Nbxh2#
Nb4
N8xa2
Nbxc5
N3xg5+
N1a3#
Ncxb4#
Ncd8#
Ncxd7
Nfd5+
N5f6+
Nfg1
N3a4+
N8xd2
Nxa1#
N4c6
Nh5#
Ndxf6+
N7b5
Nef1+
N1xd8+
N3b5#
N3xe1
Nha2+
N3b2+
Nbh5+
N1xd8
Nce6
N5xh3+
N2f1#
Ngxf7+
N3xe5
Ne8
N5e3+
Ndf2+
Nexf1
N6xa4+
Nce2+
Nxh1
N5e4#
Nfxg2
Nb5#
Nab2+
Nf1
N8xc7#
N5xh7#
Nhxg1+
N3xd5
Nef6
N2xg1
N2xc4+
Ngxa5
N6c8
Nbc6+
Nfxd5#
N7f5#
Nf4+
N2f8#
N1xc7+
Ncxd6
Nxg2#
Nac5#
Nexd5
Nba1#
Nba7+
Nfxh7
N7xa8
N6b5#
N1xh3#
Nce7
N4g2
Nbh4#
Nec7+
N3e5
N8xa7+
Nef1
N7f6
N3xb1
N2xe1+
Nfd6
N2xa3+
Ncxd8#
N3e2+
Nbc1#
N2xd3+
Nac7
N2c3+
Nd7#
N6g4+
Nag6+
N3a1
Nga8
Nde7#
Nhb6
N4f2#
Nfxd8#
Naxb6#
Nxe1#
Nxe4#
N2xd8+
N5xf7
Ncxb5
Nge1#
N3xg2#
N7xh6
Nxe8
Ncd5
N2xf4+
Nxa5#
N6xd8+
Nab7#
N8c6+
Ndxe7
N2xa4
Nbh5#
N7xg6+
N8e1+
N2b4+
N2d3
Nxh8#
Naxc8
Nhb8#
Nexc7#
Ndc5
N8d6#
Nha1
N3xc1#
Nh3
N6xh4#
N7xg5#
Nfh6#
Ngxh5+
N5xg4#
Nbxc8#
N5xe7#
Nfg6+
Naxh5#
Nfxh5
N5d3+
Naxg1#
N5xa3
Nf6#
N5h4
Ngxh8
N8f7#
N6xc7
N7g5#
N1xh8#
N1xd7
Nxd8
N7e1#
N3xb2#
N7xd1#
N3xf1+
N7h6+
N8xg1
N6b8+
N8b2+
N3d4+
Nhxf5#
Nag3+
Ndxb2
N5h4+
N1xg3
Nxc6#
Nfg2#
Nxf8+
Nhxg7+
Ncxa6+
Nbxd8
Ngxf4#
N8g6#
Ncxd1#
Ncxd8
Naxg3+
Ndxb2+
Nxc8#
Ndxe5
N7xf5
Naxc7
Ncxe1
N4xf2#
N4xa6#
Nbd7#
N7h1+
N7a8
Nxf6
N2b1
Nca6+
Nce3#
N3c1#
N8e7
N3xd5#
Ndf4+
Neg8+
N7xc6#
N2d1#
Nfxg2+
Nbc2+
Nexg4+
Nexc3
N2h1+
Nec2
N3xc5#
N3xb5
N3xc2+
Nhb2
N8xg6
N1xa8
Ncxb1#
N4f5#
Nexd3+
Ngh2#
Nhxa1#
N8xf2
N8xh6
N8xf7+
N3f4
N1xg7#
N8c7#
N1b3#
N5b7#
N5xa3#
Nhg1+
N2xb3+
Nexg7#
Nhf3
Ndb2
Ndxe3+
Nhf5#
Nfxg8
Ne7
Nfxh7#
Nec8
N4f2
N2h3#
Ncb5#
Ndc5+
N2xe1
N3xh2+
Ngh7#
Ndf5
Nfxg6
N1h3
Nhxa6
Nbxa1#
N3xa4
Nfxh3#
N5e6#
Nfxd6
N7h1
Nb7+
N8b7#
N4e5+
Nbxd2+
Ned4#
Nha5
Nhf1+
Nhxg8#
Ncxa8+
Ned2#
Nxb1+
N2xb3#
Nh2
N4xa3#
N3g5
N6xa7#
Ndf1#
N3f5+
N1xg8+
N3xb2+
Ng6#
Nexf7#
Nac3#
Nhg4
Nfe3+
Nf8#
N2d8+
N2a1
Ne3
Neg8#
N1e3
Nbc5+
N8xc2#
Nba1
Nga4#
N8d7
Nha1+
N5a4#
Nde8+
Nexf5#
N1g2+
N4d5#
Nfg3#
Ncd2+
Nbxd1+
N4xc2
Nhxf4+
N1e3+
N3h5+
N8a6#
N3xh5+
Nbh4
N7b8+
N5d7+
N4xe5
Nbxa2
Nec6+
N2e1
Nhxa6+
N2g3
Nexd2
Nxe5#
Nag7
Naxb7#
N1g8
N3xd4#
Nhf6#
Ned8
Nhxg3#
Nhxa5#
N7xa8+
Nbh7
Nxg8+
N7b8
N7h1#
Ncxa5#
Nbc7+
N3f2+
Nag3
Naxg5#
N2b4#
N1xf8+
N8xh7+
Nbxa5
Nfxg1#
Ncb3#
N6c4+
N4xe2#
Nbxd6+
Nge5+
Nec3+
Nef3#
Ndc6+
N6xa7+
Nah1
Nbc8#
Nxd8+
N3xe2
Naxc2
Ndxc1+
Nxc4+
Nag3#
Na8
N2g4
Na2+
Ncd3+
N2xf8#
Nxb6+
N6xc8+
Ngxe3#
Nexd8
N1a8
N7d8
N5xe6#
Nah7+
Nah6+
Nfxd2+
Nfxd4
N4xa2
N8g2
Nah3#
Ncxd4+
Nhg3+
Nbxa8#
Nh4#
Nxe7
N5xg3#
Ngxf5#
Nh6#
Nge7+
Nce8#
N5xb6
Nxb5#
N7xb1#
Ndc7#
N8xc7+
Nxe3
Nfe5
N5xg6#
Naxh1+
N1xc8
Ngxf5
Nexd7#
N2f8
Ndxb7+
N4d3
N5c4#
N3xb2
Nbxd6#
N7xa6
Ndc2#
Nexd6#
Nexg6#
N6g5+
Nah7
Nhg7
N5xb6#
N8g1
N2e4#
N3xe2+
Nef6#
N6xf5+
N2d3+
N6xe7+
Ndxe8#
N4xb5#
N1c3+
Nag6#
N4b5
Nxg2+
Ncxb1
Na7#
Nbc8
Nhf3+
N3xb5+
Nge4+
N3xf1#
N4a6+
N2xd1
Ncb8#
N6xa5+
Nfe2#
Ne6+
N4xb3#
Nbxc2+
Nxa2
N5f3+
N7g5+
Nbh3#
N1xb3#
Nxc5+
Ned7#
Nhxf4
Nxf7+
Nb4+
Ngxa1#
Nge1+
N5xb4#
N4xc5+
Ngxf5+
N2xg8+
Nexc1
Nec6
N4h2
N7g6+
N5c4
Ncxd2
N6xd5#
N2f3
Nac6+
Naxb2
Nexc7+
Ngxh1#
Nfh7#
N5g4
Nfxe6
Nbd6+
N2xg4
Naxg6#
N6b4#
N7b6
N6xf7
Nca3+
N1xf8#
Nca1+
Ngh5
N5d7
N5xa4+
Nc2
N8xf1#
Nce8
N4b3+
N3g1
Naxg7+
N3b2
Nbxc2#
N4d6+
Ncxb2
N2f3#
Nef5
Ngf8+
Nf7+
N3xg5#
N4e5
N8a6+
N3xa1
N1xd3#
N5b3
N6xa5#
N1a7#
N5xg3+
N3xd2#
Nca4
N8xb2+
Nxf1
N6h8
N7e6#
Nfh7
Nha4
Naxg4#
N8xe6
Nfxg1
N4b3
Ncd6#
Ngh3+
N6e7
N6b7+
N6xd5+
Nhxb8
Ndxc4#
N1d2#
Naxc1
Ncxb6#
N1xe2+
Nfxg3+
Nab5
N8b6+
Ne1
N8xh6+
Ncxb3#
Ncxb2#
Nfg1+
N6c8#
N2b8+
N6h8#
N6xd4
N7xd8+
Nhxg2#
N5xd4+
Nec1+
Ncxe1+
Nef3+
N5xc7#
N4xc2+
N7xd1
N1xb2#
Nxb6#
N2a8
N4xe2
Nfxh1#
Ndc8
N5d4#
Nfd3#
Ne3+
Ncxd4#
N7d8+
Nha6
N8e2+
Nbxa3+
N8xd2#
N7e5
N5f3
Naxc4#
Nxd8#
N1xc2#
Nh7#
Nbxa5+
Nac5+
Nhxb1
Ngxe7+
Neg1
N1xg2#
N6c7
N7xa5
N1xa8+
Nhb3+
Ncxd1
Naxc7+
Ncxe8
Nfd8
N3b5+
Ngxf6+
Ndxc8#
N1xa3#
N3xh2#
N4xh3+
Nhxa2
Naxc4
Ned7
N2a3+
Ndxb3+
Nhb5#
Ngxh4+
N8d1#
Nxh3+
N8b2
Nhxa8+
N6xc5#
Nbxc1#
N8g7+
Ndxb1
N8c2+
Nb2
N2b4
Nfxd4#
Nbxa6+
Ngxa3
Nxf3
Nga3#
Na6+
N3c1+
Ngh1+
Nh8
Nge1
Nbd8#
N1c2+
N6xc5
Nexf4#
N1e8#
Ndc4
N7xd1+
Ncxd6#
Nfe8#
N7e8#
N1c8
N7xa8#
N4h5
Ned5+
N1h8#
N2xh1
N2xb8+
Nfxe2
Ngf6
Ngxh4#
Nga5+
Nxb8
Ncxe5#
Nac3+
Neg1+
Nfxh1+
N6d8#
Nfxd4+
Nxh8+
Ndxb8
N7c1+
Ngh2
N7f5+
Ndc1
N6xe8
N4xh5#
N4a5#
Nbxh5
N2d4
N8xh1
Ngxf7#
N5g6#
Nxc6
N2xg3
Ngxh8+
Naxb4#
N8c2
Nfe7#
Nexf1+
N2f4
N5b6#
N2g4#
Nxa6+
Ngf1#
Ngxh7
Ndxb6
Nde6#
Nag2+
Ndxf2#
N4a2+
Nbc5#
N1xd3
Nexg5#
Nba6+
N6b4
Ngxa7+
Nbd7+
Ngf4
Nfxd6#
Neg3#
N6xg5
N4xd6#
Ne5+
Nb3
Ncxa5
Ncxa7
N7xd5+
N6h4#
Ncb2+
Ne3#
N4xe3+
Ndxf3#
N2xb4
N5xe7+
Nxb3
Ncb4#
Nexf5
Nxg4+
Nh6
Nfxd7#
N8c1#
Nxe1
Ndxf8+
N5c3
Naxc3#
Nhf4+
Nef8+
N4b2#
N5xb6+
Ncb1+
Nfg5
N5a6+
Nxb7+
Ndxf5#
Ned3#
N3a5
Ngf4#
N8xc7
Nf6+
Nfd7#
N1h2+
Nbc5
N2g4+
Nab6+
N8b7
Ncxa8
Ncxb3
N3d1
N3xg2
N6xh7+
N1e3#
N1xe7
Nhb4+
N3xe5+
N1e7
Ndc7+
N4e6
N2xa8
N7xb6
N6e8
N6xh5#
N8d6+
N8b1
Nhb2#
Ncd4#
Ned6#
Nbxa7+
N3xh1#
Na7+
Ngxf4+
N4d2#
N7e8+
Ne4
Nb1
Ndb5#
Nd4#
Nxa3
N7xe8#
N1xb7
Nhxb2
Ndf3#
N6a7#
N8h2#
N1a2+
N3f2#
N7d6#
N1xg2+
Nba3+
Nhg7#
Nce1+
N1d7
Ndc6
N3c5#
Nfe4
N1xe3
Nbxh1#
N7xe6+
Nexd5#
N5xf6
N8g7
Nha6+
Nfxe1
Nd2#
Nha5+
Nfxd8+
Nxe4+
N6b8#
Ndxb1+
N5b7
Nexf2
N4g3#
N4xb6+
N1a7
N6f4#
Ndf8+
Nxd7#
N3xh1
N8h7#
N5xd7#
N2d3#
Ne7#
N1g8+
N6d8
N4xe6+
Nhb8+
N1xc7#
Nb5+
Nxb8+
Nfxg4+
Ngxf3+
N4xg6+
N2h3+
Nbxh7+
Nfd6+
Nha7+
Nxh1+
Nexc6#
Nfd7
Nag8
Ncxa1+
Nca5+
N3xf2
Ngf5
N7xc8
Nab7
N4xf6#
Ndc1#
Nef7+
N6g7
Nhf2#
N1xa8#
Ngh1#
N5e3
N4e3+
Ngxh6
N1a3
Ngxa3+
N8xg6+
Nge2#
Ngxh2
N6c5
Nbd4#
N1xf3
N1a2
Nfxe3
Nfg3+
N8xe6#
Nef5+
Ngf8
Nfxg6#
N4e2+
Ndxc6+
Nf2
Neg7#
Ncxa2
Nde3#
Nd6#
Nfe8+
N1h2
Naxb5#
N3h4+
Ncxb1+
Ncxd1+
Naxh3
Nbc3+
N8xc6#
N7h8
Nxa4
Ndb3#
Nhb8
N8xc1
Nce7#
Nexg8#
N4xh2#
Nexg3
N6h7
N7xf8
Ngf3+
N8xb7
N2d8#
N5xf3#
Nac2+
Nxd1#
N6e4
N1xc3+
Nxa1
Ndc3+
N7xg1
N7d1+
Nef2
Nxh7
Nag7+
N4b2+
Nhxf5+
Nag5
Nbxd2#
N2xh8#
N4xf5#
Ngh7+
N7a8#
Nde5
N4g5#
N3xd5+
Nbxh3#
Nhf7
Nca1
Ncxb5+
Ngxf8+
N1b8+
Nc4+
Nhb3
Ne6#
N6xh4+
Nxh6#
Naxh7#
N8xd1+
N4f3
N4a3+
N6xd5
Nfxg2#
N4h2+
Nba3
Nbxa4
N4xd2
N4xf2
Ngxe5+
Nxg6+
N5xh3#
Nxe2
Nba5
Nde8#
Nexg5+
Ngxa5#
Nbc3
Nhxg7#
N5xh7+
N1h3#
Nfh7+
Nhg2
Ngh3
Nhxb8#
Nbxh5+
N5c6#
N3xh4+
N6d4+
Ndf2#
Ngxe5#
Nxg6#
N6h5#
Nde1#
Naxc6+
N8xc6
N4xd5+
Nbxh3
N2g3#
Nfg7+
N2xe8
Nfxh7+
Ngf5+
Nhg4#
N5c3+
Nbc7
N7xe1
Nab6
N3xe1#
N2a8+
Nge2
Nge2+
Nxf5
Ndxe6+
Nexf5+
Nh2+
N1d7#
N4c5#
Ncxe6+
Nexc5
N5f6#
N1g7
N6xc8#
Nah6
N6a7
N8a7
Nxb3+
Naxg1+
Nxh5#
Nf1#
N6e5#
Nexg2+
Nd8+
Nexd6
Nxd7+
N5xd6+
Nxe5+
N2c1
Nhxf1+
Neg6#
Nfh8+
N1a8#
N3c5
N1f3+
Nhxf3
Neg6
Nce5#
N3f1#
Nexf6#
N8g1+
Ndxb2#
Nxe5
N7xe6#
N1c7#
Ndxc7
Ncxe2#
N5e4+
Nha1#
Ngh5+
Ncxe6
Ndxf7+
Nde2
Nxb2+
Nec8+
Nge8#
N6xc4
Ngxf6#
Ncxa7#
N8e2#
N6c4#
N7xh8+
Nfxh6+
Ncb3+
Ngxa7
N4c2
N3xd2
Nxa6
N1e8
N1xc8#
Nfd4
N8e2
Nhb5
N5g7
Nca2#
N4d5+
N7xh1
Nxc3#
N1xe2#
Ncb4+
Nce3+
N7xf6
Na5+
N8xe1#
Nexc4#
N5c4+
N4h5+
Ncxa4+
N2xf1
Nfxe2+
N3xg1#
Nxg3+
Ncxd5
N1d3#
Nfxd5+
Nce6#
Nc8#
N6h5
N2h3
N3e5#
Ndxb5+
N3xg4+
N2d4+
N4f5+
N6f7
Naxc3+
Nhxb6
N7xd6+
Nga7+
N7xf1+
Nexf4
Nxg6
Nxb7
N1g7+
Nbxh4+
N4h2#
Ndxc5
Nxe6#
Naxb5
Nd3+
N6xb7+
Nfxd3
Nah1#
Ncd7#
Nfxd7
Ndxb4+
Nhf4#
Nac6#
N4c3#
N4xc5#
N1d3
Naxg3#
Naxg8
N6a8#
N7xf1
Ncxa4
Nc3
Nfe1#
Nga5
Na6#
N5f7+
Na5#
N6g8+
Ndxf6
Nfg6#
Nec3
N2h8
N7h5
Ngxe6
N7xh1#
Nde8
Ng6
Nfxe3+
N3d4
N1xg8#
N1g8#
N5xf3+
N3xg1
Ne8#
Ncxb3+
N8h6+
Nxf6#
N4c6+
Nbxa4#
N8h7+
Nxd4#
N8f7
N1xc3#
N1xa2+
Nab5#
Neg4+
Ncxe5
Ndxf1#
Ngh8
N4b6
Nd4
Nhb7
Nf3#
Nxa7+
N7g6#
Ngxh1
Ncxa6
N4a6
N8xf2+
Ne5#
N5c6
Nce7+
Nhxg1#
N7c6#
Naxh3#
N6a4+
Nxb5+
Nb1#
Ncxb7+
N6xb4#
N6xe5+
Nexc4
Nh6+
N8xc6+
N6e5
Nb2#
N5xa3+
N6a4
Nbxa6
Nfd1
N5f7
N3xa2
Nhf7+
Naxh3+
N2f4+
Nga2
Ndxc1#
N6xb4
Nbh1#
N2xd3#
Nbxc1
Ndf2
N7e1
N7xd5
N6xg8+
Nhxa8
N2e3+
Ngf6#
Nfxe4
Nef4
Nc5+
N6f7+
N5b3+
N7c6+
N3xb4
Nba8
Nhxb5
N2xc3#
N6xc8
Ncxb5#
Nxd1
N1xe8#
Nexf7
Nde3+
N7e8
Nca3
Na1+
N6d8+
Nxa1+
Nga1#
Nhxf3+
Nexf1#
N2xc8+
N5g3#
N8xf2#
Nd5#
Nxh5
Nbh1
N7h8+
Ng8+
Ne1+
N4h3+
N5f7#
N3a2#
Nfxg7#
Nh1+
Ncd7+
N2xb1
N8xb1#
Nbxa7
Naxg7
Naxb1+
N3c2
Nfd8#
N1b2#
Nbxa2#
N8xg7
Ndxf7#
N7xa1#
Nab4#
Nfxg8+
Nxa8#
Nhxb7#
N8xb6#
Nhxb8+
Ndxc6
Nfxe2#
Ng1
N1c8+
Ncb1
N2e8
N4g6#
Nhxb1+
N7b8#
Ncd5#
N1xh3+
Nca8#
Nhxa3#
Nbxd8+
Nef8#
N5xe7
N7xe8
Nga2#
N1b7#
Ndc2+
Ndxc1
Nge8
Nxf7
N5e7#
N2xb8#
Ndf8#
Nde4+
N2xa8#
Ncxa1
N4xh3
Nxf8#
Neg2+
Nhg8#
Nxh8
Nca2
N5a4
Nxc8+
Nef4#
Nhg1#
N6f4+
Ngxf8#
Nxg1#
Nxe7#
Nxh5+
N5a7#
N7h6
Nexf8
N8xf7
Ngxe8
N3xd2+
Nexd8+
Ngf2#
Nfxe4+
N3xc4
Nfe8
N8f2
N8h6#
N7d1#
N6f8#
Nfd4#
Nfe5+
Ng1#
N8a2#
Nhb6+
Na8#
N8xa6#
N5xe3#
N2g8#
N5xc6
Nbxc6#
N7xb8+
N1h7+
Ncxb4
N6a4#
Ngxa4#
N8g2+
Nc2+
N5h6+
Ncxa2+
N2xg4#
N7xb1+
N6b8
N7e6
Ncxe8+
N8h7
Nbxc8+
Ngxf1
N4xf3
N4b6+
N6xh8#
N3b4
Nde4#
Nag6
Ng8#
Nhg2+
N3xf2+
Nag7#
N3e1
Nxh6
Ngxf2+
N4xc5
N7xb8
Nxe2#
N5g4+
Nfxd1+
N7xg6#
Nexd5+
N6xb7
N2xb3
Nd5+
N2xh3
N1xh2+
N6g5#
Nec8#
Naxb3
Nb4#
N7xh1+
N4xg5
N2c3#
Ncd8+
N5e7
N1xh3
Nfe4#
N7xc5#
Nhxa6#
N3xh2
Nce2#
Nfh1#
N7xe5#
N5g6+
N5xc3
N8d2
N7xd5#
Nexf2#
N3xb1#
Nh4
Ngf4+
N6xf4
Nce4#
N4h3
Ndc3
N5xb4
Nb3+
N5xb4+
N1d2+
N3b1#
Ndb6#
Nbxd3
N1xd8#
Nhf1
N5xf4+
Nhf8+
N2c4
N5xg4+
N7xc8+
N7xe6
N2c4#
N3e4+
Nde1+
N1g7#
N1d3+
Ncb4
N2e3
Nfxe7
N7g6
N7xc5+
N1e2#
N3xf5+
Nhxb3#
Na5
Ngxe4+
N5d7#
N2e8+
Nhxg6+
N6xc7#
N5b3#
N4a5
Nc6
Nxd3+
N4e2#
Ned4
Nfh5
N6b5
N3xb4#
N4xa2+
Ndxb7#
N5xh3
Nxc2+
Nfg2+
N1f7#
Nhxb5#
Nfxe4#
N5xe6+
Nbh6
Nbxd5
N5a4+
Nec2#
Ndxe2+
N2xf4
N3xa5#
N3d4#
N4f6+
Nba4#
Ngxh4
Nbxa4+
N7xa6#
N3d2+
Nfxd7+
N5xc4
Nb1+
N4e2
Nah4
N8xa2+
Nga3+
Neg3
N4d6#
N2xh4#
N8e1#
Ngxf4
N1xg7
N4h6+
N8a1
N6a7+
Ndxc3
Nba4+
Nga6
N6xa8+
Nac4+
N7h5#
Nhxb7
N4xg2+
N6xc7+
Nb6
Nbh3+
N5a3+
N6xg4
N4xc6#
N4xc3+
N6d7#
N8xg2
N5xb3+
Nfe6#
Nhxa1+
Nxb2
Nac7+
Ng4+
Ndf8
Ng3
N2xc3+
N5f6
N1xh2#
N3h2
N5xh4#
Naxb2+
Nfxg3
Ncxe7
Naxb3+
Nba8#
Nxa7#
Nbc6
N1d8#
Nhxf7
Ncxe7#
Nxd6+
N6f5#
N5xh6
N1g3#
Na2#
N2xe3#
Nhg1
N8h1+
N7d5#
N2c4+
Nah7#
N3xd4
Nfxh3
Nexd4#
Ncxe2
Nbd1
Nef7
Ngh8+
Naxc8#
N6xa8#
N5xd7+
Ncd8
Nd5
Nah2#
N8xd6
Na7
Nhxf1#
N8d7#
N8e6#
N8a2
Nd8
Nac8
Ndxb3
N7d6
Ndxc3+
Nbc6#
Nhxb4+
Ndxf4#
N3xf4
N8xc1#
Nf4
Nge7
Nhxg5+
N3xa4+
N4xh5+
N8xe2
Ncxe3
Nac3
Nhf3#
Nxf1+
N5c3#
N2g1
Naxh7
N2xa3
N1xh7+
Nfe4+
Nxd2
N2xa1#
Nhxb4
N7b5#
N3xd1#
Ndxe3#
N5e4
Nce5+
Nab1#
Nec2+
N3xe4#
N7a1#
N7d8#
N6f7#
N5e3#
N5xe3+
Nhxf8
N1xc2+
Ngxa4
Nfd3+
N5g7+
N8xf6
Nba7#
N4xd3#
Nexd7
Ngf8#
Nag4#
Nba1+
Nxh4#
N4f6
Naxb3#
Nxa2#
N2xc1#
Nbxd7#
Na8+
N1xh2
Nde1
N4xa2#
Ncxa4#
N7xg5+
N3c2+
Nca8+
Nha8
Ned1+
Nf4#
Nba8+
N4g5
N5b6
Nba5#
N1f3#
Ncxa7+
N2xe3+
Nb5
Nca7
Nhxa1
N8xh7
N3f1
Nxa5
N7f8#
Nec7#
Neg2#
N5xa4
N1xd2
N8c6#
N2xd1#
N1xa7#
Neg4#
N8f6+
N8f1#
N1xf7
Ncd6+
N1xb7#
Nexd1+
Nfxd5
Nfxh4
Nha2#
N7xh5
Ndxb4
N2xe8#
Nxf1#
N5a7+
Ncxa3
N1c2
Nd4+
Naxc3
Ncxb6
N1xf2+
Nhb7+
N7xc1#
Nca6#
Nag5+
N2xa3#
Ncd3
N7xg1+
Nab1+
N4xb2
Nexd4
Nbxc8
Ndf3+
Nc3+
Ndc8#
Nxf3+
N4f3+
Nhxf7+
Ngh3#
N3g1#
Naxh7+
N5c7#
Naxb8+
N7xd8#
N3d1#
Ncb1#
Nfxe8
Nhxg5
N1a3+
Nbc7#
Nfxd8
N4xh2+
N3g2#
N7a5
N8xh7#
N1xa7
N8xh1+
N2xf3+
N1c7
Ng4#
N5b4
Ndxe8
N7xb1
N7xc8#
N3g1+
N8xd1
Nge7#
Nc8
N3xf2#
Ngxa3#
Ncd7
N1d8
Nhg3
Nxg3#
Nhxg3+
Ndxc8+
Nca8
Ndf5+
Nexd3
Nba4
Nac4#
Nf5
Nbxh8+
N6a5+
Neg5+
N4xg5#
N6g5
Ncxa3#
N4d3#
N3c4
Ne6
N4xb5
Nfxh8#
N8xc1+
Nfh6+
N8xa1#
N1a2#
Nexf7+
Nxb4#
Nd2+
N1c3
Nhg6
N6a8+
Nfxd1
N2f3+
Nbxd3+
Nxf4+
Nag8+
Nxb2#
Nbxc6
Nxc5#
N8xb1+
N7g8
N8f6#
N3c4+
Nde5#
N8xh1#
Nbh5
Nfg5+
Ngxh6#
N1f2#
N1f8+
Nxd5+
Naxg8#
Nga8+
N2b1+
Naxc5+
Nc2#
N6xb5#
N1e7+
Nxa4#
Naxb8#
N2xc1
N8c1
N2xg8#
N7xh8#
N6b5+
Nfxh2
N7f8+
Nexc2+
N5f4#
N7b6#
Ncb2
Ned8#
N5h7+
Na3
Nab8+
Ng2#
Nc5#
Nhb5+
N7c5
Ned1
N2e3#
Naxh4+
N1b3
Nxa4+
N4h6
Nca4+
Nef2+
N3h5
Naxg2#
Ncb5+
N8xe1
Ndb7#
N6xe5#
Nd1#
Ng3+
N6xf8
N7a5+
Nhxf1
Ncxe1#
N5xh6#
Nce2
Nxb4+
Nexg4
N7xg8+
N4xc3
N5f3#
N2h8#
Nexg4#
N6xh8
N5xe4
Ndf1
N2c1#
N2xf3
N5c6+
N8h6
Nac8#
Ngxe1
N5xc3+
Nbxd7+
Nge4#
Nca7+
N2xb8
N8f1+
Ncxe8#
Naxg5+
N2b8
N6d7+
Nbxa3
Ncb7+
Nhxf6
N2a1#
Nab2#
Nhxa8#
N5xa7+
N7xf8#
Ndxe6#
Nhxg1
N4a2#
Nga7
Nbc3#
Nfxe5#
N8xh2
Nbc8+
N4f5
Nh8#
Nab4
Nhf6
N6xb4+
N5xb3
N6xf5#
N4xa5
Nxb5
Nce1#
Nfxh8+
Nba6#
Nbxd1#
Neg1#
Ned3+
Ndc4+
N8xa6+
Nhf8#
Nfxe1+
Nxb1
Ngxf7
Nxg1+
N8xa7#
N8b1#
Nxh7+
Nhxb3+
Nfd1+
N2xd4
Ned5#
N2g1+
Ncxd3#
Nxd4
N8xd7
N3h1
N1a7+
N5xd4
Nbxd5+
Nbd8
N2xh8+
N3c4#
Ndb2+
N2d8
Ndb6
Nhxf2
N6xf4#
Ndxc4
Nef5#
N4h5#
Naxb2#
N6xb7#
N3xc5
Ncxa6#
N4xg5+
Nha7
Nhxa3+
N5a6#
N5xg7
Naxg6+
N3xg4#
Ndxb4#
Nc8+
N4c3+
N3a2
Ne4+
Naxb8
Nbd2
Na4#
Ned8+
Nhxg5#
Ncxa1#
N4e6+
Naxc1#
N6xb8#
N5xe3
Nxh4
N1xa3+
Nbxc2
Nbxc7#
N2xc8#
Naxb1
Ndxb8+
Nd6
Nag2#
N2xd4+
Nah4#
Nfxd2#
Ndxe5#
N8e6+
Nde4
Nag4
Nag5#
Nab4+
Nfxh2#
N4xd6
N3d2
Nbxc6+
N5d4+
Nah2
N4xd5
N8xb1
Ng6+
N1xh7
N3xg1+
Nga7#
Naxh4
N6h4
Nxd7
Ndxf5+
Nhxa5
N4xe5#
Nhf4
Nexg3+
Nbxd1
N6xb5
N3xa2#
N2e8#
Nge3#
Nec1
N5xc6+
Nexd2#
N2b3#
N4xa5#
N7xf6#
Nbxa8+
N2c8
N8g6
Nbxh6#
Ndf7#
N5xg6+
Nfg8+
N5xa6+
N5xd3+
N1b2
Ndxb8#
Ndxe4
Nce4
N7xb8#
Nfh4+
Nba2+
Ngxe2
N4xb5+
N3d5+
N8xb6+
N4xe5+
Ngxh3#
Ncd6
Nce6+
Nxg8#
N1xc2
Ngxh5
Nfe3
Nbxh8
Nhf7#
Ngxh7+
N5xd3
Nxe8+
Na1#
Nexd3#
Nxg5#
N4b2
Nexf8+
N3xh4
Ng8
N2xa4#
Nexc7
Nfxe8#
Nhf8
Nge4
Ncxb6+
Nca1#
Nbxh5#
Nfxh3+
N1xe8+
N1xb2
Ne1#
Nag1+
N2xa1
Ndb5+
N7xb6#
N2xf1+
Nfe2
N2xf8
Nhxg4#
N6h8+
Nga1
N8c2#
Ndxb5
N8c1+
Nah1+
Naxh6+
N4xa6
N8b7+
N7xg1#
Ndb1+
N2d1+
N7xh8
N8xd6#
Ncxa3+
Nhxb5+
Neg8
Ncd1+
N6xe4
Ndxf8
Nbxh4#
N2d4#
N3xd4+
Ndb8+
N2f4#
Nba6
N8h2+
Nexc8#
N8e6
N3e5+
Ncxe3+
N2a4+
Nf3
Nag1#
N7xa5+
Nde3
N8e1
N6c8+
Ndxe8+
N7xe5
N2xc8
Nexc2#
N4c5+
Ncxe3#
Nef2#
Nbc2#
Nh1
Nxh2#
N2xh4
N5xb7
Ngf7
Nbh4+
Nhxg8
Naxh6
N7xc5
Naxc8+
N8xa1
Naxg1
N6xh4
Ngxh2#
N3xa1+
N2xh1#
Nfd8+
N1e2
N2xc4
N6xe4#
Nce8+
N6f8+
Ndxb5#
Nde2#
Ndb4+
N6xe7#
Nxb4
Ngxa1+
N1b2+
Nah8
N3b1
N5e7+
Nxg5
N1xa7+
N1xd3+
Naxc6
N8xb6
Nfxd6+
Nhxf7#
N5h4#
Ncb6+
Nfxh5+
N8d2+
Nxb3#
N6h7+
N1xe2
N8xa7
N5xf3
Nha3#
N2xh4+
N7d5+
N6e8#
N8d7+
Ngf5#
N6xf8+
N3h5#
N8f7+
N1xh7#
Nfh1
Ncxe5+
Ngxa2+
Nc4#
Nab7+
N6f4
N2xd3
Nfxd3+
Nfh2#
Nfh5#
Nfxg3#
Nxa6#
N2f1
N5xf4
Nhg3#
Nhb1
N6xd4#
Nac7#
Nha3
N1xe7+
Nbxc4#
Ndxf4+
Nga3
N4xb3+
Ne2#
Nbh8
Nexf6+
Ndxe1+
Nbc2
N5xh4
Nxg1
Ng7+
Nb7#
Nfxg4#
Nf1+
Ngxa6#
Nfxg7+
Ndb4
N4b5#
N7c6
Nac5
N6h7#
N5xc4+
N1xf3+
N2f8+
Ngxe8+
N1xf2
Ndxc3#
N4xa6+
N4xa3+
N6xg5#
Nhxa3
N5xa6#
N7xe1#
N7xe5+
Nd6+
Ncd1
Nha4+
Nxh1#
N5xf7#
Nxe6+
Ncd5+
Ndxe2
Nxc6+
N4xa5+
Nhxg3
N2xa8+
N4xd2+
N8xf6+
N5d3#
N4xc6
Nbd3#
N1xb8
Nxd6
N7e5#
N7xh6+
Nbxc5+
N4xg2#
Nbh1+
Nbxd4+
N2c8#
Nf3+
N6f8
Ngf3
Ndf6
Nab5+
N2xg3+
Nb3#
Nhg7+
Nbxc7
N8a6
Nc7
N3h2+
Nbd5#
Naxb4+
Nba2
Nhg6#
N1xh8+
Ndxf3
Ncxd6+
Nbd4+
Nde7+
N6xa4
N6xf7+
Nbc4#
Ndxe5+
Nc7+
N8e7#
N5f4
Nfg4
Nha5#
Nexc3#
Ndxf2
Naxg4
N1xg7+
Nef6+
N6xa7
Ne2
Nbxa2+
Nbxc3+
Nh3+
Nfh5+
Ngxe6+
Nxc1+
Naxh8#
N6g7#
Nexc5+
N5b4+
N2xe4+
N5xh6+
Ncxe2+
N7h6#
N6xa8
Ned2+
N4xg3
Nde5+
Ndf5#
Nxh6+
N3a2+
Nah5#
N2xe4#
Naxh6#
Ncxd7#
N1h8
N6f5+
N3xa5
N5xg7+
Ndxb7
N1xf8
N6xe7
Nec1#
N4xd3+
Na2
N4xe3
Nxg7+
N7xg6
Nbh6#
Neg6+
Naxh1
Nhf2
N6e4+
N4g3+
N1xb3
N8xg7#
N4xf6+
Ngf2+
N4xd2#
N7xc6+
Ndb7
Be8
Bxb8+
Bg6#
Bd6#
Bxh7#
Bxg1
Bxf8#
Bxb5
Bf2
Bh5#
Bxb4
Bxg4
Bf8+
Bxe7
Bf1
Bh5
Bh2#
Bxe6
Ba7+
Bg3#
Bb8#
Bxg2
Bxa8+
Ba3+
Bxc6#
Bxb2
Bf7+
Bxg5+
Bh3
Be4
Be1+
Bxh7+
Be7#
Bxe5
Ba5
Bxc7+
Bxa3+
Bf3+
Bxb6+
Bf2+
Bb5#
Bc7+
Bxf6
Bf8
Bxe2+
Bxb8
Bxd2
Bxh3+
Bb6
Bxf4
Ba4+
Bg7
Bb7#
Bxe5+
Bxh2
Bxb1
Bb8
Bxf3#
Bc5
Bxg7+
Bd3+
Bxc4+
Ba7
Bxa3#
Ba3#
Bc1+
Be5
Bf6
Bxf1#
Bd5#
Bf1+
Bxc4
Bxg7#
Bxf5+
Bd4#
Be6
Ba7#
Bxc2
Bxc5
Bxc5+
Bxe8+
Bc7#
Bxa5+
Bxg8+
Bxa6+
Bg5#
Bb7+
Bxc1+
Bxf7+
Bb1#
Bh6#
Be2+
Bd8+
Bxb6#
Bxd4
Bxh1
Bxb3#
Bh2+
Bc5#
Bxe3
Bf4#
Be6+
Bc6#
Bxf4+
Bg4
Bxf3
Bd1+
Bxc3
Bg8#
Bh2
Ba1
Bc6
Bxd3
Bh1+
Bxe1
Be8#
Bc4#
Bxh4#
Bxa4#
Bh1#
Bxh4
Bf3
Ba4
Bxc2+
Bxe6#
Be6#
Bxh2#
Bf5+
Ba8+
Bg6+
Bxg3
Bxc1#
Bd6
Bxh1#
Bf7#
Bxa2#
Bg4#
Ba6#
Be5+
Bxf7
Bxf1+
Bg8+
Bxb4+
Bc8+
Bxh5#
Bc2
Be1#
Bxa5
Bxg8
Bxc7
Bc2#
Bd2
Bxg2+
Bxd6
Bxf6+
Bxa4
Bc2+
Bd1#
Bxh6+
Bxa7
Bxc7#
Bf4+
Bg7#
Bb5+
Bb1+
Bd8
Bc8#
Bxd3#
Bg7+
Bxb7#
Bh4
Bb2+
Be7
Bxe6+
Bc3+
Bg2+
Bg5
Bh4#
Bxe5#
Bxh5+
Bxg6#
Bxa6
Bd7#
Bxb3
Bg2#
Bb3+
Bc8
Ba6
Bxd4#
Bb8+
Bg1+
Ba8
Bxa3
Be7+
Bxh4+
Bh1
Bh7+
Bxa7#
Bxd1#
Bd3
Ba5+
Bh4+
Bc1
Bxd5+
Be3#
Bh6+
Bh8+
Bxe4#
Bxa1
Ba2+
Bd4
Bxf8
Bxg3+
Bxd2+
Bxb1#
Bxh3
Bxg8#
Bxg1#
Bf5#
Bd5
Bxb7+
Bxa4+
Bxd6+
Bb6+
Bh6
Bf6#
Bg3
Bf4
Bxh1+
Be4+
Bxd8#
Ba3
Bd2+
Bxb7
Bxf1
Bxb2+
Bh3+
Bxd1
Bb4#
Bc7
Bd4+
Bb2#
Bc4
Bg2
Bxb5#
Bb7
Ba2#
Bxd2#
Bxe3#
Bxe4
Bxc6+
Bxc8#
Bxc5#
Bxe1#
Bxe7+
Bc3
Bc1#
Bh8
Bxh8
Bxd8+
Be1
Bxe8
Bb1
Be5#
Be3+
Bxb8#
Bxg1+
Bxc3+
Bxh5
Bxg5
Ba5#
Bxg6+
Bxa2
Bxc6
Bxg2#
Bxe3+
Bxg4#
Bxg7
Bxa5#
Bxc3#
Bh5+
Bf3#
Bg1#
Bxa8#
Bd7
Bg5+
Bxc8+
Bxe2#
Bxf2+
Bxf4#
Bxb2#
Bxd5
Bxf5#
Bxh7
Bxf3+
Bxa2+
Ba4#
Bxb1+
Bg4+
Bd7+
Bxh8+
Bxd6#
Bxe4+
Bf1#
Bxd4+
Bxc8
Bxb3+
Bf5
Bg8
Bxh6
Be4#
Bxd7+
Bxe7#
Bh3#
Bb3
Ba8#
Bxd7#
Bb3#
Bxd1+
Bxf7#
Bc3#
Bd5+
Bh7
Bxh2+
Bxb6
Bxf2
Bg6
Bxh6#
Bb4+
Bxa1+
Bxa8
Bxd7
Bxg5#
Bh8#
Bxf6#
Bh7#
Ba1+
Bd1
Bxc4#
Bxf5
Bxh8#
Bxb4#
Ba1#
Be2#
Bd2#
Bxd5#
Bxe2
Bg3+
Bb2
Ba6+
Bxf2#
Bf8#
Bf7
Bxb5+
Bc4+
Bf2#
Ba2
Bxg6
Bd8#
Bc5+
Be8+
Bxa6#
Bf6+
Be2
Bb5
Bxg4+
Bxa7+
Bb4
Bxc1
Bxd3+
Bxg3#
Be3
Bxc2#
Bxe1+
Bxd8
Bxf8+
Bb6#
Bg1
Bxa1#
Bxe8#
Bd3#
Bxh3#
Bd6+
Bc6+
R2a3+
R5b4#
Rec5+
Rfg1+
Rhxf7+
Raxc4+
Rcf7#
Rhxc8#
R4xd7#
Rcg5#
Rda5
R7xf4+
Rcxd7#
R8xa4+
Rhxg8
R7xa8
R2h6
R5f8+
Rcd1
R5xg4+
R1xd6+
Rdxa4#
R5g4#
R4c1#
R4xb1+
R1xb5
R2f5#
R3e5+
Rgxa1
R4e8
R2xc4+
R8e2#
Red8+
R8h7
R2xg7#
R8xd5
R6xf3+
Rgxe6
R2xc5#
R6d8
Raxf2
R4b8
Re1+
R4xg8+
R8xa7#
Rbg1+
Rbxf6#
Rdxb4
Re3#
Rgxa1#
Rdxf5
Rfxa6+
Raxb1+
R1xa6
R1h5+
Rag2
Rhxc4+
Rfh2
R5xh1
R4xd8+
R5xa8
Rcd3#
Rdf6+
R5xc3
R4e5
R4xe8#
Rexa4#
R4f1+
R2xf1
Ra2+
Rexd4
R3xg4+
Rxb1#
Rec3#
Rb2
R2h7#
R3xg5#
R4b3#
Rcxh4+
R2xh6+
Rab1#
R5xa4
Rb5+
Rgb2#
Rcxd6
Rh1
R2g3
R2g4#
R2e8+
R5xd7
R6g8#
R1xb2#
R3g8#
Rac5#
R4d7
R4f6+
Rdg2+
R2c3
R4d1
Rf7#
R4h7+
R7xf1
Rad7+
Rgb7#
R2d4#
Rbg5+
Rcxf7+
Reg7#
R3f6#
Rhd6+
R3xa5
R7xf2#
Rhb3
Rdxf7
Rdxg1
Rgd2#
Rge6
R2xb6+
Rfxh6
R2d7
R3xg2#
R8xg5#
Rxg5+
Rba8#
R5d8+
Rexb4+
Rhxa6
Raxe7
R1xg5
Rexb1#
Rhxe2
Rbxf3#
Rxe3+
R1xf8
Rhxc3#
Rch3
R4xf2+
Rdb6#
R6f1#
Rgxb1+
R8f1+
R1g4
Rgxd2#
Rdh1#
R8h1+
Raxe7#
Rda3
Re6+
Rbxg8+
Raxf1
R7c3+
Rhxe5
Rhe4#
R8f5#
Rcf2+
Rxg6#
R5xb8#
Rbd4+
Rhxa4+
R2xc1+
R2xf4+
Rbe4#
Rea6
Ra5
R4xg5+
R2xh1+
R4g5#
Rdc2+
R7f6#
Rxg6+
Rde2
Ref6+
R4g3
R8xg2+
R2d7+
R3h1+
R6xg7#
R6h2+
R8f3
Rfxh7+
R2xd4+
Rhxc8+
R4e1
Rhxd3#
R4xf8
R8xg5
Rcxd7+
Rbd3+
Rgd7#
R4d5#
R5xa3
R4e6
Rha8+
R3e5
R3xh8+
R3g2+
Rah8+
R4h7#
Rfxa8+
Rbxg4#
Rcg6#
R7c3#
Rca7#
R3xb7
Rbh2
Raxb8#
Raf2+
R6xc1
Rexh4
Rxg8#
Rgc4
R8xe6#
Rxh8#
Rexc3#
R3h8+
Rca5#
Rhxe5#
R3g8+
R8c6
R5xe4#
Rexc8
Rhxd6
R1xe8
Rbh7+
R2xa1#
Reh3+
R8xh7+
R7h5+
Rdxf1+
Rad4#
Rbxh7#
R5b3#
R8d2+
Rhxf2#
Rfxh1#
Rdxh8#
Rgxb2
Rexg2+
Raxd3
R8a5#
Raxe8+
R4e6+
Rhxd1#
Rhg8
Rbxh3+
R8xb1#
R8xf6+
Rba7+
R5d3#
Rdxb5
Rda8+
Rbd3#
R8xa4#
Rdxc2+
R4xf5
Rxd7#
R4xf6
Rfxb3#
Rcxf1
Rfg8
Rdf8+
Rh4+
R3xa2
R8h3
Rfxh4
R5xa4+
Rfh5+
Rgxh8+
R7xe2
R6xd5
Rbxe1+
Ref5#
Rbh3+
Raxg5
Rbxd5+
R7xa6+
Rbxe4
R3xf5
Rdxb4+
R7e4#
Rdxa8
Rgxe2+
R1xc7#
Rgf6#
R8xb7+
Ref1#
Rexd7#
Rexg6
Ra7+
R7xb6#
R2c7#
R3xb7+
Raxd4
Rf2+
Rdf7+
R8a4
R7xh4#
Rc6#
Rbxd5
Rhxg6
Rfe2+
R7e2
Rbxe4+
Raxf6
Rfxe7
Rfc2#
R3e6
Rcxh7#
Rfxc3
Rgd1
Reg1
Rhe7
R4xc3+
R6xe8+
Red2#
Rdxb5#
Rcf4#
Rexa2
Rxd6+
Rgxd8#
R6d4+
Rhxf5
Rhd1+
Rxb5#
Red4
R8xf2
Rfxh8
Ra8#
Red6
R1xa2+
R8xe7
R6xg3#
R2g3+
R5xc2#
Rae4+
Rdc5#
Rea7
R6c3+
Rfxe8
Ra3
R6e1+
R3xf4#
Rfa7#
R1g3+
R1xa5#
Ra4
R6d3
Rexd5
R4a7#
Rexd3#
R8xd6+
Rdf4
Rba4+
R8g6#
R7g8
R1b6
R2xa8#
Rfd2#
Rgxc2
R6xd8
Rah5
R2xd1#
Rdxh4
R6xf3#
Raxb2
Rdb5+
R6xh1
R8xc4+
R6xb8
R7e3
R7f3
Rhxc3
R5xf2
Rfxh1
Rhxa2+
Rhg6
Rh8#
Rbxc4#
Rdxh3+
Rfxa8
Rfxd6
R4xd7+
Rbxa2
Rdxc8
R4e5+
Rab7+
R8xg5+
R3a8#
Rcxd8
R3a7+
R1xg7#
R1xf2
Rcxe4+
Rae5#
R5d1
R3xe6+
R8d3
R6xf4#
Ra6+
Rbxe3+
R3xc2+
R2xg1+
R2a8
Rhxf8#
R5xh1+
Rgd8#
R1xc3#
Raxf1+
Rbxa5+
R4xg1+
R6xg2+
Raxc4
R1f7+
Rhxa3
Rb8
Rxb4#
R2e1+
Rcxe5#
R8d2
R4xh8#
R6h5
R4xh7
R3xa7#
R1xc7+
Rfc5#
Rxg5
Rhg5
Rdc7#
R7f1+
R3xb1+
R1xe6
Rda4+
R3xb4#
Rcxb5
Rbxa3
Rcxd2
Rab5
R5xf1#
Rhc7
Rbf8+
R8h2
R7f4
Rcd1+
Rga5+
Rdf5
R4d2+
R6xg7+
R4g1#
Rexc2
R8xh7
R6e4#
R3e7#
R5xe3
R5a8#
R7a1
R3c4+
Rgxd5#
R3xa1+
Rga1#
Rcb1+
R7xb3
Rad5#
R2xa4#
R7xe8#
R8a5
R8f4+
R8xa5#
R5e3+
Rfh2#
Rcg6
R8a3#
R6xg1
R2d6+
R1xc8+
Rhg1+
Rexa2#
R6d2
Rxd4#
Rgxb7+
R7g2#
Rda2
Rga3#
R6xa8#
R1xf7+
Rfh1
R1f6+
Rea7+
R6a8#
Raxe5+
R5g1
Rcxa4+
R7d3#
Rbh5+
R3h2
Rdc3#
R7e4
Rfxe5
Rgb3#
Rcxe2#
Rab7
Rfc6+
Rfxc8#
R8xh7#
Reb8#
R5xf8#
Rg1
Rbxc4
Rxf1+
R2xe5+
Rbxh2#
Rdxe6+
R6g7
R8xd5#
R7xf6
R7h8+
Rbe1+
Rhxb4#
R7xh6#
Rhg3#
R5f4+
Rfxh8+
R1xa3
R7h5#
R2h3#
R8e5+
Rexb8
Rgd6+
Rcxa8
Rdg4+
R4xe1
R7c6#
Raxc5#
Rc8
Rexf6#
R2a4
Raxb4
Raxg6#
R5c1#
Rhxe7#
Rbh5#
R3a6
R3xc8#
R7e3#
R2xe5
R5d6
R8xa7+
R6xa2
Rfxe2#
Rgxb4
Rxg3
Rfxb5+
Rch6+
R6xc5
Rgb4
R7g6
Rab1+
R4xa1
Rgb8
R8b3
R5xg7
R4xb2
Rcf6+
Reh6
R2xe4#
R3xa1#
R2d7#
Rxh6+
R2c4+
R6xh5
R1g5+
R4b3+
R1a2
Rexd4+
R2f4
R5xf8+
R1f3#
R5c4
Rcg2#
R2xb6
R8b2
Rae8+
Rad4+
Rgxb1#
R3h1
Rgxb1
Rcf1#
Rxc8
Rcxf8+
R6e7
Rbg3#
R5e7#
Rfxc6
Rha8
R7xg4
Rfxh2+
R2d8#
R7xg3#
Rc7#
Ref2
Rbxf2+
R8f6+
Rde1
Rf6#
R3h1#
R4xh5#
Rdxg3
Rcxf6+
R5a4+
Rbxe4#
Rexa3
R6h3+
R7xa8+
R8d6#
R8a7
Rdxc6#
Rbxf7#
R7h4#
R6xg7
Rch2+
R5h8#
Rce3
Rfxg4+
R7c1#
Rah4#
R3xe1
Red7
Rgh2#
Rcf2#
Rfh8+
Raxh8
Rha3+
Rcxb7#
R3b4+
R4xd6#
Rdb6
R1xg4+
R5e3
Rcd3+
R1a2+
R4g6+
Rexg1#
Rgh8#
R1xf5#
R1b5#
Rbh6
Rcxh6
Rcxh6#
Rha4
R4xh1+
Rcg7#
Rgxc4#
Rxd8#
Rbxh1
Rbxd4
Raxd4+
Rag8
Rgh2
R8xg4+
R7xe8
Rdg5+
Raxb8+
Rbxe8
R6xe3#
R3d5+
Rbd8#
Rgxh2#
Re3+
Raxg2#
Rbxg7
R8e4#
Rda4
Rdg6
R2xa8+
R5xg4
Rcxe5
Rec5#
R5xh3+
R2xc1
R8xh2+
Rf2#
R8e3#
R7xb3#
Raxc5
R5f4#
Rbxf5
R6e4
Rcd1#
R1c8
Raxg8
R5xd3
R3c2
Rcxd3
R3xg8
Rxc4+
Rc1#
Rfb2#
R1g8#
Rag6#
R2xc3
Rbxe2
Rg3
Rexd4#
Rcd4+
Rea6+
R2xc3+
R5e8+
R7xb1+
R4f8#
Rxf8#
Rxh1+
Reg7+
Rdxe3
Rbxc6
Rexc1#
R4e2#
R7xf2+
R3e1+
Rdxf7+
Rea5+
R3f2
R1xc2#
Reg8+
Rbd6
Rdxf1#
Rxc8#
Rexg7+
Rdxg5#
Raxe4+
R8xg4#
R7xd3
R5xd8#
R7d8#
Rbd5+
Rxb7
R2xd7#
Rd7+
R7xh2+
R6xg5
Rea1
R1xb4
Rcxg3#
R4xc6#
R5xb6
R2b5
R3b1+
Rcb2+
Rxa7#
R5xb3
R1xh3
R2xd4#
Rdh3
Rdb3+
R7xf8
Rgh3+
Rbg7+
Rbg8#
R3f2+
R8xb4#
R5xg8+
Ref4
R5xd3+
R1xd5#
Rhxg8+
R3xd7
R6xc3+
R5xb8+
R7xe5
Rh5
R8d3#
R6e7+
R6xd1+
R8h1
R8xh3
Ra6
Rcxh5
Rba1#
Raxg4+
Rcxf5+
Rdxf3
Rce5
R1xh2+
Rhxf7#
R8xh4#
R1xc5#
Rgxf1+
Re8
R3xf8+
R3xh2#
R3e7+
R7xb4+
Rexh8#
R6b1+
R6xf2+
Rg3+
Rgxh8#
Rexg2
Rdxf8+
R4d2
R5xc7+
Rcxf4+
Rexd3
R1b2+
R6c7#
Rfxa2+
R8xg1
Rbf5
R7b6+
R6xb5#
Rde5+
R6b1
Rhxb3#
Rgxf4
R4xe7#
R1f7#
Reg6#
Rgh2+
R4g6#
R2e5
Rcxe5+
Rdxa3+
R6c2
Rhb5
Rbxd7#
Rxa6+
Rb5
Rgd8+
Rfxb6
R7xg6#
Rxa3#
R8xa4
Raxh1
R6xe2+
R8xe5+
Rdh7#
Rcb5
R6g4#
R7xb8
R3xc1
R7xg1#
R5e1+
R7xb1
Rexd7
Rdg8+
R7xh2#
R3xa4#
Rexa1+
R5xe7+
Rhxb6#
Rfd3#
Rg6+
Rah5+
R1c4#
R5xg1#
R5xa1
Rcxg2#
Rbxd1
R4xa5
R1d3#
R1h4
Rcg2
Rec3+
R6h5+
Rch1+
R3xh4
R8xb1+
Rd5
Rcxf1+
Rfxg2#
R1f6#
R1b3
R7xc8
Rb6
Rdh2+
Rhb4#
Rea3#
R2xc8
Rdxe6
Rfb6#
Rbe7#
R2xh1#
R1e7#
Rfg2#
R4a3#
R8c1+
R1xf2+
Rgb1
Rdb8#
Rgd2
Rca3#
R7g5+
Rc7+
Rgh5+
Rde8
Rbh7#
R1e8#
R2xc6#
Rcxe3#
Rgxd6#
R2xf3#
R6a1+
Rge2
Rhxa2
Rcxg6#
R1xf4
Raxb3+
R6g3
Rcb7#
R1f2#
R3b1#
R6b5+
R7c8+
Rhxb7
Rec7#
R7d2+
Rgxe1+
Rag1#
Rhe3
Rexa4+
R5a2
Rhf4+
R4xb2#
Rxc5
R8d7#
Rdxe4#
Rce5+
R5a7+
Rgxc3#
Rfc3+
Rab1
R7xb5
Rec2+
Rfxg2+
R5xh7+
R8xg3+
Rg7+
R7f8#
R3b7+
R5xf1
Rxf6#
R4h2+
Rha1+
Rhg7#
Rhd6
Rexb7+
Rfe8#
R1xg8
Rgxd4+
Rhd4
Rce3+
R3g7+
R5xh6#
Rexf8+
Rdg8
R7xf3#
R5c4#
R3xc4
Rec4+
R7d8+
R8c2#
Raf1#
Rhg4+
Rde5
Rhd7#
Rcd2#
Rhxd4#
R2d5#
R8xa3+
R6b4#
Rce8+
R6xa7
Rfc7#
Rhxb3+
Rea1#
Rhc3+
R2e7
Rbh1+
Rgxh4
Rdb4
Rga6+
R5d4+
Rfxa1#
Rbxd2#
R5h7+
Rbxf1+
R5xh2
Rhxa1+
Rf6+
Rda8
Raf5#
R3d5
Rch5
Rbe6#
R1a3
Rfxc4
R1xb3#
Rdb5
Rxe1+
R5xe2
Ra1+
R2f6+
R6xb4+
Rfd5
Rdxh4+
Rbc7#
R1xf3
R2xb8+
R2xf8
R6h3#
Rgxc6#
Rcxh8+
R7h2#
Rfxe1
Rhb1+
Rfe3
Rfxe4
Reb2+
Rxb6#
R3xc7+
Rcxf3
R4xe5#
Rca6
R1xe3#
R8b7+
R7a2
R2xe3+
Rbf8
R2e4#
R3b1
Rbg4+
Rxf3#
Rgxe6+
R5xg6#
Rae2#
Rf4#
Rxb8#
R7f8+
Rac1#
R4xd3
Rc4#
Rgf7+
R1xg4
R7xf5#
Raxc6
Rxd2
R4xa8#
R3xb6#
R3d6#
Rgxb8+
R4h5#
R6xa1+
R1g8
Rxd4+
Ref4+
Rcb8
Rbxe6
Rcd5
R4xc2#
Rxf5
Raxd1+
R2c6+
R1xb5#
R1xb8#
R4xg6+
R6xd7
R6xa5#
R3xa8
Rhxd2+
Red5#
R2d3
Rexf2#
Rxh3
Rbc2#
R1b2
Rbxf3+
R5g1+
Reg7
R3d7+
Rch8#
R1xd8#
Rbh2+
R7f2+
Rf5
R3xa2#
Rhc5+
R1xf5+
Rbxc3
Rfa4+
R4d1#
R4h3
R2a4#
Rcg5
Rexa4
Rhxd1+
R3xa1
R2xa5+
R8g2
Rdxe7
R1xf7#
Rbxa1+
R2xh4
R6b8#
R6e7#
Rdf7
Raxf8#
R5f8
R8f3+
R8xc2+
Rcxd5+
Rhxb1+
Rgc5
R3a5#
Rdxf4#
Red8#
Rhb5#
Rcxg5+
Rbxa1
R6xb5+
R7c6
Rxh7+
Raxe1
R4d8
Rhb8
Rexh7#
Rbf4+
R3a8+
Raxb5+
Rgf5+
R3d6
Rbd8
Rhxc6
Rba4
Re6#
R6a2
Rexc1+
R5xh6
R3xb2+
Rdb2
R8xh3#
R6xh8
Rcxd2#
Rgxc5#
Rab2#
Re7+
R5xh3#
Rfxc7#
R4f8+
Rhxd7
Rf8#
Rbe2#
R8b3+
Rah6+
Rfa3+
R4a6#
R3c2+
R4e2+
Reb5
Rgb6+
R8f1
R5b7#
R1xg6+
R6xh5#
Rgxf5#
Rdxa2#
R4xf3#
R1d5
Rhf3+
Rah8#
Raxh6+
Rhf5+
Rda3#
Rbxc4+
R1d2
Rhg5+
R5c1
R2xh7+
Rhxg4
R6a2#
R5xc4+
R8xd6
Rde7+
R2h5
Rch8
Rhg4
R5h6
R8xe4#
Rdxh8
R5g3#
R6g8+
R1d5+
R7xa3
R6xa8
Rfxa3+
Rgxh3
Raxc2
R6a3#
Rcxe3+
Rgf5
R6xd4+
Rgc1+
R2xh5#
Rhxb4+
R8xa1#
R8xh3+
R1c8#
Rfc1
R5g6+
R4e3+
Rhe8#
R1f7
R7xe5+
Raxb7
R1xc4#
R8d7+
Rhxc3+
R8a1#
R6c2+
Rca1+
Rcxf2
Rbe7
Rdh2
Rbf6
Raxg1
R2xe6
R6xh7#
R5h6+
Rbc5#
Rgh1#
Rhxf6
Rbg4
R7xg8
R5f6+
R6xb8#
Rcxf4
Rgf2#
R2xg5+
R3c1
R7h1
Rhxb2
Rgd3#
Rfe5#
Rc4
Rxc7#
Rbxg4+
R5xd1+
R4f5#
R4g8
R4d3+
R1b7+
R7xd6
Raxc4#
R1xe3+
Rgb7
Rde7
R6xf8#
R6xg2#
Rgb2
R6xa1#
R6e4+
Reb4
Rbxf5#
R1h4+
R4f5
R2xf8+
R4c2+
R3d2#
R4xc7+
Raxd7#
R8b7#
R3e1#
Rea2
R2xd1
Rbxg6
R6f8#
Rch6
Rbf3#
R1d6#
R1a7#
R2xb5
Rec8+
R5xg3#
Rfxe8+
Rfxe1#
Raxh6#
R2e3+
Red3+
R2h1
R8xb5#
R6f4#
Rgxe2#
R1e6#
R6a8+
R1f4+
Rgxb4+
R1xf6+
R4e7+
Rdh3+
R5xc8#
Rexb3#
R3f6+
Rhxd5#
Rbc3+
Rd5+
R4xb8+
Rcxe1
Rae2+
R2g1
R2xc4#
Rch3+
R1e4
Rbc1
Rhb2
Rfxg6+
R6d2#
R1xh7#
Rexc7+
R2b8
R1f5+
R7xd4+
Ref3+
Rfxh5+
R4xc3
R5a6+
Rgxf3#
R3e8#
Rgxc3+
R6xf7+
R2b7+
Raxb4+
Rf1
R3e2#
R1c7+
Rca6+
R3c7#
R5f6#
R2xe6+
R8a6#
R7c6+
R3xd4
Reh1#
Rcxg5#
R5xg8
Rhxb7#
R8a7+
Rhxa7#
R3c8+
R6h4+
Rbd5#
R3xg1
Rhc2
R2e5+
R2xd4
R8f4
Rhxg3#
R7xc1
Rdxh4#
Rhe8
Rab6#
R2xf7
R8xa1+
R2d1+
R2xc8+
Rac4+
Rhf6
Rh7+
Rae7
R1xh4+
Rdb4#
Rdb7
Rdb3#
Rfxb5
Rac2#
Rdxb1+
Raxg4
R5e2
Rfxc7
R6xb3+
R1h2#
Rbc2+
R3xg7+
Rca3
R5xe6#
Rgxh2+
Rfa1#
R6xe7
R1xe2
R2f3#
Rhf2
R6xd3+
Rhb3#
R4b5+
Rbg6+
R6xb2
Rhe3#
Rgxf7
R4a5+
Rfxb1
Rbc1#
Rbxe1
Rhf8#
Rexh6
Rexh3#
R7xa5
R7xh1#
Rgb3+
Rgd6
R4xa3
R2a5
R8f3#
Rga2+
Rba3+
Rhxf3#
Raxe8#
Rea1+
Raxf8+
Rhf4#
R4xf3+
R4b6#
Rexf2
Rcxd1
R5xa4#
R1a4+
Rxb3#
Rfg6#
Rba2+
R2g4+
R3xf8#
Rag4#
R2xd8
Rce2+
R8xd1+
R8xg6
Rbf5+
Rha6+
Rcd5+
Rfxh5#
R5e8#
Rdxb8+
Rfxe6
R6xe1#
Rdxe4
Rxf5+
Rbxg1+
R8e2+
Rcg6+
R4xc1
R2xb8#
R4xf6+
Raf5
R8xa5
R6xc2+
R2xg3+
R8d4+
R2h4+
Rbf1
Rce1
R5b1#
R7f6+
Ra2
R3b6+
Rcd6+
R7a8+
Raxd7
R2h4
Rxf4+
Rcxf3+
Rah6#
R5xe7#
R3e2
Rdxc3+
Rfa8#
Rexb8#
R4a3
R8xa6+
Rdxb2+
R5xc6+
R2c4
Rdxf6
Rgb6#
R5c6
Rde5#
Rbxe2+
R8b2+
R1xb8+
Rbg7#
R2e6+
Raxc7
Rdf5+
Raxc8
Rbg2+
R3g4#
R1a3+
Rda8#
Rb8+
Rgxa7+
Rdg1
R3f7
R8xf4
Rfh6+
R8h5
Rae2
R8e2
R5xf2#
Raxe5
R7xc1#
Rgxd5
Rgxd8+
Rhg7
R8h6+
Reb6#
Rxe3#
Reg2
Rdxf8#
Rhxd8#
R6h7+
R6b8
R8c3
Rfa1
R1xd5
Rxh1
R7h6+
Rbe7+
R7xf4#
Rgc4+
Rag3
Rh3+
Reb6
R2d5
Rxc2
Rgxd8
Rdxc5+
Reg4+
R7xa1#
R2c6
Rfd8#
R7xa3#
R2xd8+
Rexg1
Rdxh7
Rcxd4+
Rhe2
Rcf1
Rbxe8+
R1xe8#
Rxh8
R3xd6+
Rcb3+
R1e5
R1xc5
R4b8#
Rd7
R7b6
Rgxe7+
R1xa5+
Raxe2#
R6xg8
R2f1
Rdxc7
Rhxe3#
R3xf1+
Rgxc1
R2xa7+
R7xd4#
Rfb3+
R1xd4
R2xh3#
R2f3
R2xg5
R3xb4+
R1xa2
R4g5
R2xf5+
Rhxa3+
Rxc5#
R1f3+
Rfd7+
R2xd5#
Rdxg3+
Rah2#
R5xd6
R8h3+
Rcxh4
Rdxg3#
Rfg6
Rda1#
R5f7#
Rcxb4#
R7xb2#
Rhd2+
Rgb4#
Rca4
R2c7
Rdh7
Rdxg1#
R4c6#
R2d3+
R2xg6#
Raxd5+
Rdxg5
R4a8+
R6d7+
R4g2+
Rgxe4#
R1h7#
Rgc5+
R1a3#
Rfxa4
Rfxd4#
R5xf3+
Rfxa6#
R3f8+
Re8+
Rexf4
R2xb3+
R3b8+
Rfd5+
Rgxe3#
R6xh4#
Rhd5
R7xf8+
Rfc8
Rgxd7#
Raxh6
R7xb6+
Rg7
Rxh5
R8h3#
R8xe5
Rxf7#
R6xh7+
R3b6
R2f4#
R5c2#
Rg8
Rxb5
R3xa6#
R1g7
R2xg1
Rdxc4
Rb3+
Rha6#
R3c7+
R5xe6
R8xf7+
Rxe5#
Reb5+
Rac2+
R3a4
Raf7+
R8g7#
R6xd4
R7xc2
R6xb3
R4xb1
Rdxe3+
R7xa8#
Re6
Raf8+
R6xf3
Rga1+
R4xd5#
R6a4+
Rbg1#
Rdxa1#
Rgc2#
Rgxa2#
R3xf6#
Rge3#
R6xc7
R7e8
Rc7
R2xb4#
R5xe1+
Rcxh2#
Rga6
Rgxa3+
Rde3#
R5xg7#
Rhc7+
R5f8#
R7xd2
R7g4+
Rdc4+
R7xd5#
Rd6#
Rdxh7#
Rhf5
Rcf8+
Rbxa4
R6g1
R2b5+
R1e3#
Ref2#
R1f2+
R2xa3
Rbxh3#
Rdh1
Rcb8+
R7xa5#
R8xf1
R1f3
Rdf3+
Rfa2+
R3g8
Rac5+
R5xh6+
R1xa6#
Rdxe5
Rfg6+
R2d6#
R3xc1+
Rfxg7+
Rgxc5+
Rae6#
R4xg3#
R8xg3
Rda1+
R2xg1#
R3g4+
R3a7#
Rhxf6#
Ra5+
R7g2+
Rxc3+
R4f7+
Rea7#
Rdxh3
R4g7#
Rgc4#
R8f6#
R1xh8+
R2xf5
Rbh2#
R1xb2+
R3xe6
R3xh7+
R7g6+
R1xg6#
Rfg8+
Rfh7+
R4xg1
Raxh5
Rfd4
Rba1+
R5xd4
R5xf2+
Rxh4#
R3d4#
R4xc6
Rdxh5#
Rd3+
R2f8#
Rhd8+
Rgxa4
Rad1+
R3e7
Reh8#
R7e1#
Raxd3+
Rch7
R2xh4#
Rcxh7+
R3xd1#
Rcxb2
R6h7#
R4xc2
Rxh4+
Rhg8+
R7xh4
Rh6#
Rag8#
R6xf2
Rhxf4+
R6xd8+
R2xh1
Rgxc3
Rdxc3
R8xh5
Reg2+
Rgxe8+
Reg8
R8xa6#
R8a2
R1xb3
R8g5+
R6e5+
R8b1#
Rfxe5#
R3xe6#
Rgxh7
R3b2#
Rhb7+
R5xc1+
Rad7
Re3
Rdb1+
Rec2#
R8xg6#
Rgxb6#
Rfd7
R2xc7
Rhg3
R4c5#
Rbd2+
Rec8
Rbe3
R6xe8
Rcf8
Raxh2#
R7d4
Rhxe6
Rgh1+
Rhxb6+
R3xh1#
Rgxd4#
Rxf8
R6h2#
R8xg7
Rcxg6+
Rxg4
Rxa2
Rb1
Raxg8#
R3xh6
Rgxa6#
R6a3
Rbxg8
R7e2+
R8xc3
Rhd4+
Rxh5#
Rh4#
Rbxh5
Rfa8
Rhxf8
Rbxf7+
Rah7#
Rxc6#
R6b7
Raxf4+
R2xe5#
R3f5+
R7xd4
Raxd8
R5a7#
Rfxd1+
R3g1
Rbxd7+
Rdxg7+
Rdf1+
Rdf2#
Rdxa6#
Rha2
Rexb3+
R4h7
Reg5+
R8xb4
R6a5
R8xb3+
Rdxh2+
Rfg1#
R1xa3#
R3b5+
R7b1#
Raxf4#
Rha7
R7xh1
R8c1#
R5b2#
R8xf2#
R7h4
R7xe2+
R7b5
R4xc6+
R1xg6
R4xe2#
Rfa3#
Rfh1+
R1xb6#
R7a5
Rgxb6+
R8d5#
Rfxc5#
R7b8
R2a7+
R8e1+
R5xf7+
Rcxb8
R8g7+
R6xe4
Rc8#
R4xa2
Raf8#
Rgxf6
Rh7
R2b3+
R3xf7
R5xd6+
R8xc5+
Rfxd2#
Rgxh6#
R6g5
R4d8+
Rg5+
R4xb7#
R6xh2
R1c5#
R3xh5#
R6d5+
R6c8+
Rdf1#
R1a6
Rxg7
R8xh5+
Rhb4+
R8g1+
R2xe7#
Rga6#
R7xe1+
R6xa8+
Rexb7
R8g7
R8a4+
R2xf6+
R8a6
Rgxa2+
R1xh7+
R4xh8+
R7a6#
Rcxg1
Rgb8+
Rexa1
Rhxb1#
Rxh2
Rxd2#
Rfxb6+
Rhxe2#
Rbe5
Rea4+
Rxf2#
Rda6+
Rxd3
Rdxa5
Rexd7+
R1h3#
R2xa5
Rbf7+
R7xf4
Rha3#
R3xc5#
R7d8
R3e8
Rfxd3#
Rad3+
R2xd3
Rhxd2#
R6xh3+
Rhxe8
Rdxc5#
Rxd3#
Rgxa5+
R2g1#
Rbxa5#
R2xa5#
Rdg3#
R1xb6+
R8h7+
R8g2#
R2h5+
R3xg1#
R2xd7+
Red4+
Rdxf5#
R2e7+
Rch1#
R8xc3#
Rfe6+
Raxd5
Ra5#
Rhxg2
Raxf3
Rgxb7
R1xb2
Rexh8+
R5xd7#
R3e4
Rfxg5#
R5a6
Raxc3+
R4b1
R3h4#
R5xc1
Rfxe6+
Rhxg7+
Rexd8+
Rhb2+
Rcf8#
Rhxd3+
Rhxa7+
Rcxb5#
Rxb5+
Rgxe8
Rdxf6+
Rdxa7#
R2a1+
R2xf7#
Rf7
Rbe6
Rexf3
Rxb8
R3xe2+
R8xf4+
R8xd2+
Rhxf1#
R3a6#
Rbxf6+
R2xg4#
Rda4#
R3d2+
Rdxb5+
R3a2#
Rdg1+
Rdxe7+
R1c5+
R6f1+
Rfc7
Rad8#
R6d8#
R8xg1#
R7xg3
Rdxa4+
R7c5+
R8xe5#
R2b1+
R8xh5#
Rfxc1#
R3g5+
Rba6
R4c6
R4xb7+
R5b1+
Rdxe1
R8xf5#
R3c8
R8xb7#
R4xa5+
R2xc6
Rea8
Raxf7#
R5g8#
R4xe3#
Ra4+
Rh2+
Rhxb5#
Rhe2#
R6xa7+
Rhxc7#
R5b6#
R2f7
R6xd5#
Ref4#
Rad2
R3d4+
R4xh5
Rxf6+
R2h7
R4xe6#
R1xd5+
Rxe8+
R5e7
R2xb3#
Rce4#
R7xd3#
R3xg8#
Raxh5#
R3f4
R8xe6+
Rbxd4#
R5xh7#
Rexd1#
Rc6+
Raxh1+
Rcxh7
Rdxh5
R8xh4+
R4xc3#
Rxe6#
Rexa6
R7xe3#
R7xf2
R7a1+
Rhxc6#
R6xf1
Rexc5
R7c3
R4c1+
Rexg6#
R3d8
R8e3+
R5xa3+
R7c4
R5xh3
Rbxa4#
R5xg3+
R5b1
R7xh5
Rc6
Rbh8#
R4xg3
Rha5
Rgc3#
R7xd1#
Rfa4#
Rca1
R4xd3#
R3xb2
Rbe6+
Rbc3
Rfxc8+
Rfxb1+
R8xf3
Rgc7
Rcxg4#
R7xf6+
R4c5
Rcxa7+
R5e6
Rexd2+
Rfe1
Rdxb1#
R4d3
Rae6
Rbg2
R7f1#
R4c2#
Rad8
Rae1
Rexb8+
Rdc8#
R7e1+
R1xh5#
R7xc8#
R5a8+
Rhd2
Rah4+
Rexb5
Rbd2#
R3h8
R5xe7
Reh3#
R3h5+
Rfxg6#
R6a7
Rb8#
Rac4
R5xh8#
R3a4+
Rexh1
Rfe8
R8h7#
Rbc4#
Rgxc8
Rh7#
R3g6#
R8xg6+
R2a4+
R8c5#
Rxe5
Rxe6
R5d1#
Rexa3#
Raxc8+
Rgxa5
Rfd3
R6xh3
Rfxg7#
R8xf1+
Rgxb3
Rbe3+
Rcxa3+
R7e3+
R5e4
R6d3#
Raxc3
Rgxf2#
R5xa7#
R6g3+
Raxg1+
Rgf8+
Rexb6
R1xa7+
Rfxb7
Rac1+
Rfb4+
Rdb6+
Raf6
Rba7#
Rexd8
R6xc3
Rexg4+
R2a3#
Rcb4+
Reh4+
Reh5+
Rxa8+
Rbe8
Rxb2+
Rdf8#
R5f4
Rfxh7
R5c6+
Re4#
R8xb5
R5a2#
Rxg4#
Raxc1+
R6xb4#
R8h5+
R6e8
R6e8#
R5xa1#
Rdxf3+
Rfa2
R5g7
Rbxc8#
R8h6
Rfh7
R3xe7+
Raxe6+
Rxb2
R2b5#
Rfa2#
Rhxb7+
R5h1
Rxg5#
Rxa5#
Rac8+
Rbd7
Rge3
R2g7#
R1c5
Rf6
R5b8#
R4xa7+
Red7+
Rf7+
Rxa7
Rfxg1
R5h1#
Rch4#
Rbc8+
Rxc2#
Rhg5#
R5xa7
Rxa3+
R1f5#
R4h5+
R5xb3#
R7xg5
Rhc3#
Rc5#
R5h7#
R3f4#
R3xh2
Rexd1+
R8xd3
Rfg4+
Rexd6+
R4xg2
R2h8
Rdxc6+
Rhxg5
R7xh6+
Rhxd4+
Rge1
R6xe3
R8h4+
R3c5
R6b2
Ref6#
R2b7
Rbg6#
R6xa3#
Rbg3+
Rdb2+
R5c2
Rhxg6#
Rca3+
R6e3+
Rc5+
R7f3+
Rbxd8+
Rgf6+
R1xh7
R3xg2
Rhc4+
R5e8
Rfc3#
R5d7#
Rea5
Rcxh3
R1g6
R6xg5#
Rhc4
Rhd7+
R1b6+
Rec3
R3xf2+
R2a1
Rbd6+
R6xc8#
Rexf4+
Re1#
Rdxh8+
R7h5
R3f1#
Rdxe8#
Rde6+
R5d6#
R6xg2
Rhxf4#
R1xb7
Rbxe5#
R2g5#
R1a5#
R4b7#
Rdc7+
Raxg1#
R8xh2
R8b4
R3xb5#
Rgf2+
Rgxh1#
R3g6
Rb4
Rhb1#
R1xg8#
Rhf7+
Rhxa7
Rba8
Rg3#
Rfxg8+
R1xe2+
Rgc2+
Rba2
Rexf3+
Rdg2#
Rfe4#
Rgxe4
R3c8#
Rexa8#
R4g8+
Rbh6#
R6d2+
Reg6
R8g1
Rch4
R2a5#
Rcxa3
Rcf5
Rcxg8+
R7xc5+
Rba5#
Red2+
R3f7+
R6xa2+
R8c5+
R5xd1#
Rgxf1
R7d2#
R2xd3+
Rbxd3#
R5xe1
Rca1#
Rda5+
R7e8#
Rd4+
Rbxe6+
R1xa2#
R4xh6#
Rc1
R4c3#
R3c5+
R1xh4#
R7xc8+
Rexb2+
Rd3
R3xb7#
Raxe6#
R8e6+
R8xh6
R5b8
Rge2+
R8xd6#
Rb4#
Rbxh8
R7xd6+
Raxf3+
Rdxg2#
Rbf6+
R1b3#
Rhc5
Rhxe1
Rgh4#
Rdxc8+
R2xa7#
R7xe6+
Rfxe5+
R5d7+
Rdf6#
Rbxc5+
Rdxa3
R1xe8+
R6xe7+
Rcxb3
Raxg5+
R8d5
R6xf2#
R2b1#
Rec6
R1e3+
R6xc4
R8f2+
Rcxh2+
Rdf1
R4a1#
Rfa7+
Rgxd5+
Rcd7+
R3h7+
R1xd2
Rhd3+
R3d7#
Rcg2+
Rfb6
R7a1#
Rxb1+
Re7
Rfa5
R6xc4+
Rxg2
R1xg3
Rfg5#
R4xb8
R6g7+
Rgxf6#
R8xh1+
R2xd7
R1xd3+
R1xb3+
Raxe4#
Rab2
Rhxe2+
Rcxg8
Rbd6#
Rfxh1+
Rcxg8#
Red1#
Rdxg1+
Rdf7#
R3xd5+
R6d3+
Rcxe4#
Rxe2#
R6xh2#
R4xa7
Rexc6
R5xa2
Rca8#
R5g1#
Rexd3+
R5xh1#
R4d1+
R7xb3+
R5h8+
Raxe8
Rbh5
R1xa3+
Rad6+
Rah4
Rhxc5+
R3xb8+
R1xb7#
Rxh7#
Raxh3
Rdg3
R7d2
R4g7
R5c7+
Rh3#
R4xh6+
R7xc2#
Rfc1+
Rgb4+
Rad6#
Rhf8+
R7b4#
Rfg3+
R2xd5+
Reh7
Rxf3+
Rfb7+
R3xf5+
R5xf6
Rexh1+
R3xg2+
Rfd3+
R6xa5
Re5#
Reg8#
Rhxf2+
R7xg1
R7xf5+
Rbxg4
Rcxh1#
Rhg4#
Rhxd1
Raxd1
R2xc5
Rah7
R8c3+
Rxa5+
R7d4+
Rh2#
Rbxc2+
Rha7+
Rgxh7#
Rexh2
Rdxg7
Rdxa6
R6xb3#
Raxg3#
Rgxd2+
Rab8#
Rgxa3#
R5c8#
R4b7+
R7xd1+
R4xg5
R4h3#
Rcxb4+
Rcxa1+
Rfxe1+
Rfxb4
Rcxh8
R3b5#
R4xd6+
R6xd4#
Rhg2#
R2g6
Ref8
R4xf1+
Rac1
R4f2+
Rhxf1
Rd3#
Raf1
Rexc4#
Rhxf7
Rgxf8
R6h3
R2xe1+
Rexh5+
Rdf6
R3e6+
R4xb3#
R8xd2
R1g3
Rfc8#
Rdxf7#
Rgxh4#
R4e7#
R8c2+
Rgh8+
R8f5+
R7f8
Rdxa8#
Rc3+
Rba3
Raf2
Reh8+
R2b4
R2xb1#
Rhxg7
Rhxe8#
R4xa2#
Rb7
Reh2
R8xf3+
Rfa3
Rde3+
Rxe2
Raxd4#
Raxh4
Rexc5+
Rhc6
R4xd3+
R3a1
Rdxa3#
Rgxh5#
Rxc1#
Rxh7
Rgxc8+
R5e1#
R8xe1+
Rcxb3+
Rch1
R1a8
Rdb5#
R2xb7+
Raf7
R3a5+
R1h7+
Rce6#
R1e2
R7xh5#
R2xe3
Rdg4
Rdc2
Rdxc1
Ref3
Rfxh6#
R5h3
Rhb5+
Rcxf7
Rfh4+
Rdb7#
Rbxc3#
Reh6+
Rcxb6+
Red6+
Rde1+
Rag6
Rde4
Ref7
Rexf8#
R4xd8#
R5xe1#
R5d7
R6xc1+
R8xg1+
R2a6#
R3xc5
R4xe6
Rgf8
Rae3#
R8xe3+
Rexd5#
R7xf8#
Rga2#
Rad6
R1xe6+
Rhxc4
Rfb1#
R7c2
R7b8#
R1d2+
R4d2#
Rge8+
R8e7#
Rca7+
Rfxg5+
R5xa7+
Rcb8#
Rcxe6+
Rhxg5+
R5f7+
Rfxc6#
R3xc8
Rgxa7
R6g2
R6xb5
R4xa8
R1b4+
R3f7#
R6xe1+
Raxb1
Rgc8#
R8e6#
Rxa1+
Rge7#
Rexg3#
Rfxb2+
Rbd5
Rdxe8
Rbf2
R1xe5#
Rgf1+
Rcxd5
R1xg2
Rexd5+
Rcxg1+
Raxe5#
Rd2
R8xd2#
Rbxh5+
Rbd4#
R6g4
R7xc3+
R4xc5#
Rfxa5
Rd1
R3xh5+
R1g3#
R8a3
R3xd8+
Rxd1#
Rdh3#
R3xe7
Rexb5#
R5xh8+
R7e5+
R8b2#
R5b2
R1h3+
Rfxd4
R6c4#
R5g2#
Rfb8#
R6d7#
R1b5+
R2b4+
Rgxd2
Rgxd3#
Rxf7
R3e2+
Rca5
Rcd6
R8h6#
R3xc2
R2xa8
R1h6#
R8xf5
Rab5+
R2f1+
R7f5+
R3xe8#
Ra1
R6xh3#
Rbd8+
Raxc2+
Rcd8+
Rcxf6#
Raxb2#
R2e5#
Rdg5#
Rdxg5+
R7xh3+
R4xh3#
Raxd2+
Rfc5+
Rhg2
Rxe1
R7xc6
Rec7
Rdf3
R2xb7#
Rfh3
Rca7
R5f3#
R7d3+
Rgc7#
Rgh7
Rfa6+
R3xe8+
R4xg2+
R5b6
Rgxd7+
R3h2+
Rg4#
Rfxd7
Rbh7
Rdxb6
Rec6#
Rha2#
Rfe4+
Rgd1+
Rgh7#
R5xc6#
R2d4
R4xb5#
Rda2#
Rd7#
R2h6+
R2xa6+
R7h1+
R4xh2+
Rgxh8
R3xb2#
Rf4+
R4xd8
R6f5#
Rcxg3+
R5d6+
Rh5+
Rhxg7#
Rbxg8#
R5xe8+
R3h7
R4xg8
R5h2+
Rd8+
R4xe7+
Rexg6+
Rag2+
Rdxg6#
Rbxf4
Rxb4+
Rxc1+
Rxe1#
R2g8
R1xa4
R7c4#
Rbe2
R7xa2+
Rah2
R5xf7
Red3
R3d7
Rdg7+
Rfe6#
Rch6#
Rbxg2+
R6xd7#
Rxc2+
R3g1#
Rgh7+
R6g7#
R7xe4
R7g3
R1xa4+
Rxa4
Raxg7+
R4xa8+
R2xf3
Rfxg8#
R6xb2+
R3xf2#
R2xh7
R7xg4+
Raxc2#
R1xc2+
R2b3
Rdxc2
R7g3#
R2h1+
R6c4
Rcxg7
Raxc3#
Rf5#
Ra1#
Rcf4+
R2xf3+
Rhe6#
Reg6+
Rhf1+
Rhc2+
R8xc4
Rfxc5+
Rhxc2
Rdxh6+
Rexb1+
Rcxf8#
R6c3#
Rgc8+
Rbh4
R5c8
Rfxa3
R8f1#
Rce7#
Raxb5#
R4a2
Rhxd8
R5xh4+
R6xd5+
Rfe7+
R5d3
Rbxd8
R4xf7
R2xh8#
R6xa4#
Rexa6#
Rxg2+
Rfd2
Rca8
Reb7
Rhd2#
R1xe7+
Re2#
Rad3#
Rae1+
Rxd6#
Rdxa2
Rdf4#
R8xc4#
R7b6#
R3xh4+
Rcxb8#
R4xh3
Rexb6#
Rae5+
R1xb7+
Rfd8
R7c4+
Raxc1
Rgxc2#
Rha8#
R3xf6+
Rexh6+
R2xd6+
R4xc8+
Rca6#
R6e3#
Rad3
Rexc4+
Rb1#
Rhxd6+
Rfxd7+
Rexf5#
R1xe4#
R7d5
Rca2
Rbc4
R8h5#
R5xd2#
R1xh3+
Rcxh4#
R2xh8
Rgxe8#
R2xh3+
Rbf4
R6h8
Rgxb6
R3xh4#
Rbxg5
R2xh3
R6f2#
Rdxb7
Rcxg7+
R4xf1#
Rgxb5+
R4xe6+
Rcxh6+
Rab8+
R7xb4#
R4xd2#
R1xh6#
Rgxh6
R4c1
Rac3+
R1xh2
Rcxf6
R3xe2
Rxe6+
R8a1
R6xf7#
Raxb7#
R5xf4
R1xf4#
R3xa5#
Rad2+
Rcxa8+
Rda3+
Rcg8#
R8h2#
Reb3+
Rdh5+
R3xf8
R7b1+
R3xg5+
R8e5#
R5h7
Rbe8#
R2xb1+
R4xg7
R8c7+
R1c3
Rcg1#
Rexc2#
Rhe1
R5xa8#
Rea5#
R5c7#
R1d7
Rxg4+
Rhg1
Rgxa8
Rce6
Reg3+
R7a2+
Rdc5
Rcxe2+
Rbxd1+
Raxd6+
Rxf2+
Rdxf3#
R3g7
R1h8+
Rbxh4#
R1g4#
R6h2
Rbxa4+
Raf8
R6xc1#
R7h1#
Rec1
Rdf3#
Rcxb1+
Rfxe7#
Rfb6+
R4e8#
Raf6#
R1xe4+
R6f3
R5xe8
Re2+
Raxd2
Raxg3
R7c5
Raxh3#
R6d4#
R6e5
R4h3+
R4xd5+
R7b4+
Rgxh5+
R8a5+
Rbxg3+
R4c7+
Rbf1+
Rdc7
R8e4
R7xd1
Rga7
R1d8
Rdg3+
R2h1#
Rfxa5#
Rbxe3#
R2xb5#
Rfg8#
R5xc4#
Rac6
Rda7
Rbc6
Rexb2#
Rga7+
R5xf4+
R6xc5#
R8a2#
Rexg3+
Rab3
R6g4+
Rhxb4
Rba4#
Rch4+
R2b8+
R2d5+
Rfc2
Rf3
R1c7
Rhb2#
Rgxf1#
R6g8
Rhxa5#
Rcxb5+
R4a6+
Rexh5#
R4c5+
Rfg1
R1b7#
R7b3#
Rb1+
Rbxd6#
R5xe3#
Rgxf2+
Rdxe3#
Rde7#
Rcxh3+
R5xh7
R1xa5
R5d3+
Rgd7
R7g5#
Rhg1#
R2xa7
R2e8#
Rgxd1#
Rexa5#
Reb1+
R7c5#
R7xh4+
Reb7#
R4a6
R4xf2#
Rdb4+
R5xe8#
R5xc8+
Rhxg8#
Rfc7+
Rfxb3+
Rg5
Rgxf2
Rbxf1
Rcxg6
Rfxa2#
R1h2
R5g2+
Rab3+
Rfxc4#
Raf3
Rxg2#
R1d4+
R8g5
R6f3#
R1e2+
Rhd4#
Rxe8#
R8g6
R5c6#
R8b1+
R3g1+
Rae8
Rag1+
Rhe5#
R2e1
Rcxd4
Raf1+
Rba1
Rcf5#
R1xd6#
R4xg3+
R7a5+
R4xb8#
R7c1+
Rbc2
Rde6#
Rb2+
R8e7
R4h6+
Rbxg2
Rba8+
R3g2#
Rb2#
R1a8+
Rcxf7#
Rbxa5
R5xg2+
Rhxe4+
Rh6+
R5xd3#
R7h6
R4g2
Rhxc7+
Rgf6
Rhxf1+
Rhg6+
Rcb7
Rfxh2
R7c2#
R2xc5+
Rgc6#
Rexh2+
R5g2
Rac5
Reg3
R4xh8
Rea6#
Rab3#
R7xe8+
Rcxe3
Rd6+
R8xb1
Raxf2#
Rhxb8+
Rbc6+
Rhxd3
Rhe5+
Rgb1#
Rhe4+
Rdxb2#
Rgxd3
Rgh6
R3xh2+
Rag3+
Rbc8
R2xf7+
R3xg5
Rcg5+
R1xd7
Rfe5+
R6b7+
Rcf6#
Rhxa8#
Rdxb6#
Raxg2
R2xg7+
Rbxh2+
R1xg4#
R7h4+
Rbd1+
Rag1
Rfxg1+
R8xb2+
R3xe4#
R1h7
Rgxe7
R4e8+
R2xa3#
Rxg1
Rf1+
Rdxf5+
Rhc5#
R6f2+
R5xc3#
R6xc4#
Rbxe8#
R1xh4
R7xa4#
R6xg8+
Rexa3+
R1xf8#
R1g5#
Rf3+
Rdxh1#
Raxf6+
R4c7#
Rdxg4#
Rcxe8+
R7xe1
R7xh8
R8xa1
Rxa6#
Rdc4#
Rgxf5+
R1xb5+
R2xc7+
Raxh7
Rcxd6+
R8xa3#
Rcxg4
R6h1
Rfxe4+
Rhe6
Rxe4+
R8xg3#
R3xe5+
Rfg2+
R4e7
Rfxg1#
Rdc3
R7xa4
Rcxe1+
Rdh6#
Rhxa3#
Rhxc1#
Reh6#
Rha6
R7xc3#
Rcd6#
R6a1
Rbxg3#
Reh2+
R1h4#
Rfh7#
R7xa6
R6xc7+
R2e7#
R5e2+
Rcg4#
R3xc2#
Rh1#
Rexg2#
R4g2#
Rcd2
Rac7
Rfxc2
R3xh1+
R2g8+
Rhxd8+
R4d6
Rfh3+
Rhxa1#
Rhxg4+
R7a6
Rdxh6
R8b5
Ref2+
R5c2+
Rgh5#
Rgxh4+
R3xa6
R2xh6#
R1d8#
Rbxd4+
R8xb2#
R5xc7
Rg8#
Rexh7
Rexh7+
R7xc4#
Rfxe4#
R1xg2#
R3xf7+
Rgxa4#
R7f2
Rgxa3
Raxh2
Rxb1
R7h3+
Rce7
R6xb7#
R1xh6
R5b7+
Rgxh5
Rfc2+
Rxh6#
Reg5
Raxc6+
Rdxb2
R1xe6#
R7xg1+
R1e4#
Rhxg6+
R4h8#
Rgxa6
Rfxc1
R2d1#
R5c3+
Reg4#
R5xh2+
Rf4
R2xg8#
R1xa7
Rexa7+
R1f8#
Rce8
R3b6#
Rdh8
Rexc2+
Rgh5
R6xf5#
Re1
Rbxa6#
Raxg7
Rexg5#
R2d4+
Rexh5
Rxb7#
Rhxa1
R1a5
R7xg2#
R7xg8+
Rfg7#
R2xf6#
R8xe1#
R2xa1+
Rha1#
Rbc8#
Rb3
R3xd7+
Rxe2+
R7d5#
R4xf6#
R2b1
R5xb2#
Rfd5#
Rcf3
R4c3
R1e3
R8e5
Raxe1+
R6b2+
Rdxh3#
Rgxe6#
Rbxh6
Rag3#
Ra2#
R8d6+
R4e6#
R7h8
R2xg8
Rce2#
Rc5
Rcxf8
Raxf5
Rgxe7#
R3g6+
R4xg2#
Rec7+
R5b8+
Rexf7+
Raxf5+
R8xg2#
R2b4#
Rdg6#
R4xb5
R5g3
Rga4#
R5xd8
R4e1#
Raxe7+
Rbxg5+
R8xb5+
Rfg5+
Raf3+
Rdf4+
Rde6
R8e6
Rcxh5+
Rhc8
R7e5#
R3b5
Rfxc2+
R1c4+
Rfxg4#
Rdxg8
R8d6
R5a4#
Raxe3
Rxf6
Rd5#
Rhxe7
Rhb6
Rxd7
Raxh1#
R6xb1+
Rch2#
